{"title": "Chicken Pesto Sliders Recipe", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢12pack Savory Buttery Rolls (King's Hawaiian)", "▢8slicesDeli Chicken (Dietz & Watson Southern Fried)", "▢6slicesLow-Moisture Part-Skim Mozzarella Cheese", "▢1-2cloves of garlic", "▢1cupfresh basil", "▢1cupfresh spinach", "▢1Tbsp.water", "▢1/4lemon juiced", "▢Salt and pepper"], "instructions": ["Pre heat oven to 375 degrees Fahrenheit. Spray a 9×13 inch (or dish large enough to fit all rolls) baking dish with nonstick spray and set aside.", "Slice Buttery Rolls through the center so you have a top and bottom leaving all 12 connected.", "Top the bottom rolls evenly with sliced chicken and cheese. Lay four slices of chicken down first and top with the next 4 slices. Lay out 3 slices of cheese towards the top half (viewing the rolls connected by 4) and 3 slice along the bottom so they evenly overlap.", "In a food processor or single smoothie blender add basil. spinach, garlic, lemon juice, salt and and pepper and blend until fully combined.", "Brush the tops of the tops of the sliders with some of the fresh pesto. Pour the remaining pesto on top of the mozzarella cheese. Place the tops on the rolls. Option: sprinkle with dried minced onion, sesame seeds or everything but the bagel seasoning.", "Place the rolls in the baking dish and CUT all 12 into individual rolls. Do this so that it's easy to pull apart since the meat overlaps and will need to be cut.", "Loosely cover the rolls with foil and bake for 15 minutes. Remove the foil and let bake for an additional 5 minutes to crisp the rolls some.", "Remove from the oven when the cheese has fully melted and serve. Enjoy your delicious chicken pesto sliders."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "These are best served right away so the cheese is melty.", "Use leftover turkey or ham after the holidays or use storebought rotisserie chicken for a chunkier slider."], "nutrition": null, "url": "https://ohsnapmacros.com/chicken-pesto-sliders/"}
{"title": "Sweet Jalapeno Corn Bread Breakfast Bake", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbsground turkey93/7", "▢32oz.container of Egg Whites", "▢3/4cupCorn Bread Mix – Krusteaz112g", "▢1Tbsp.Chili Powder", "▢1/4cup0% nonfat Greek Yogurt70g", "▢1/4cuptamed Jalapenos, chopped"], "instructions": ["Preheat oven to 375 and spray a 9×13 baking dish with nonstick spray.", "In a pan over medium heat brown your ground turkey. Once browned season with chili powder, salt and pepper (to taste).", "In a separate bowl mix egg whites, corn bread mix and greek yogurt.", "In the baking dish layer your cooked turkey, egg mixture and top with chopped jalapenos. Bake at 375 for 35 minutes until eggs are fully cooked3 .Note: the egg will puff up when baking, do not be alarmed, it will deflate back to normal."], "notes": ["You can use any Corn Bread mix but the macros with change accordingly.", "Use any type of ground meat.", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/sweet-jalapeno-corn-bread-breakfast-bake/"}
{"title": "Cinnamon Sugar Air Fryer Butternut Squash (low calorie)", "servings": "5", "prep_time": null, "cook_time": null, "ingredients": ["▢1large butternut squashchopped and cubed, 2 lbs.", "▢1Tbsp.olive oil", "▢1tsp.cinnamon", "▢1/4tsp.garlic powder", "▢1/2tsp.salt", "▢1Tbsp.brown sugar or sugar replacement"], "instructions": ["Preheat the air fryer to 350 degrees Fahrenheight.", "Peel the squash with a potato peeler and cut lengthwise with a sharp knife to expose the inside. Scoop out the seeds and discard.", "Chop the squash into bite size chunks and place in a large bowl. Add the olive oil, cinnamon, garlic and salt and mix to combine.", "Pour the seasoned butternut squash into the basket of the air fryer in a single layer and cook for 20 minutes or until fork tender and slightly golden brown, stirring halfway through.", "Remove and add 1 Tbsp. brown sugar, mix to combine and return to the air fryer at 350 for 3 minutes.", "Once done cooking, remove from the air fryer and enjoy."], "notes": ["Serving size is an estimate and will vary with substitutions.", "Serving size is for 3/4 cup which is about 114 grams.", "Squash can be difficult to peel. Use a potato peeler to peel of the tough skin to make it easier to cut into.", "Turn squash halfway through to ensure an even cook. If you have a larger squash, you may need to cook in two batches."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-butternut-squash/"}
{"title": "Egg White Quiche", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1uncooked refrigerated pie crust", "▢4slicesbaconcooked and chopped", "▢1.5cupsliquid egg whites350g", "▢1/2cupschopped yellow onion60g", "▢1garlic clove, minced", "▢1/2cupswhole milk120g", "▢1/2cupsLow-Moisture Part-Skim Mozzarella, shredded56g", "▢1cupArugula40g", "▢salt and pepper"], "instructions": ["Preheat oven according to pie crust package. Place one pie crust in a pie dish, poke a few holes in the bottom and bake 1/2 the recommended time. Example: if the package asks to bake at 425F for 12 minutes, cook at 425F for 6 minutes.When the crust is done cooking, remove from the oven and lower the temperature to 350F.", "While the pie crust bakes, cook and chop your bacon and prep your veggies.Heat a medium pan over medium and spray with cooking spray. Add garlic and onion and sauté until the onion begins to soften. Add arugula salt and mix until the arugula has wilted. Remove from heat and add cooked chopped bacon.", "In a bowl whisk together egg whites, milk, cheese, salt and pepper.", "Place the sauteed vegetables and bacon in the pie dish on top of the pie crust and evenly coat the bottom.Pour egg mixture over sauteed mixture. Be sure the cheese does not pool to the middle of the quiche, use a spoon to move around is needed.", "Bake at 350F for 45-50 minutes or longer until the egg its fully cooked and toothpick comes out clean. Always note – bake times will vary oven to oven.", "Slice into 8 equal slices and enjoy!"], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "Use turkey bacon, if desired."], "nutrition": null, "url": "https://ohsnapmacros.com/egg-white-quiche/"}
{"title": "Creamy Pumpkin Pie with Graham Cracker Crust", "servings": "10", "prep_time": null, "cook_time": null, "ingredients": ["▢1 1/2cupsfinely crushed graham crackersabout 12 whole sheets", "▢1/4cupgranulated sugar", "▢6Tbsp.coconut oilmelted, 90g", "▢1/4tsp.salt"], "instructions": ["Preheat your oven to 375 degrees Fahrenheight.", "In a food processor, pulse the graham crackers into fine crumbs.", "In a medium bowl, combine the crushed graham crackers, sugar, melted coconut oil, and salt. Stir until the mixture is well combined and has a consistency similar to wet sand. Press the mixture firmly into the bottom and up the sides of a 9-inch pie pan.", "Bake in the preheated oven for 7-8 minutes until slightly golden. Remove from the oven and set aside.", "In a large bowl, whisk together the pumpkin puree, sugar, cinnamon, ginger, cloves, nutmeg, and salt until well combined. Beat in the eggs one at a time, followed by the heavy cream, mixing until the filling is smooth.", "Pour the pumpkin mixture over the crust and smooth the top with a rubber spatula, if needed. Bake in the preheated oven for about 55-65 minutes, or until the center is slightly jiggly and set. You can also check the internal temperature is 185 degrees Fahrenheight to confirm it is done prior to removing from the oven.", "At the 30 minute mark, cover the edges of the pie with aluminum foil or a pie crust shield so the edges do not burn. You can cover just the edges of the pie with foil or use a pie shield to avoid burning the tips of the pie crust. To make a pie guard, cut a ring out of parchment paper and lay it over the edge to cover the crust and leave the center of the pie open.", "Remove the pie from the oven and allow it to cool on a wire rack for at least 3-4 hours to set.", "Cover with foil and transfer to the refrigerator to set overnight for best results.", "Slice and serve with a dollop of whipped cream on top of the pie, if desired."], "notes": ["All nutrition facts are an estimate and will vary with substitutions.", "You must let the pie cool on the wire rack for 3-4 hours BEFORE refrigerating. It is best to let this pumpkin pie cool in the refrigerator overnight! This is crucial for the filling to set properly."], "nutrition": null, "url": "https://ohsnapmacros.com/pumpkin-pie-with-graham-cracker-crust/"}
{"title": "Cinnamon Roll French Toast Egg Bake", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢8Kings Hawaiian Sweet Rolls", "▢1/2cupbrown sugar", "▢1Tbsp.ground cinnamon", "▢32oz.container of egg whites – entire container", "▢3eggs", "▢1/4cupwhole milk", "▢3Tbsp.light pancake syrup", "▢pinch of salt"], "instructions": ["Preheat oven to 400. Spray 9×13 baking dish with nonstick spray. Note: if you use a different size pan your baking time will vary.", "Tear Hawaiian rolls into bite sizes pieces and layer the bottom of the pan. Mix sugar and cinnamon in a bowl and spread evenly over the rolls.", "In a separate bowl beat 3 eggs, milk and salt. Add egg whites and mix together. Top rolls with egg mixture.", "Finally, top with syrup and bake for 30 – 45 minutes (times may vary oven to oven – mine is done around 30/35). Once cooked and a toothpick comes out clean, cut into 6 equal squares and enjoy!At the time of serving you could add your favorite cinnamon roll frosting, french toast toppings, additional syrup, serve with sausage (my favorite way), or simply eat it as it is."], "notes": ["All nutrition facts are an estimate.", "You can use old bread, if needed but it will change the taste and texture.", "You can really taste the egg in this. If you prefer less egg taste, add vanilla extract to egg mixture."], "nutrition": null, "url": "https://ohsnapmacros.com/cinnamon-roll-french-toast-egg-bake/"}
{"title": "Breakfast Pizza", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢2eggs", "▢1turkey sausage patty", "▢28gvelveeta shreds", "▢1Josephs Bakery pita", "▢Drizzle Franks Red Hot Sauce"], "instructions": ["Scramble two eggs.", "Top pita with eggs, turkey sausage and cheese.", "Bake at 350 for 5 mins. Broil at the end to crisp up the pita.", "Top with your favorite hot sauce and enjoy!"], "notes": ["Use any type of sausage.", "Use egg whites or whole eggs."], "nutrition": null, "url": "https://ohsnapmacros.com/breakfast-pizza/"}
{"title": "Cheesy Egg White Breakfast Sausage Bake Recipe", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.ground pork sausage ⁣", "▢32oz.container of egg whites", "▢1/2cupreduced fat mozzarella cheese shreds ⁣112g", "▢1/4largered bell pepper. chopped68g", "▢1/2mediumyellow onion⁣, chopped85g", "▢252gfrozen hash browns ⁣Alexia Foods", "▢1tsp.salt and pepper ⁣", "▢1tsp.paprika ⁣", "▢dash of cayenne ⁣"], "instructions": ["Preheat oven to 425 degrees F. Spray casserole dish with cooking spray.", "Brown sausage over medium heat.", "Add bell peppers, onion and hash browns to the pan with the sausage and cook until hash browns are browned.", "Layer into a greased baking dish. ⁣", "Mix egg and spices in a separate bowl.", "Pour on top of sausage mixture. ⁣Top with cheese.", "⁣Bake at 425 for 25 mins. ⁣", "Remove from the oven and check eggs are fully cooked. Cut into 6 equal squares and enjoy!"], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Use turkey sausage.", "Add any desired veggies."], "nutrition": null, "url": "https://ohsnapmacros.com/cheesy-egg-white-sausage-bake/"}
{"title": "Oreo Chunk White Chocolate Chip Cookies", "servings": "20", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cupunsalted buttersoftened", "▢1/2cupgranulated sugar100g", "▢1/2cupbrown sugar90g", "▢2oz.reduced fat cream cheeseroom temperature", "▢1largeegg", "▢1tsp.vanilla extract", "▢1 1/2cupsall-purpose flour180g", "▢1/2tsp.baking soda", "▢1/4tsp.salt", "▢1/2tsp.ground cinnamon", "▢6oreo cookiescrumbled", "▢1/4cupLily's white chocolate chips (or any brand)40g"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a cookie sheet with parchment paper or a silicone baking mat.", "In a large bowl, cream butter, granulated sugar, and brown sugar until light and fluffy using a hand mixer. Add the softened cream cheese and mix until just combined. Beat in the egg and vanilla extract until well combined.", "In a separate medium bowl, whisk together the flour, baking soda, salt, and cinnamon.", "Add the dry ingredients to the wet mixture, mixing until just combined. Gently fold in the crushed Oreos and chocolate chips with a rubber spatula until just combined.", "Using a large cookie scoop (1.5 Tbsp.), drop scoops of dough onto the prepared baking sheet, leaving space between each cookie. If desired add extra cookie pieces and extra chocolate chips on top of each cookie. Bake for 10-12 minutes, or until the edges are golden brown but the center is still soft.", "Remove from the oven and allow the cookies to cool on the cookie sheet for about 5 minutes before transferring them to a cooling rack to cool completely. After about 1-2 minutes of cooling I always take the top of a large mason jar ring or round cookie cut and swirl around the cookie in a circle motion to make the perfect same size cookies!", "Store your cookies in an airtight container for 3-4 days."], "notes": ["Nutrition facts are an estimate and will vary with substitutions.", "Use room temperature cream cheese. Your cookies will be tough if you don’t.", "If you want the cookies to all be the same shape after baking, take to top of a mason jar lid, large round glass or circle cookie cutter, place it over the cookie, and swirl it around in a circular motion for a few minutes. This will result in the perfect circular cookies."], "nutrition": null, "url": "https://ohsnapmacros.com/oreo-chocolate-chip-cookies/"}
{"title": "Pumpkin Banana Cookies (with chocolate chips)", "servings": "17", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cuplight brown sugarlightly packed, 90g (or sugar substitute)", "▢1/2cupwhite sugar100g (or sugar substitute)", "▢1/2cupunsalted buttermelted and cooled (or coconut oil)", "▢2Tbsp.pumpkin puree", "▢1tspvanilla extract", "▢1/4cupmashed bananaapprox. 1/2 banana 55g"], "instructions": ["Preheat the oven to 400 degrees Fahrenheight and line a baking sheet with parchment paper.", "In a large mixing bowl, mix together the sugar, melted butter, pureed pumpkin, vanilla and mashed banana until smooth.Some banana chunks can remain.", "In a separate bowl, whisk together the flour, cinnamon, pumpkin pie spice, baking soda, and salt.", "Add the dry ingredients to the wet ingredients, mixing until just combined.", "Fold in the chocolate chips.", "Drop 1.5 Tbsp. spoonfuls of dough onto the prepared baking sheet. This recipes makes approximately 17 cookies with a 1.5 Tbsp. cookie scoop.", "Bake for 9-10 minutes or until the edges are lightly golden. Allow the cookies to cool on the baking sheet for a few minutes before transferring them to a wire rack to cool completely."], "notes": ["All nutritional information is an estimate and will vary with substitutions.", "Do not over-mix dough.", "Note:If you want the cookies to all be the same shape after baking, take the top of a mason jar lid, place it over the cookie, and swirl it around in a circular motion for a few minutes. This will result in the perfect circular cookies."], "nutrition": null, "url": "https://ohsnapmacros.com/pumpkin-banana-cookies/"}
{"title": "Chewy Eggless Oatmeal Cookies", "servings": "19", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cuplight brown sugar90g", "▢1/2cupgranulated sugar100g", "▢1/2cupunsalted butterroom temperature", "▢1/4cupunsweetened applesauce", "▢1/2tsp.vanilla extract", "▢1 1/2cupsall-purpose flour180g", "▢1/2cupold-fashioned rolled oats40g", "▢1/2tsp.ground cinnamon", "▢1/2tsp.baking soda", "▢1/4tsp.salt"], "instructions": ["Preheat the oven to 350 degrees Fahrenheight and line a baking sheet with parchment paper.", "In a large bowl, cream together the sugar and butter until well combined with a hand mixer. Add the vanilla and applesauce and mix.", "In a separate bowl, whisk together the flour, oats, baking soda and salt.", "Add the dry ingredients to the wet ingredients, mixing until just combined.", "Drop 1.5 Tbsp. spoonfuls of dough onto the prepared baking sheet. This recipes makes approximately 19 cookies with a 1.5 Tbsp. cookie scoop.", "Bake for 10-11 minutes or until the edges are lightly golden. Allow the cookies to cool on the baking sheet for a few minutes before transferring them to a cooling rack to cool completely.", "Note: If you want the cookies to all be the same shape after baking, take to top of a mason jar lid, place it over the cookie and swirl it around in a circular motion for a few minutes. This will result in the perfect circular cookies.", "Store your cookies in an airtight container for 3-4 days."], "notes": ["Nutrition facts are an estimate and will vary with substitutions.", "If you want the cookies to all be the same shape after baking, take to top of a mason jar lid, large round glass or circle cookie cutter, place it over the cookie, and swirl it around in a circular motion for a few minutes. This will result in the perfect circular cookies."], "nutrition": null, "url": "https://ohsnapmacros.com/eggless-oatmeal-cookies/"}
{"title": "Sweet and Spicy Air Fryer Carrots and Potatoes", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.golden potatoes, quartered", "▢1lbs.large carrots, chopped", "▢1Tbsp.olive oil", "▢2garlic cloves, minced", "▢2Tbsp.lite maple syrup", "▢Salt and Pepper", "▢Red Pepper Flakes", "▢Parsley for garnish"], "instructions": ["Pre heat the air fryer.", "While the air fryer heats chop potatoes into quarters or smaller if big. You want bite size pieces. Peel and chop your carrots into chunks.", "Add the carrots and potatoes to a bowl and mix with 1 Tbsp. olive oil. Be sure to evenly coat the carrots and potatoes.Add the carrots and potatoes to the air fryer and cook at 400 degrees Fahrenheit for 12 minutes.", "Remove the carrots and potatoes from the air fryer and place back in the bowl you used to cover in olive oil. Add maple syrup, garlic, pinch of salt and pepper and red pepper flakes to taste. I do about 3-4 good shakes.Return to the air fryer and cook for another 10 minutes until the carrots and potatoes are fork tender. Top with chopped parsley and enjoy."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Cut potatoes the same size. This will ensure they cook evenly."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-carrots-and-potatoes/"}
{"title": "5 Minute High Protein Yogurt Bowls (4 ways)", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1cupnon-fat plain Greek Yogurt168g", "▢1/2scoopvanilla protein powderPEScience", "▢1cupmixed berries", "▢granolahomemade or store-bought"], "instructions": ["Combine the yogurt and protein powder and mix until well combined.", "Top with mixed berries and granola."], "notes": ["“ohsnapmacros Berry Yogurt Bowl”calories 329 Fat 6 g Carbohydrate 27 g Dietary Fiber 3 g Protein 41 g", "calories 329 Fat 6 g Carbohydrate 27 g Dietary Fiber 3 g Protein 41 g", "“ohsnapmacros Tropical Yogurt Bowl”calories 363, Fat 8 g, Carbohydrate 36 g, Dietary Fiber 4 g,Protein 39 g", "calories 363, Fat 8 g, Carbohydrate 36 g, Dietary Fiber 4 g,Protein 39 g", "“ohsnapmacros Chocolate Peanut Butter Yogurt Bowl”calories 449Fat 17 gCarbohydrate 38 gDietary Fiber 5 gProtein 40 gTo lower fat in this bowl use powered PB2 vs. peanut butter", "calories 449Fat 17 gCarbohydrate 38 gDietary Fiber 5 gProtein 40 g", "To lower fat in this bowl use powered PB2 vs. peanut butter", "“ohsnapmacros Apple Pie Yogurt”calories 369 Fat 7 g Carbohydrate 35 g Dietary Fiber 4 g Protein 40 g", "calories 369 Fat 7 g Carbohydrate 35 g Dietary Fiber 4 g Protein 40 g"], "nutrition": null, "url": "https://ohsnapmacros.com/high-protein-yogurt-bowls/"}
{"title": "Refreshing Non-Alcoholic Moscow Mule Mocktail", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢7.5oz.Light Ginger BeerQ Brand preferred", "▢0.5oz.fresh lime juice~ 1/4 shot", "▢1Tbsp.fresh mint leaves"], "instructions": ["Add the lime juice and mint leaves to the bottom of a copper mule cup. Using a drink muddler, muddle the mint and lime until the leaves have softened.", "Fill the cup with ice, pour the ginger beer over top and stir.", "Garnish with a lime wedge and additional mint."], "notes": ["Add vodka or tequila if desired!", "Q Brand Ginger Beer is my favorite for these. You can find them in the mixers section at the grocery store."], "nutrition": null, "url": "https://ohsnapmacros.com/non-alcoholic-moscow-mule/"}
{"title": "Fizzy Orange Coffee Mocktail (Non-Alcoholic)", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢2tsp.instant espresso powderor instant coffee", "▢1/4cupcold water", "▢1/4cupfreshly squeezed orange juiceor storebought juice", "▢1tsp.maple syrup", "▢1/4tsp.vanilla extract", "▢1/2cupplain selzteror sparking water", "▢Ice", "▢Orange Slicegarnish"], "instructions": ["Add the instant espresso powder, cold water, orange juice, maple syrup, and vanilla extract to a small jar. Cover with a tight fitting lid then shake vigorously for 30-60 seconds or until the espresso powder has fully dissolved.", "Fill a tall tumbler or Collins glass half full with ice, then pour the shaken espresso mixture over it. Make sure to get the foam as well.", "Top with the seltzer or sparkling water and garnish with an orange slice if desired."], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "If you have an espresso machine, you can substitute a double shot (2 ounces) for the instant espresso powder and cold water. I recommend allowing the shot to come to room temperature or chilling it down in the fridge before using it in the mocktail recipe."], "nutrition": null, "url": "https://ohsnapmacros.com/coffee-mocktail/"}
{"title": "Garlic Turmeric Rice", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1cupBasmati Rice uncooked180g", "▢2cupswater", "▢1tspolive oil", "▢10oz.frozen riced cauliflowercooked", "▢1Tbspbutter", "▢2clovesgarlicminced", "▢1.5tsp.turmeric powder", "▢salt and pepperto taste"], "instructions": ["In a medium saucepan, combine the rice and water. Bring to a boil over high heat, reduce the heat to low and cover the saucepan with a tight-fitting lid. Simmer the rice for 15-20 minutes or until water is fully absorbed and rice is tender.", "While the rice cooks, microwave the cauliflower according to the package instructions to warm.", "While the rice and cauliflower cook, heat the olive oil in a small skillet over medium heat. Add the minced garlic and sautee for 1-2 minutes until fragrant and lightly browned and toasted. Be careful not to burn it, it will go quick!", "Add the turmeric powder to the skillet and stir to combine with the garlic. Cook for another 30 seconds to 1 minute until the turmeric is fragrant and well combined.", "Add the garlic turmeric mixture to the rice. Stir gently to combine, making sure the turmeric and garlic are evenly distributed throughout the rice.", "Season with salt and pepper to taste. If desired, add fresh parsley or cilantro."], "notes": ["All nutrition facts are an estimate.It is always recommended to weigh your final dish and divide it by the number of servings for themost accurateserving size.", "Be sure to keep an eye on the garlic, it burns quickly. You want it golden brown and fragrant.", "Stir well to make sure there’s no chunks of garlic."], "nutrition": null, "url": "https://ohsnapmacros.com/garlic-turmeric-rice/"}
{"title": "Chewy Chocolate Protein Granola Bars", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢2cupOld Fashioned Oats160g", "▢1.5cupsPuffed Rice Cereal25g", "▢1cupVanilla Protein Powder100g", "▢1/2cupAlmond Flour70g", "▢1/2cupGranulated SweetenerStevia in the Raw", "▢1/2tsp.salt", "▢1/2cupNatural Peanut Butter128g", "▢1/3cupUnsweetened Vanilla Almond Milk82g", "▢1/4cupLite Pancake Syrup56g", "▢1tsp.Vanilla Extract", "▢1/4cupMini Chocolate Chips44g"], "instructions": ["Line an 8×8-inch baking dish with parchment paper, leaving some overhang on the sides for easy removal.", "In a large bowl, combine the oats, puffed rice, protein powder, almond flour, sweetener, and salt.", "In a microwave-safe bowl, combine the peanut butter, almond milk, and syrup. Microwave in 30-second intervals, stirring after each, until the mixture is smooth and pourable. Stir in the vanilla extract.", "Pour the wet ingredients into the oat mixture, stirring until everything is well coated. You will need to use a rubber spatula to fold everything together to ensure the dry ingredients are well incorporated. Fold in half the chocolate chips reserving half for the top. If the mixture is to dry add a drop of almond milk and combine.", "Transfer the mixture to the prepared baking dish, pressing it down firmly into an even layer and top with the remaining chocolate chips lightly smashing into the mixture so they don’t fall off when cutting.", "Refrigerate for at least 1.5 to 2 hours, or until the bars are firm enough to cut.", "Using the parchment paper, lift the bars out of the pan. Cut into 12 equal bars."], "notes": ["Nutrition facts are an estimate and will change with substitutions.", "If the mixture is too dry, add a drop of almond milk.", "Store the bars in an airtight container at room temperature for up to a week, or in the refrigerator for up to 2 weeks. Keeping these chewy bars at room temp will help them to be less dense and chewy (my preferred method) but they’re great straight out of the fridge too. If you take one to go wrapped with parchment paper it’ll be as if you stored it at room temp."], "nutrition": null, "url": "https://ohsnapmacros.com/chewy-chocolate-protein-granola-bars/"}
{"title": "Protein Berry Cobbler", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2cupsfresh raspberries12 oz.", "▢2cupsfresh blueberries12 oz.", "▢2cupschopped strawberries10 oz.", "▢2Tbsp.lemon juice", "▢1/4cupStevia in the Rawor preffered granular sweetener", "▢2Tbsp.arrowroot powderor cornstarch"], "instructions": ["Preheat your oven to 350°Fahreheight.", "In a large bowl, combine the mixed berries, lemon juice, 1/4 cup sweetener, and arrowroot. Stir until all the berries are coated evenly. Pour the berry mixture into a cast iron pan or 9×13 baking dish.", "In another bowl, combine the oats, almond flour, protein powder, sweetener, cinnamon, and salt. Stir until the dry ingredients are well mixed.", "Pour the melted coconut oil into the dry ingredients, followed by the almond milk. Stir until the mixture resembles a uncooked oatmeal.", "Evenly distribute the crumble topping over the berry mixture in the baking dish.", "Bake in the preheated oven for about 40 minutes, or until the topping is golden and the berry mixture is bubbly.", "Let the cobbler cool for a few minutes before serving. Enjoy it on its own or with a dollop of light Greek yogurt or whipped cream on top."], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "Using a cast-iron will give the cobbler the traditional crispy top and is highly suggested. If you don’t have a cast-iron you can use a 9×13."], "nutrition": null, "url": "https://ohsnapmacros.com/protein-berry-cobbler/"}
{"title": "The Best Macro Friendly Subway Sandwich Options", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/macro-friendly-subway/"}
{"title": "10 High Protein Macro Friendly Recipes", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/10-high-protein-macro-friendly-recipes/"}
{"title": "Lemon Orzo Pasta Salad", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢6oz.Orzo Pasta (measured uncooked)", "▢89gcooked peas", "▢3/4cupchopped cherry tomatoes100g", "▢2handfuls fresh spinach30g", "▢5tbsp.Lite Italian Dressing", "▢1.5tbsp.balsamic vinegar20g", "▢juice of one lemon wedge – 1/2 a lemon (to your taste)", "▢salt and pepper"], "instructions": ["Measure and cook Orzo pasta according to package directions.", "While the pasta cooks, steam peas, chop tomatoes and add to a bowl with spinach.", "When the pasta is done cooking, drain and add to the bowl of vegetables while still hot. This will wilt the spinach.", "Add Italian dressing, balsamic vinegar, lemon, salt and pepper and mix well to coat.", "Serve immediately or store in the fridge. As it sits in the fridge the flavors will increase.Add ons: protein of choice, feta or fresh cubed mozzarella, nuts or olives."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Always use fresh lemon for the best flavor."], "nutrition": null, "url": "https://ohsnapmacros.com/lemon-orzo-pasta-salad/"}
{"title": "How to Air Fry Chicken Sausages", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1packageprecooked chicken sausage"], "instructions": ["Remove the sausages from the package and place in the air fryer basket. I can typically fit up to 2 packages, 8 links in my air fryer.", "Cook at 400 degrees fahrenheit for 5 minutes, flip and cook for an additional 5 minutes. I like the skin to be golden brown and crispy.", "Remove and serve."], "notes": ["The nutritional information will vary depending on the brand of chicken sausages you purchase. I am using Aidells Chicken Sausages, found at my local grocery store.", "Use your favorite brand and flavor."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-chicken-sausages/"}
{"title": "Big Mac Pizza with 2 Ingredient Cottage Cheese Crust", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢2 1/4cupsself-rising flour270g (plus more for rolling)", "▢2cupslow-fat cottage cheese16 oz.", "▢1/4tsp.salt", "▢1/4tsp.dried basil", "▢1/4tsp.dried oregano", "▢chopped green leaf lettuce"], "instructions": ["Preheat the oven to 425 degrees Fahrenheit.", "In a large mixing bowl combine the flour, cottage cheese, salt, basil and oregano. Using a rubber spatula and eventually your hands mash the ingredients together until they begin to stick and form a large dough ball. This will take some work but itwillcome together.", "The dough will be VERY sticky and that is ok! Lay the ball onto a well floured surface and roll it around so it’s coated in the flour. Use well floured hands and press it down into a thick disk. Transfer the disk to a large 12-inch cast iron (or larger) coated with nonstick spray and press it out so it evenly reaches the edges of the cast iron surface.", "Heat a large skillet over medium and brown the ground beef until cooked through. Add the yellow mustard, garlic powder, onion powder, salt and pepper and stir to combine.", "While the meat cooks, add the mayonnaise, ketchup, pickles and juice to a small mixing bowl. Mix to combine and top the raw dough with ½ to ¾ of the sauce, leaving some remaining to drizzle on top of the pizza.", "Top the sauce with ½ cup shredded cheddar cheese, 56g. Using a slotted spoon scoop the ground beef out of the skillet and onto the cheese-covered pizza. Evenly spread the meat around the pizza.", "Top with the remaining ¼ cup of cheddar cheese. Lightly spray the edges of the crust with cooking spray to help them brown in the oven and place the pizza in the oven and bake for 25-30 minutes.", "Remove the pizza and let cool for 5 minutes. Top with shredded lettuce, chopped white onion, pickles and the remaining Big Mac Sauce. Cut into 6 pieces and enjoy."], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "This recipe works best in a cast iron for a nice crispy crust.", "I do not suggest a smaller cast iron than 12-inches. If using smaller you should cut the recipe in half so the dough bakes well and you can fit the meat on the crust.", "Use this crust recipe and top with all your favorite pizza toppings."], "nutrition": null, "url": "https://ohsnapmacros.com/big-mac-pita-pizza/"}
{"title": "Dragon Fruit Smoothie Recipe", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢3/4cupfrozen dragon fruit cubes100g", "▢3/4cupfrozen pineapple cubes95g", "▢1frozen ripe banana, quartered70g", "▢3/4cupunsweetened almond milk (or milk of choice)175g", "▢1/2scoopvanilla protein powder", "▢2Tbsp.lime juice (juice of 1-2 limes)"], "instructions": ["Add ingredients to a blender and blend on low speed. Increase the speed gradually, and blend until creamy and smooth.", "Pour your smoothie into a large glass, then enjoy!"], "notes": ["If your blender is not a high-powered blender, you may need to add a little bit more milk to blend everything smoothly.", "Nutritional information is an estimate and will vary with substitutions.", "Use a protein powder you love the flavor of as it will directly effect the taste.", "Simply omit the protein powder with no changes to make it without."], "nutrition": null, "url": "https://ohsnapmacros.com/dragon-fruit-smoothie/"}
{"title": "Copycat KFC Bowls", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢100gAir Fryer Blackened Chicken4.5 oz cooked", "▢185gGreek Yogurt Mashed Potatoes", "▢50gcanned corn", "▢50ggravy"], "instructions": ["Melt the butter in a pan over medium heat. Add the flour and stir until combined and lumpy.", "Very slowly add small amounts of beef broth while whisking the flour mixture. This will help break up the clumps along the way. Once you have used all the beef broth begin adding the chicken broth.", "Season with salt and garlic powder and whisk until the gravy has thickened and lump free."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Gravy notes: you should end up with approximately 350g of gravy. Per 50g servings: 47 cals: 0.9P/3.1F/3.5C"], "nutrition": null, "url": "https://ohsnapmacros.com/copycat-kfc-bowls/"}
{"title": "Taco Tuesday Flank Steak", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbsflank steak cut into slices against the grain ⁣", "▢Taco Seasoning"], "instructions": ["Slice your meat and place in a air tight container. ⁣ Top with taco seasoning and cover. Shake to coat the meat with the seasonings well.Marinate for 4-6 hours or overnight. ⁣"], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Always cut steak against the grain. This ensures a juicy and tender steak."], "nutrition": null, "url": "https://ohsnapmacros.com/taco-tuesday-flank-steak/"}
{"title": "Shaved Brussels Sprout Salad", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.fresh brussels sprouts", "▢1/2pear4 oz.", "▢1/2fuji apple3 oz.", "▢1/2cuppomegranate seeds", "▢1oz.queso frescocrumbled", "▢1/4cupdried cranberries40g", "▢1/4cupchopped pecans30g"], "instructions": ["Add all vinaigrette ingredients to a mason jar, salad dressing container or container with a lid. Shake to combine and set aside. This can be made up to two weeks (!!) ahead of time, store in the refrigerator until ready to use."], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "You can use maple syrup in place of lite syrup."], "nutrition": null, "url": "https://ohsnapmacros.com/shaved-brussels-sprout-salad/"}
{"title": "Holiday Stuffing using Dave’s Killer White Bread", "servings": "10", "prep_time": null, "cook_time": null, "ingredients": ["▢1packageDave's Killer White Bread Done Right Thin-Sliced21 slices", "▢2Tbsp.unsalted butter", "▢2garlic clovesminced", "▢1yellow onionchopped", "▢2celery stalkschopped", "▢8oz.sliced baby bella mushrooms", "▢1/3cupchicken stockused at different times", "▢2cupschicken stockused at different times", "▢2eggs", "▢3/4cupshredded parmesan cheese", "▢1jarwhole artichoke hearts (9.9oz jar)drained and chopped", "▢1/2tsp.poultry seasoning", "▢1/4tsp.dried rosemary", "▢1/2tsp.salt", "▢fresh cracked black pepper to taste"], "instructions": ["Preheat oven to 350 degrees Fahrenheit.", "Slice the bread into bite-sized chunks, leaving the crust on. Place on a baking sheet. You may need to use two.", "Bake for 15 minutes. Shake the baking sheet and place back in the oven for 10 minutes."], "notes": ["You may need to use additional broth if you use a bread other than Dave’s Killer Bread. You want to just barely soak the bread. Not enough broth your stuffing will be dry. Too much broth it will be soggy.", "For best results, only use an 8×8 or 9×9 inch pan. Any bigger or smaller your stuffing will be under or overcooked.", "All nutrition facts are an estimate and will change with any substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/holiday-stuffing/"}
{"title": "Creamy Low-Carb Corn Casserole with Green Chiles", "servings": "10", "prep_time": null, "cook_time": null, "ingredients": ["▢2canswhole kernel corndrained, 15.25 oz each", "▢1canchopped green chiliesundrained, 4.5 oz", "▢1/2cuplow-fat 2% milk", "▢1cup1/3 less fat cream cheesesoftened, 8 oz.", "▢2Tbsp.unsalted buttermelted", "▢1/2cupreduced fat sharp cheddar cheeseshredded, 56g", "▢1/2cupMonterey Jack cheeseshredded, 56g", "▢1/2tsp.salt", "▢1/2tsp.black pepper", "▢1cupwhole grain Triscuit crackerscrushed, 56g"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Prepare an 9×13 casserole dish with cooking spray. Melt butter in a microwave-safe dish.", "In a large bowl, combine the corn, green chilies, milk, cream cheese, melted butter, half of the cheddar cheese, half of the Monterey Jack cheese, salt, and pepper. Stir this cream cheese mixture until everything is well mixed.", "Pour the corn mixture into a prepared 9 x 13 inch casserole dish. Sprinkle the remaining cheddar and Monterey Jack cheeses on top, then sprinkle the crushed crackers on top of the casserole. Top with a dash of extra salt and pepper.", "Bake in the preheated oven for 35-40 minutes, until the casserole is hot, bubbly, and golden brown. Let the casserole cool for a few minutes before serving.", "Garnish with fresh cilantro, parsley, or chopped greens onions as desired."], "notes": ["All nutrition facts are an estimate and will change with substitutions.", "Delicious as a dip, spread or casserole.", "For added heat: add chili powder, sliced jalapeño, or red chili flakes.", "Use any preferred milk, crackers, cheese or cream cheese."], "nutrition": null, "url": "https://ohsnapmacros.com/corn-casserole-with-green-chilies/"}
{"title": "Baked Pumpkin Mini Donuts (with 2 ingredient batter)", "servings": "24", "prep_time": null, "cook_time": null, "ingredients": ["▢1boxSpice Cake MixDuncan Hines®", "▢1can100% pure pumpkin puree"], "instructions": ["Preheat the oven to 425 degrees fahrenheit.", "In a large bowl combine the cake mix and pumpkin puree. Mix until fully combined and no powdered cake mix remains.", "In a 12-mini donut baking pan, evenly scoop the donut dough into the pan approximately ¾ the way full. A great trick is to fill a ziplock with the batter, cut a hole at the corner and use it as a piping bag to add the batter to the pan. The dough will be sticky, you can use a rubber spatula to smooth out or wet your fingers.", "Place the donuts in the oven and bake for 9-10 minutes or until cooked through and browned. Remove and let cook in the pan for 5 minutes prior to transferring to a wire rack to completely cool.", "While the donuts bake decide if you want sugar coated, glazed of a mixture of both.", "To make sugar coated donuts,simply mix the brown sugar and pumpkin spice in a small bowl wide enough to dip the donuts in.Brush the tops of the donuts with the melted butter before dipping into the bowl of sugar to get the sugar to coat to the donuts. If coating with glaze be sure to let them completely cool first so the glaze doesn’t melt off.", "To make pumpkin spice glaze donuts,whisk together the powdered sugar, pumpkin spice and milk until a frosting like consistency. Use 1 ½-2 tsp. Of pumpkin spice to your preferred taste and 3-4 Tbsp. of milk to the desired sticky frosting consistency. Let the donuts fully cool to room temperature and then place the tops in the glaze and pull out in a circular motion so the glaze coats the entire top. Place back on the cooling rack to set."], "notes": ["All nutritional information is an estimate and will vary with subsittiotiosn", "Nutrition facts are for donuts ONLY! See below for nutrition facts with glaze or sugar coatings.", "Let the donuts cool completely before glazing or it will melt off the tops!", "You CAN use nonstick cooking spray in place of butter but it does not work as well!"], "nutrition": null, "url": "https://ohsnapmacros.com/pumpkin-mini-donuts/"}
{"title": "Easy Pumpkin Chocolate Chip Bread (High Protein)", "servings": "10", "prep_time": null, "cook_time": null, "ingredients": ["▢1cuppumpkin puree240g", "▢1cupplain non-fat Greek yogurt224g", "▢1/4cupunsweetened applesauce59g", "▢2Tbsp.honey", "▢2largeeggs", "▢1/2tsp.pure vanilla extract", "▢1cupwhole wheat flour120g", "▢1cupvanilla whey protein powder90g", "▢1.5tsp.baking powder", "▢1/2tsp.baking soda", "▢1/4tsp.salt", "▢2tsp.pumpkin pie spice", "▢1/2cupdark chocolate chip morsels88g"], "instructions": ["Preheat your oven to 350 degrees fahrenheit and prepare a loaf pan with non-stick cooking spray or line it with parchment paper.", "In a large bowl, combine the pumpkin puree, Greek yogurt, applesauce, honey, eggs, and vanilla extract.", "In a separate mixing bowl, combine the whole wheat flour, protein powder, baking powder, baking soda, salt, and pumpkin pie spice.", "Gradually add the dry ingredients to the wet ingredients, stirring until just combined. Be careful not to overmix as it can result in a dense bread. Fold in the dark chocolate chips.", "Pour batter into the prepared loaf pan, smoothing the top with a spatula. Optional, top with additional chocolate chips", "Bake for 45-60 minutes, or until a toothpick inserted into the center comes out clean or with a few moist crumbs. After 30 minutes of baking I highly suggest tenting the top of the bread with foil and returning to the oven for the remainder of the time so the top of the bread doesn’t burn.", "Allow the pumpkin bread to cool in the pan for about 10 minutes before transferring it to a wire rack to cool completely or cutting right into it for warm melty chocolate pumpkin bread."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Since no two ovens are the same, start checking your bread around 45 mins.", "This recipe has only been tested with the ingredients listed and any substitutions may result in a different taste or texture.", "To OMIT protein powder: use an additional 1/2 cup whole wheat flour in place of 1 cup protein powder. The vanilla protein powder adds a LOT of flavor to this bread so you’ll want to sweeten it up by adding an additional 1/2 tsp. vanilla extract and 2-3 Tbsp. of honey. Extra chocolate chips won’t hurt either."], "nutrition": null, "url": "https://ohsnapmacros.com/pumpkin-chocolate-chip-bread/"}
{"title": "Easy Greek Yogurt Brownies (fudgy and fluffy)", "servings": "16", "prep_time": null, "cook_time": null, "ingredients": ["▢1/4cupbuttermelted", "▢3/4cupgranulated sugar150g", "▢2largeeggs", "▢1tsp.vanilla extract", "▢1/2cupunsweetened cocoa powder60g", "▢1cupGreek yogurtfull fat recommended", "▢1/2cupall-purpose flour60g", "▢1/4tsp.salt", "▢1/2tsp.baking powder", "▢1/3cupsemi-sweet or dark chocolate chunks67g"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Grease a 9×9-inch square pan or line it with parchment paper.", "In a large mixing bowl, whisk together the melted butter and white sugar until smooth. Beat in the eggs, one at a time, and then stir in the vanilla extract. Add the Greek yogurt and mix until well incorporated.", "Add in the cocoa powder, flour, salt, and baking powder to the wet ingredients. Gently fold until the dry ingredients are just incorporated, being careful not to overmix.", "Fold in the chocolate chips or chunks, ensuring they're evenly distributed throughout the batter.", "Pour the brownie batter into the prepared baking pan, spreading it evenly. Bake brownies in the preheated oven for 20-25 minutes or until a toothpick inserted into the center comes out with a few moist crumbs. Do not overbake if you want them chewy.", "Remove the brownies from the oven and let them cool completely in the pan set on a wire rack. Once cooled, cut into squares and serve."], "notes": ["Nutrition facts are an estimate and will vary with substitutions.", "Do not over bake. It’s better to have them underdone then over. You can tell they are ready when the edges are set and a few moist crumbs come out on a toothpick."], "nutrition": null, "url": "https://ohsnapmacros.com/greek-yogurt-brownies/"}
{"title": "Easy Air Fryer Tortilla Pizza Recipe (3 ways)", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1Mission Carb Balance flour tortilla", "▢1/4cupmarinara sauce", "▢1/2cuppart skim low moisture mozzarella cheese56g", "▢30gturkey pepperoni"], "instructions": ["Preheat the air fryer to 400 degrees Fahrenheit.", "Spread the sauce on the tortilla almost completely to the edges. Optional, you can save some cheese to place on top of the toppings before cooking.", "Top the sauce with the shredded cheese and desired toppings. If making the pesto proscuitto peach pizza do not put the arugula and honey on until after cooking.", "Place the tortilla flat in the air fryer basket and cook at 400 degrees Fahrenheit for 5-7 minutes until the tortillas are browned and crispy and the cheese has melted. Remove once cooked.", "If making the pesto prosciutto peach pizza add the arugula and drizzle on the honey.", "Top with parmesan cheese and red pepper flakes and enjoy with your favorite ranch dressing."], "notes": ["Nutrition facts are an estimate and will vary based on the ingredients used and any substitutions.", "Add all sauces AFTER cooking."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-tortilla-pizza/"}
{"title": "Kitchen Sink Cookies (sweet and salty)", "servings": "21", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5cupsold fashioned oats120g", "▢1cupfine almond flour110g", "▢1scoopvanilla protein powder31g", "▢1tsp.baking powder", "▢1tsp.ground cinnamon"], "instructions": ["Preheat oven to 350°F and line a cookie sheet with parchment paper or a silicone baking mat.", "In a large mixing bowl, combine all the dry ingredients, ensuring they're well-mixed.", "In a separate bowl, whisk together all the wet ingredients until well combined.", "Pour the wet ingredients into the dry and stir until just combined.", "Gently fold in the chocolate chips, M&Ms and pretzel pieces until just combined.", "Using a cookie scoop or your hands, scoop dough into balls and place them on the baking sheet, flattening slightly.", "Optional: add additional M&Ms on top of each cookie before baking.", "Bake cookies in the preheated oven for 8-10 minutes, or until the edges are golden brown. Keep in mind they will continue to set as they cool.", "Allow cookies to cool on the baking sheet for a few minutes before transferring them to a cooling rack to cool completely."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "This recipe has only been tested with PeScience whey-casein blend protein powder. Substitutions may result in different textures and tastes.", "Add in any of your favorite mix-ins. Feel free to get creative!"], "nutrition": null, "url": "https://ohsnapmacros.com/kitchen-sink-cookies/"}
{"title": "Easy Instant Pot Fried Rice", "servings": "10", "prep_time": null, "cook_time": null, "ingredients": ["▢2cupsuncooked basmati rice360g", "▢2cupswater", "▢12oz.frozen riced cauliflower", "▢12oz.frozen mixed vegetables", "▢1/2cupcoconut aminos", "▢1tsp.toasted sesame oil", "▢1tsp.garlic powder", "▢1/2tsp.ground ginger", "▢1egg", "▢1/3cupliquid egg whites"], "instructions": ["Add the uncooked rice and water to the instant pot. Stir. Place the lid on the instant pot and turn the release valve to sealed. Set on manual or pressure cook for 4 minutes. IMPORTANT: turn off the KEEP WARM button. Once the rice has cooked for 4 minutes let it sit for 8 minutes with the lid still on. At 8 minutes quick release and open the lid.", "While the rice cooks, microwave the cauliflower according to the package instructions to warm. You can steam the frozen vegetables or just simply add them to a warm bowl of water to defrost.", "Add the warmed vegetables to the cooked basmati rice and mix to evenly combine. Once combined push the rice to the side so you have a small opening to the bottom of the instant pot to cook the eggs.", "Turn the instant pot to SAUTE. Spray the opening with nonstick spray or sesame oil and pour in the eggs once the bottom is hot. Scramble with a spatula until cooked through. Once cooked mix in with the rice.", "Add the coconut aminos, ground ginger, garlic powder and sesame oil to the rice and stir to combine.", "Serve and top with sesame seeds, red pepper flakes, sriracha or chopped green onions. Pair with your favorite proteins."], "notes": ["All nutrition facts are an estimate.", "Your instant pot will automatically change from pressure cook to Keep Warm. Make sure to reset it during step one to ensure the rice cooks."], "nutrition": null, "url": "https://ohsnapmacros.com/instant-pot-fried-rice/"}
{"title": "20+ High Protein Macro-Friendly Chicken Recipes", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/high-protein-chicken-recipes/"}
{"title": "Easy High Protein Soup and Chili Recipes", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.boneless skinless chicken breast, raw", "▢1red bell pepper, chopped144g", "▢1small yellow onion, chopped150g", "▢15oz.can Whole Kernel Corn (no salt added)drained", "▢15oz.can low sodium Black Beans Low Sodiumdrained and rinsed", "▢15oz.can petite diced Tomatoes (no salt added)", "▢10oz.can mild Red Enchilada Sauce", "▢4oz.can diced green chilies", "▢4cupslow sodium Chicken Broth32 oz.", "▢1tsp.salt", "▢1tsp.pepper", "▢1tsp.onion powder", "▢1tsp.garlic powder", "▢2tsp.paprika", "▢1.5Tbsp.chili powder", "▢1.5Tbsp.ground cumin", "▢4oz1/3 less fat Cream Cheese", "▢1/4cupnonfat plain Greek yogurt56g"], "instructions": ["Add the chicken the the base of the crockpot. Top with bell pepper, onions, corn, beans, tomatoes, chilies, enchilada sauce, seasonings and chicken broth.", "Stir to combine and set the crockpot to cook on low for 6-8 hours or high for 3 hours, or until the chicken is tender.", "Remove the chicken from the crockpot and shred with forks. Return to the pot.", "Add the cream cheese and greek yogurt and stir until melted and combined. Serve and enjoy with desired toppings."], "notes": ["Nutrition facts are an estimate and will change with any substitutions.", "For mild heat lower chili powder to ½ Tbsp.", "You can adjust the heat by adding more Greek yogurt to the crockpot or individual servings. I mix in additional yogurt to the kids’ bowls to lower the heat for them and keep it spicy for adults."], "nutrition": null, "url": "https://ohsnapmacros.com/easy-high-protein-soup-and-chili-recipes/"}
{"title": "Delicious and Healthy Recipes Using Ground Chicken", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1Tbsp.olive oil", "▢1lb.lean ground chicken", "▢1mediumyellow oniondiced", "▢2carrotspeeled and diced in rounds", "▢2stalkscelerydiced", "▢4clovesgarlicminced", "▢1tsp.salt", "▢1/2tsp.pepper", "▢1tsp.dried basil", "▢1tsp.dried oregano", "▢1/2tsp.paprika", "▢4cupslow sodium chicken broth", "▢1lb.potato gnocchi", "▢2cupsfresh spinachpacked", "▢1cupfrozen peas130g", "▢1cupfrozen corn140g", "▢1/2cupfat-free half-and-half115g"], "instructions": ["Set your Instant Pot to the sauté setting. Add the olive oil, once hot, add the ground chicken. Cook until browned, breaking into bite size pieces. This takes about 5 minutes. If using frozen ground chicken do the same this may just take longer to cook.", "Add the salt, pepper, basil, paprika and oregano to the chicken. Stir to evenly coat.", "Add the garlic, onions, carrots, and celery. Sauté for about 2 minutes until the vegetables start to soften and garlic is fragrant.", "Pour in the chicken broth, stirring well to combine and to scrape any bits off the bottom of the pot. This will prevent the \"burn\" warning.", "Add the gnocchi to the pot. Stir well to combine.", "Put the lid on the Instant Pot, set the valve to sealing position, and cook on Manual High Pressure for 4 minutes.", "When the timer beeps, quick release the pressure. Once the pressure is fully released, remove the lid.", "Set the Instant Pot back to the sauté setting. Stir in the spinach, peas and corn. Cook for a few minutes until the spinach has wilted and the peas and corn are warmed through.", "Add in the fat-free half-and-half, stirring until well combined.", "Allow the soup to simmer for a few more minutes until it's heated through and the peas and corn are warm.", "Taste and adjust seasonings as needed.", "Serve the soup hot, garnished with a sprinkle of fresh chopped parsley."], "notes": ["All nutritional information is an estimate and will vary with substitutions.", "Use any preferred ground meat for this gnocchi soup.", "Beef broth, veggie broth or bone broth may be used in place of chicken broth.", "Add any fresh or frozen vegetables you prefer.", "Alternatively to cooking the gnocchi in the instant pot you can simmer after removing the lid until cooked through."], "nutrition": null, "url": "https://ohsnapmacros.com/recipes-for-ground-chicken/"}
{"title": "Easy High Protein Cottage Cheese Recipes", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢1Tbsp.olive oil", "▢4clovesgarlicroughly chopped", "▢1smallyellow onionchopped", "▢1lb.lean ground beef96/4", "▢1tsp.oregano", "▢1tsp.Italian seasoning", "▢1tsp.paprika", "▢1/2tsp.chili powder", "▢1tsp.salt", "▢1/2tsp.black pepper or fresh crackedto taste", "▢32oz.jar of marinara sauce(I use Raos)"], "instructions": ["Pre-heat the oven to 375 degrees Fahrenheit. Heat oil in a large skillet over medium heat. Add the garlic and onions to the pan and cook until nice and browned, approximately 3-5 minutes.", "Add the ground beef to the pan and break into bite size pieces. Cook until fully cooked through, mixing often, approximately 5 minutes.", "Add the oregano, italian seasoning, paprika, chili powder, salt and pepper to the beef mixture and combine to evenly coat.", "Add sauce, combine and simmer while you prepare the cottage cheese filling.", "For the filling: combine the cottage cheese, eggs, parmesan cheese, oregano, Italian seasoning, salt and pepper and mix well to combine.", "Add the defrosted and strained spinach to the cottage cheese mixture and mix to combine.", "Spray a 9×13 inch baking dish with non stick cooking spray. Add a dollop of the meat mixture to the bottom of the dish to lightly coat the bottom. Top with 4 noodles, the noodles are the width of the baking dish (short side) not the length.", "Top the noodles evenly with ½ cup mozzarella cheese (56g), followed by half the meat mixture. Use a spoon or spatula to evenly spread the mixture over the noodles. Top the meat mixture with half the cottage cheese filling and spread to coat the top. Repeat with 4 noodles, ½ cup cheese, remaining meat mixture, remaining cottage cheese filling and 1 cup cheese on top.", "Place the baking dish on a baking sheet to catch any overflow. Cover the dish with foil, try to avoid touching the cheese on top so that it doesn’t stick to the foil. Bake for 50 minutes.", "Remove the foil and bake an additional 10-15 minutes until the cheese is melted and browned and the sauce is nice and bubbly at the edges.", "Top with freshly chopped parsley and cut into 12 equal servings and enjoy this easy lasagna recipe."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Defrost the spinach in the microwave and strain. I personally find it best to just squeeze the spinach with my hands to squeeze out as much water as possible.", "You do not need to blend the cottage cheese, it will blend together once baked."], "nutrition": null, "url": "https://ohsnapmacros.com/easy-high-protein-cottage-cheese-recipes/"}
{"title": "Creamy High Protein Chicken Enchilada Soup", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.boneless skinless chicken breast, raw", "▢1red bell pepper, chopped144g", "▢1small yellow onion, chopped150g", "▢15oz.can Whole Kernel Corn (no salt added)drained", "▢15oz.can low sodium Black Beans Low Sodiumdrained and rinsed", "▢15oz.can petite diced Tomatoes (no salt added)", "▢10oz.can mild Red Enchilada Sauce", "▢4oz.can diced green chilies", "▢4cupslow sodium Chicken Broth32 oz.", "▢1tsp.salt", "▢1tsp.pepper", "▢1tsp.onion powder", "▢1tsp.garlic powder", "▢2tsp.paprika", "▢1.5Tbsp.chili powder", "▢1.5Tbsp.ground cumin", "▢4oz1/3 less fat Cream Cheese", "▢1/4cupnonfat plain Greek yogurt56g"], "instructions": ["Add the chicken the the base of the crockpot. Top with bell pepper, onions, corn, beans, tomatoes, chilies, enchilada sauce, seasonings and chicken broth.", "Stir to combine and set the crockpot to cook on low for 6-8 hours or high for 3 hours, or until the chicken is tender.", "Remove the chicken from the crockpot and shred with forks. Return to the pot.", "Add the cream cheese and greek yogurt and stir until melted and combined. Serve and enjoy with desired toppings."], "notes": ["Nutrition facts are an estimate and will change with any substitutions.", "For mild heat lower chili powder to ½ Tbsp.", "You can adjust the heat by adding more Greek yogurt to the crockpot or individual servings. I mix in additional yogurt to the kids’ bowls to lower the heat for them and keep it spicy for adults."], "nutrition": null, "url": "https://ohsnapmacros.com/creamy-chicken-enchilada-soup-2/"}
{"title": "Lightened Up 30-Minute Cajun Chicken And Broccoli Alfredo", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.boneless skinless chicken breaststhinly sliced and chopped", "▢3Tbsp.cajun seasoningfor chicken", "▢1Tbsp.olive oil", "▢1red bell pepperthinly sliced", "▢1orange bell pepperthinly sliced", "▢1yellow bell pepperthinly sliced", "▢2cupsbroccoli florets", "▢1/2largeyellow oniondiced", "▢2clovesgarlicminced", "▢8oz.Barilla Protein Plus Pasta Spaghettibroken in half", "▢2cupsfat free half and half", "▢2.5cupslow sodium chicken broth", "▢1-2tsp.Cajun seasoningfor sauce", "▢1/2tsp.salt", "▢fresh cracked pepper", "▢1mediumzucchinispiralized, 8 oz.", "▢1/2cupParmesan Romano Cheese blend, shredded56g"], "instructions": ["Add the sliced and chopped chicken to a large mixing bowl and top with 3 Tbsp. cajun seasoning. Mix to ensure all sides are coated with the seasoning.", "In a deep skillet or dutch oven with high sides, heat the olive oil over medium-high heat. Add the chicken slices and cook until golden brown and cooked through, approximately 5 minutes. Once cooked, transfer the chicken to a plate and set aside.", "Add the peppers, broccoli, onion and garlic to the same skillet and sauté until softened.", "Pour the half and half and chicken broth in with the vegetables. If you want mild (still spicy as this is a cajun dish) add 1 tsp. of cajun seasoning to the mixture along with salt and pepper. If you want spicy, add 2 tsp. of cajun seasoning and stir to combine.", "Break the spaghetti noodles in half and add to the pot in a criss cross pattern. This helps them cook through and not stick together in the pot. Press the noodles down so they’re submerged in the liquid to cook.", "Bring the mixture to a boil, then reduce the heat to low. Cover the pot and let simmer for about 10-15 minutes or until the pasta is cooked to your liking, stirring often.", "Once the noodles have softened, add the spiralized zucchini and mix to combine.", "Once the pasta is cooked and zucchini is soft, add the cheese to the pot and mix to melt and combine. Let simmer for 3-5 minutes.", "Add the cooked chicken back into the pot and stir into the pasta. Simmer for 3-5 minutes to allow the chicken to heat through and the flavors to melt together while the sauce thickens. Taste and adjust seasonings, if needed."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "If you use store-bought cajun seasoning I suggest cutting the seasoning in half and adjusting it to taste as store-bought is much saltier.", "Adjust the heat level in the sauce by using ¼ Tbsp. of Cajun seasoning for mild heat and ½ Tbsp. for spicy.", "Serving size gram suggestion is always an estimate and can change from person to person. I always suggest you weigh your final and divide by the number of servings."], "nutrition": null, "url": "https://ohsnapmacros.com/cajun-chicken-and-broccoli-alfredo/"}
{"title": "Easy Chicken Piccata Recipe (Gluten-Free)", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.boneless skinless chicken breast", "▢2tsp.salt", "▢fresh cracked pepper", "▢1/4cupBob's Red Mill 1:1 Gluten-Free Flour37g (or all-purpose flour)", "▢2Tbsp.olive oil", "▢2Tbsp.buttersplit", "▢2clovesgarlicminced", "▢1largelemonhalved", "▢1/4cuplow-sodium chicken broth", "▢2Tbsp.capersdrained", "▢fresh parsleyfor garnish"], "instructions": ["Using a knife, butterfly the chicken breast on a cutting board and cut the chicken in half, leaving 4 chicken cutlets. Cover with seran wrap and pound chicken with a meat tenderizer to approximately ½ inch thick and even in size. Season both sides with salt and pepper.", "Lay the flour on a plate or shallow bowl and dip the pieces of chicken into the flour, evenly coating all sides of the chicken. You will have a little excess flour leftover, which has been accounted for in the nutrition facts.", "Cut the lemon in half and juice one half (approx. 3 Tbsp.) and slice the other half into thin lemon slices.", "Add 2 Tbsp. olive oil to a large sauté pan and heat over medium heat. Add the flour coated chicken cutlets to the hot oil and cook on each side until cooked through and no longer pink, approximately 3-4 minutes per side. Remove and set aside on a plate.", "Lower the heat to medium low and add 1 Tbsp. of butter and the minced garlic. Stir and cook until the garlic is fragrant. Add the lemon juice and lemon slices to the frying pan, stirring until the lemon slices are golden brown. Scrape any browned bits off the bottom of the pan. Cook for 2-5 minutes.", "Add the chicken broth, capers and 1 Tbsp. of butter to the pan and stir to melt the butter and create a piccata sauce. Add the cutlets back to the pan and spoon the sauce over to soak into the breaded chicken and reheat throughout.", "Serve with fresh chopped parsley, for garnish"], "notes": ["All nutritional information is an estimate and will vary with substitutions.", "To lower the fat contact, omit the butter in the sauce at the end and/or use cooking spay in place of olive oil to cook the chicken.", "If gluten is not a concern, use all purpose flour at a 1:1 ratio.", "Use frozen minced garlic and precut chicken tenderloins to save on time."], "nutrition": null, "url": "https://ohsnapmacros.com/gluten-free-chicken-piccata-recipe/"}
{"title": "Mississippi Chicken Casserole Recipe", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.boneless, skinless chicken breastsraw", "▢1/2mediumyellow onionfinely chopped", "▢3clovesgarlicminced", "▢1cupnon-fat plain Greek yogurt226 g", "▢1/2cup2% low-fat milk120 ml", "▢2Tbsp.unsalted butter", "▢1cupshredded Monterey Jack cheese112 g", "▢3cupsuncooked wide egg noodles6 oz.", "▢12oz.bag frozen mixed veggies (corn, peas, carrots, green beans) or any of your choicedefrosted", "▢16oz.jar of pepperoncini (mild heat)drained and roughly chopped", "▢3Tbsp.homemade ranch seasoning (see below)"], "instructions": ["Preheat your oven to 375 degrees Fahrenheit and lightly grease a large 9×13 inch casserole dish. The casserole will be filled to the brim, so make sure to use a large enough dish.", "Place the raw chicken in a large pot and cover with water. Bring to a boil and cook for 15-20 minutes until fully cooked through and no longer pink. Once cooked through shred with two forks or a hand mixer.", "While the chicken cooks, saute the onions and garlic in cooking spray until the onions are slightly translucent and fragrant. Place in a large mixing bowl.", "In the same pan you cooked the onions and garlic, make the homemade cream of chicken soup substitute. Add the chicken broth, milk, flour, poultry seasoning, salt, and pepper to the pan. Bring the mixture to a simmer over medium heat and whisk it continuously until it thickens. This happens quickly, in minutes! Once it’s thickened and resembles canned cream of chicken soup, remove it from the heat and add to the large mixing bowl with the onion mixture.", "In a small mixing bowl, combine the ranch seasoning ingredients and mix to combine.", "To the same large mixing bowl as the onions and soup mixture, add the shredded chicken, Greek yogurt, low-fat milk, melted butter, half of the Monterey Jack cheese, uncooked noodles, mixed vegetables, chopped pepperoncini, and 3 Tbsp. of homemade ranch seasoning. Mix until everything is well incorporated.", "Pour the mixture into the prepared casserole dish, smoothing it out with a spoon.  You want to be sure to press the noodles into the mixture so that they cook in the cream of chicken soup. Sprinkle the remaining Monterey Jack cheese on top.", "Cover the casserole with aluminum foil and bake for 20 minutes. After 20 minutes, remove the foil and continue to bake for another 10-15 minutes, or until the noodles are tender and the cheese is melted and bubbly. If you’d like a golden top, you can broil it for an additional 2-3 minutes.", "Allow the casserole to rest for a few minutes before serving."], "notes": ["The serving size is 299 grams", "Use medium pepperoncini for spicier casserole.", "Make sure to use a large 9 x 13 baking dish as the casserole will be filled to the brim.", "You want to be sure not to overcook the soup so that it reduces, JUST long enough to thicken or you will not have enough liquid to cook the noodles. If you do not have enough liquid to cook the pasta you can add 1/4-1/2 cup chicken broth. Noodles that are not covered with the cream of chicken will come out uncooked.", "Substitute homemade cream of chicken with 1 – 10oz. Can or 2 for extra creamy."], "nutrition": null, "url": "https://ohsnapmacros.com/mississippi-chicken-casserole-recipe/"}
{"title": "Easy Buffalo Chicken Pasta with Cream Sauce", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.boneless skinless chicken breast", "▢14.5oz.Barilla Protein Plus Penne", "▢1tsp.oil", "▢3clovesminced garlic", "▢1/2cupschicken broth", "▢1cupfat-free half and half", "▢1/2cupshredded parmesan cheese56g", "▢1tsp.onion powder", "▢1/2tsp.salt", "▢fresh cracked pepperto taste", "▢1/2cupbuffalo hot sauce (such as Frank's Red Hot)", "▢1/2Tbsp.arrowroot powder", "▢1Tbsp.water", "▢1/2cupnon-fat plain Greek yogurt112g"], "instructions": ["Place the raw chicken in a pot and cover with water. Bring to a boil and cook for 15-20 minutes until the chicken is cooked through and no longer pink. The cooking time will vary based on the thickness of your chicken breasts. Once cooked, remove from the water and shred with forks or a hand mixer. Set the shredded chicken aside for later.", "Cook the pasta according to package instructions in a large pot of boiling salted water. Drain and set aside.", "In a large skillet, add olive oil and the minced garlic. Cook on medium heat until the garlic is fragrant but not browned, about 1 minute.", "Add the chicken broth to the skillet and let it simmer for about 2 minutes.", "Reduce the heat to medium-low heat, then add the fat-free half and half, Parmesan cheese, onion powder, salt, pepper and buffalo hot sauce. Stir to combine and until the cheese is melted and the sauce is as smooth as possible, approximately 3-5 minutes.", "In a small bowl whisk together the arrowroot powder and water and add to the sauce to thicken. Whisk until the sauce has thickened.", "Once the sauce has thickened add the Greek yogurt and stir to combine until melted.", "Add the cooked pasta and shredded chicken to a large mixing bowl (unless you’re using a huge skillet). Pour the buffalo cream sauce on top and toss well to coat in the sauce.", "Serve the pasta hot, sprinkled with crumbled blue cheese and sliced green onions on top."], "notes": ["Nutrition facts are always an estimate and will change with substitutions.", "8 servings at approximately 220 grams per serving.", "If reheating, add a splash of fat-free half and half, milk or choice or even water to avoid the pasta being too dry.", "Serve with crumbled blue cheese, parmesan, and/or chopped green onions.", "This dish is spicy you can double the hot sauce for EXTRA spicy."], "nutrition": null, "url": "https://ohsnapmacros.com/buffalo-chicken-pasta/"}
{"title": "Slow Cooker French Onion Chicken", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.skinless boneless chicken breast", "▢2largesweet onionsthinly sliced", "▢2canscondensed French onion soup10.5 oz each", "▢1cuplow sodium beef broth", "▢1Tbsp.Worcestershire sauce", "▢2.5oz.Swiss or Gruyere cheeseshredded", "▢1tsp.garlic powder", "▢salt and pepperto taste", "▢1/2cupnon-fat Greek yogurt112g", "▢additional cheesefor toppings", "▢fresh thyme or parsleyfor garnish"], "instructions": ["Start by seasoning the chicken breasts on both sides with garlic powder, salt, and pepper.", "Place the sliced onions at the bottom of the slow cooker.", "Arrange the seasoned chicken breasts on top of the onions.", "In a medium bowl, combine the condensed French onion soup, beef broth, and Worcestershire sauce. Pour this mixture over the chicken in the slow cooker.", "Cover the slow cooker and cook on low for 5-6 hours or on high for 3-4 hours, until the chicken is fully cooked and the onions are tender.", "About 15 minutes before you’re ready to serve, shred the chicken by using forks or a meat masher and shred directly in the pot.", "Add the greek yogurt and mix together well until completely melted. Sprinkle the shredded cheese over the top of the chicken and onions. Cover the slow cooker again and let it continue to cook until the cheese is melted and bubbly.", "Once the cheese is melted, serve hot over rice, noodles, mashed potatoes or vegetables, spooning the onions and extra sauce over the top. Garnish with fresh thyme sprigs or parsley and additional cheese, if desired."], "notes": ["Can be made into a soup by doubling beef broth and Worcestershire sauce and topped with bread and cheese.", "Option to keep chicken whole as opposed to shredding.", "Serve with mashed potatoes, over noodles or over rice.", "Serve as a standalone chicken meal alongside crusty bread and roasted veggies.", "This is one of those tricky ones that I suggest you weigh the final dish (all the food inside the pot) prior to serving. Then divide by the serving size to get your final grams per serving. The reason is the liquid. The weight can vary so much person to person that for the most accurate serving size you really should find the total weight. This crockpot french onion chicken recipe makes 8 servings."], "nutrition": null, "url": "https://ohsnapmacros.com/crockpot-french-onion-chicken/"}
{"title": "Blackened Chicken White Sauce Pizza", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1Papa Pita", "▢1Light Laughing Cow Cheese Wedge", "▢3ozchopped cooked Blackened Chicken", "▢Chopped Cherry Tomatoes", "▢Chopped Spinach", "▢2tbspPart Skim Ricotta Cheese", "▢Fresh Chopped Basil or Parsley"], "instructions": ["Turn oven to broil.Put pita on a baking sheet and spread laughing cow on top of the pita as the sauce.", "Chop tomatoes, spinach and chicken into bite size pieces and place on top of the cheese.Add ricotta cheese in dollop's around the pita.", "Put in the oven under the broiler for a few minutes until the edges are browned and the toppings are warm.Top with fresh basil or parsley and enjoy!"], "notes": ["Use tortilla in place of pita.", "Use rotisserie chicken."], "nutrition": null, "url": "https://ohsnapmacros.com/blackened-chicken-white-sauce-pizza/"}
{"title": "Creamy Chicken and Veggie Casserole", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.raw chicken breast, chopped into bite size pieces", "▢1/2yellow onion, chopped160g", "▢1red bell pepper, cut into strips200g", "▢1green bell pepper, cut into slices130g", "▢1package of frozen spinach, defrosted (10 oz. package) and water drained", "▢2cupssliced cremini mushrooms160g", "▢1can98% fat free condensed cream of mushroom soup10.5oz can", "▢1cupnon fat sour cream250g", "▢2tbsp.unsalted butter", "▢1tsp.minced garlic", "▢1tsp.paprika", "▢salt and pepper"], "instructions": ["Pre heat the oven to 375. Slice and chop your veggies. Add the frozen spinach to a bowl of hot water (keep in the packaging) to let thaw while you cook your veggies.", "Heat a large pan over medium heat and add butter to melt. Once the butter has melted add garlic, peppers, onions and mushrooms to the pan and cook. Allow to cook until the onions are translucent and peppers begin to soften. Approx. 5-10 minutes. Add thawed and drained spinach. To drain the water from the spinach just simply squeeze it out of the bag. Be careful though the bag can pop and a disaster follows. Mix the spinach in with the vegetables.", "While the vegetables cook, cut your chicken into bite sized pieces. Alternatively, for tracking purposes, you can cut your chicken into 4 oz. cutlets and place on top at the end to cook vs. mixed in with the vegetables.", "When the vegetables are done, add cream of mushroom soup, sour cream, paprika, salt and pepper. I have left salt and pepper to your discretion, you can always add to the meal if needed.", "Once the mixture is well mixed, add your raw chicken and mix well to combine.", "Spray and baking dish with non stick spray and add the mixture to the dish. Bake at 375 for 20 minutes.If you place the chicken on top vs. mixed it be sure to cook until the chicken is fully cooked.", "Serve alone, over noodles, zoodles, rice or cauliflower rice.Enjoy and let me know how you like it!"], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Use rotisserie or leftover chicken."], "nutrition": null, "url": "https://ohsnapmacros.com/creamy-chicken-and-veggie-casserole/"}
{"title": "Lightened-Up Blackened Chicken Alfredo", "servings": "5", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.chicken breast, raw", "▢8oz.fettuccine noodles – using De Cecco (UNCOOKED)", "▢2Tbsp.Butter", "▢1/2Tbsp.minced garlic", "▢2laughing cow cheese wedges (light)", "▢1 1/3cupWhole Milk", "▢2oz.cream cheese, cubed (room temp works best)", "▢1/2cupgrated parmesan cheese56g", "▢Fresh cracked black pepperto taste"], "instructions": ["Mix blackening seasonings in a deep mixing bowl and set aside.", "Slice chicken breast into strips. Add chicken to bowl of seasonings and mix together well to evenly coat."], "notes": ["Nutritional information is an estimate and will vary with substitutions", "If you are tracking! This is one of those dishes I suggest you weigh your final pasta and divide by the servings for the weight per serving. Then top with the noted cooked protein (2 or 3 oz.) for the most accurate tracking.", "When reheating, add a tbsp or two of water to help the sauce separate as needed.", "Add zoodles to create a higher volume serving.", "Make this low-carb by using just zoodles or healthy noodles in place of fettuccini.", "4 servings – 1/4 of pasta + 3 oz. cooked chicken: 545 Calories: 52 P / 52 C / 18 F", "6 servings 1/6 of pasta + 2 oz. cooked chicken: 364 caloires: 35 P / 35 C / 12 F"], "nutrition": null, "url": "https://ohsnapmacros.com/blackened-chicken-fettuccini-alfredo/"}
{"title": "Copycat Chick-Fil-A Grilled Chicken Sandwich", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢4ozthin cut chicken breasts", "▢jar of pickle juice", "▢salt and pepper", "▢grean leaf lettuce", "▢50gripe tomato slice", "▢bun (I use Alfaro Artesano bakery buns)", "▢2tbspBolthouse Farms Honey BBQ Ranch *"], "instructions": ["Marinate thin cut chicken breasts in pickle juice for up to 24 hours. Season with salt and pepper and grill for 3 mins each side.", "Assemble your sandwich. Buns, sauce on the bottom, top with green leaf lettuce, tomato slice, grilled chicken, some sauce on top and enjoy! ⁣"], "notes": ["Using thin cut chicken breasts will ensure your chicken is juicy.", "Most grocery stores now sell Chick-Fil-A sauce if you want the ultimate copycat grilled chicken sandwich. It is however high in fat."], "nutrition": null, "url": "https://ohsnapmacros.com/copycat-chick-fil-a-grilled-chicken-sandwich/"}
{"title": "Sweet and Savory Instant Pot Beef Short Ribs", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢4lbs.beef short ribs, bone-in", "▢1Tbsp.olive oilfor searing"], "instructions": ["Mix together all the dry rub ingredients. Apply generously to the beef short ribs, ensuring all sides are coated. I like to do this by sprinkling the rub onto a baking sheet and pressing the ribs into the rub. Allow the ribs to marinate on a baking sheet for at least 1 hour in the refrigerator.", "Turn on the Instant Pot's 'Sauté' function. Add olive oil. Once the oil is hot, add the ribs and sear on all sides until browned. Remove ribs and set aside. You may need to work in batches.", "Pour in a bit of beef broth to deglaze the pot, scraping up the brown bits from the bottom with a wooden spoon.", "In a bowl, mix together hoisin sauce, coconut aminos, brown sugar, honey, minced garlic, ginger, sesame oil, rice vinegar, and chili paste or sriracha (if using).", "Return the seared ribs to the Instant Pot, arranging so most, if not all, are in an even layer along the bottom of the pot. Pour the sauce mixture over them. Add the remaining beef broth. Secure the lid and set the pressure release to 'Sealing'. Cook on 'Manual' or 'Pressure Cook' high pressure for 40 minutes.", "Once done, let the pressure naturally release for 15 minutes, then manually release any remaining pressure.", "Remove the ribs. Set the Instant Pot to 'Sauté' mode. Mix cornstarch (or arrowroot powder) with 4-5 tablespoons of water to form a slurry. Stir this into the sauce and let it simmer until thickened to a sticky consistency.", "Return the ribs to the pot to coat them in the sticky sauce. Plate the ribs and drizzle with additional sauce. Garnish with sliced green onions, toasted sesame seeds and red pepper flakes (optional)."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "I am not providing grams per serving on this one because there is no way to get the same with every person with this one. Depending on the fat of your meat, the length you simmer the sauce the amount of liquid expressed during pressure cooking, and the bones in the ribs, the weight of this dish will vary greatly from person to person.I suggest weighing your total meat, dividing by 8, plating your serving, doing the same with the sauce, and adding the sauce if you want to be asaccurate as possible.", "If you’re not tracking or this is a special occasion you wish to not track, then eyeball and go for it!", "For crockpot and oven cooking methods see the blog post under“other cooking methods.”"], "nutrition": null, "url": "https://ohsnapmacros.com/instant-pot-short-ribs/"}
{"title": "Teriyaki Beef Bowls", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.lean ground beef96/4", "▢1red bell pepperthinly sliced", "▢2cupsbroccoli floretteschopped", "▢1/2cupshredded carrots", "▢1garlic cloveminced"], "instructions": ["Heat a pan over medium, spray with cooking spray and add the ground beef. Using a spatula break the beef into bite size pieces as it cooks. Cook until it is fully cooked through and no longer pink in the center approximately 5-7 minutes.", "While the beef cooks add the chopped broccoli to a microwave safe bowl with a splash of water at the bottom. Microwave for 1 minutes to soften some. Once the beef is cooked through add the broccoli, bell peppers, carrots and garlic to the pan. Cook, stirring often until the vegetables have softened.", "Add the sauce ingredients to a bowl and whisk together. Add to the cooked beef and simmer for 5-10 minutes stirring to get everything evenly coated and the sauce soaked into the beef.", "Cook the cauliflower rice and jasmine according to their package instructions. Mix them two together in a bowl. Add chopped green onions, sprinkle of red pepper flakes and additional coconut aminos. Mix together to combine.", "Assemble the teriyaki beef bowls with the rice blend and cooked teriyaki beef.", "For meal prep: each teriyaki beef bowl gets 180 grams of teriyaki beef and 128 grams of rice blend. The recipe makes 4 bowls or servings. Optional, top with additional coconut aminos, red pepper flakes, and chopped green onions as desired."], "notes": ["All nutrition facts are an estimate.", "You can make these bowls with any ground meat."], "nutrition": null, "url": "https://ohsnapmacros.com/teriyaki-beef-bowls/"}
{"title": "Instant Pot Shredded Beef", "servings": "53", "prep_time": null, "cook_time": null, "ingredients": ["▢3lbs.boneless chuck roast", "▢2tbsp.olive oilsplit", "▢1tbsp.salt", "▢1tbsp.garlic powder", "▢1tbsp.onion powder", "▢1tbsp.chili powder", "▢1limejuiced", "▢1cupbeef broth", "▢1handful cilantrochopped (optional)"], "instructions": ["Turn the instant pot on sauté. Trim the fat off your beef and cut into 2 inch chunks and place in a bowl. Add 1 tbsp. of olive oil, garlic powder, salt, onion powder, chili powder and lime juice to the bowl and mix together well to combine.", "Add the second 1 tbsp. olive oil to the instant pot and sauté the beef on all sides until slightly browned but not cooked.", "Add the beef broth to the pot, cover with the lid and seal the release valve. Pressure cook for 30 minutes.", "Let the beef slow release for 20 minutes before quick releasing. Once done you can either shred the beef directly in the pot or remove the beef with a slotted spoon, shred and return.", "To slightly thicken the sauce mix the tapioca flour with water and add to the pot. Mix well to combine. Lastly, add (optional) a handful of chopped cilantro.", "Serve in tacos, sandwiches, on salads or as is."], "notes": ["All nutrition facts are an estimate.", "You can use cornstarch to thicken if you don’t have tapioca flour.", "Rolling the lime around on the counter before cutting into it will help release the juices.", "You can use any oil.", "Serve in tacos, sandwiches, salads or eat as is."], "nutrition": null, "url": "https://ohsnapmacros.com/instant-pot-shredded-beef/"}
{"title": "Big Mac Burger Salad Bowl (meal prep favorite)", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.lean ground beef96/4", "▢1/2cuponionchopped", "▢2tsp.yellow mustard", "▢1tsp.garlic powder", "▢1tsp.onion powder", "▢salt and black pepperto taste"], "instructions": ["Spray a large skillet over medium heat with nonstick spray. Add the ground beef and onion and cook until the beef is cooked through and no longer pink, breaking into bite sized pieces.", "Add the garlic powder, onion powder, salt, pepper and mustard to the beef and stir to combine. Let simmer while you make your sauce.", "In a small mixing bowl, combine the mayonnaise, ketchup, pickles and pickle juice and mix to combine.", "Assemble your bowls and enjoy!"], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Per Bowl:2 cups lettuce, 100 grams meat mixture, 14g cheddar cheese, 58g Big Mac Sauce.", "Swap with any ground meat for a different bowl variation.", "You can also use a Thousand Island dressing in place of making your own sauce for these bowls."], "nutrition": null, "url": "https://ohsnapmacros.com/big-mac-bowls/"}
{"title": "Lazy Lasagna Skillet with Ground Beef (No Raviolis)", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.lean ground beef96/4", "▢1smallwhite onion, chopped100g", "▢1Tbsp.minced garlic", "▢1tsp.salt", "▢1tsp.black pepper", "▢1Tbsp.Italian seasoning", "▢1/2tsp.dried basil", "▢4cupstomato basil pasta sauce32oz. (I like Rao's)", "▢1/2cupbeef brothlow sodium", "▢8oz.rigatoni noodlesmeasured uncooked", "▢4oz.low moisture part skim mozzarella cheeseshredded", "▢4oz.part skim ricotta cheese"], "instructions": ["Bring a pot of water to a boil for cooking the pasta according to the directions on the box.", "While waiting on the water to boil, heat a large pan over medium heat and brown the ground beef while breaking into bite size pieces.", "When the meat is almost completely cooked through, stir in the chopped onion, garlic, salt, pepper, Italian seasoning and dried basil. Cook until fragrant and the onions are beginning to soften, approximately 3-5 minutes.", "Stir in the marinara sauce and beef broth and set to simmer while you cook the pasta noodles. Add the uncooked pasta to boiling water and boil according to the box instructions (about 13 minutes).", "Once pasta is cooked, drain and add to the pan with the meat sauce. Let simmer for 2-3 minutes while mixing the noodles in well to fully combine.", "Add the mozzarella and stir together until fully melted. While the lasagna is still hot add the ricotta cheese on top and slightly mix throughout the dish.", "Top with freshly chopped basil, parmesan cheese and enjoy."], "notes": ["All nutrition facts are an estimate.Weigh your total and divide by the number of servings for the most accurate grams per serving size.", "To make thisgluten-freeuse your favorite gluten-free pasta noodles.", "Addveggieslike chopped spinach, kale, shredded carrots, zucchini or riced cauliflower to beef up the volume.", "To make thisdairy-free, swap out the cheese with your favorite dairy-free cheese or omit it completely.", "Cottage cheese is a great substitute for ricotta cheese."], "nutrition": null, "url": "https://ohsnapmacros.com/lasagna-pasta-skillet/"}
{"title": "Easy Turkey Lasagna Soup Recipe (30-minute meal)", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.lean ground turkey99/1", "▢1tsp.olive oil", "▢1cupyellow onion, diced135g", "▢4clovesgarlicminced", "▢3Tbsp.Italian Seasoning", "▢1.5Tbsp.dried basil", "▢2tsp.salt", "▢1/4-1/2tsp.red pepper flakesdepending on desired heat", "▢Fresh cracked pepper", "▢1large can Crushed Tomatoes28 oz.", "▢1canRotel tomatoes and green chilies10 oz.", "▢2cupswater", "▢4cupslow sodium beef broth32 oz.", "▢8oz.uncooked lasagna noodlesbroken into pieces", "▢3oz.part skim ricotta cheese"], "instructions": ["Heat a large pot or dutch oven or over medium-high heat and add oil and garlic. Cook the garlic until fragrant. Add onions and cook until translucent, stirring often.", "Add ground turkey to the pan and cook until browned. Break the turkey up as you cook into bite size pieces.", "Once the turkey is browned add Italian Seasoning, basil, salt, fresh cracked pepper and cayenne pepper. Mix together well to coat the turkey evenly.", "Add crushed tomatoes, rotel, water and broth to the pot and bring to a rapid boil. Taste your sauce and see if you need to add any salt, pepper or additional seasonings to taste. I like to add a lot of fresh ground pepper.", "Add the uncooked broken lasagne noodles directly to the sauce and submerge so they’re covered for cooking. Bring the sauce with noodles to a rapid boil. Lower heat to a steady simmer and cook noodles for 12-15 minutes until the noodles are cooked to desired doneness.", "Once the pasta is cooked, stir in ricotta cheese. Serve hot!", "Serve immediately topped with a extra dollop of ricotta cheese if desired, fresh grated parmesan cheese and fresh chopped basil."], "notes": ["Nutrition info is an estimate and will vary with substitutions.", "Feel free to use any noodle of choice or a gluten-free variety.", "Sub out ground turkey for chicken, pork or beef.", "NOTE! This soup thickens as it sits and once it is refrigerated. The noodles soak up the liquid. When reheating add additional water or low-sodium beef broth to loosen it back up."], "nutrition": null, "url": "https://ohsnapmacros.com/turkey-lasagna-soup/"}
{"title": "Turkey Taco Bowl", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢4ozground turkey – measured raw or adjusted for cooked", "▢Taco Seasoning", "▢60gbasmati rice", "▢60gunsalted black beans, drained and rinsed", "▢30gcorn", "▢30gsalsa", "▢1/3containerof Eat Wholly spicy guacamole*", "▢juice of 1 lime wedge", "▢fresh chopped cilantro"], "instructions": ["Brown your turkey meat with taco seasoning. *", "Layer rice in the bottom of your meal prep dish. Top with turkey, beans, corn and lime juice.If meal prepping – leave off salsa, cilantro and guacamole and add after reheating."], "notes": ["Use ground chicken, pork or beef.", "Measurements and nutrition information is for one prepared bowl. Taco seasoning is for 1 lb of turkey meat which makes 4 bowls. You can use any guacamole here but I like to use the individual Eat Wholly Packs for convivence when meal prepping."], "nutrition": null, "url": "https://ohsnapmacros.com/taco-bowl-meal-prep/"}
{"title": "Southwest Frittata", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.Jennie-O Turkey Sausage", "▢1tsp.olive oil", "▢1red bell pepperdiced", "▢1/4small red oniondiced", "▢1jalapeñoseeded and chopped", "▢1tsp.chili powder", "▢1tsp.cumin", "▢salt and pepper, to taste", "▢16oz.liquid egg whites", "▢1/2cupshredded cheddar cheese56 g"], "instructions": ["Preheat your oven to 375 degree Fahrenheit. Heat up a 10-inch oven-safe skillet or cast iron with olive oil.", "Add the turkey sausage to your preheated skillet, breaking it into small chunks. Cook the meat through, stirring often, until no longer pink.", "Once the meat is cooked, add the bell pepper, onion and jalapeño to the pan with the turkey. Cook, stirring occasionally, until the vegetables are tender, about 5 minutes. Add the chili powder, cumin, salt and pepper and stir to combine. Remove from heat.", "Once the pan is removed from the heat, pour the egg whites over the sausage and vegetable mixture into the skillet. Sprinkle the top with shredded cheddar cheese and transfer to the oven.", "Bake for 25 minutes or until egg whites are set and cheese is melted and bubbly. Remove the frittata from the oven and let it cool. Cut your southwest frittata into 8 equal slices and serve with hot sauce, cilantro, salsa, or Greek yogurt in place of sour cream."], "notes": ["All nutrition facts are an estimate.", "If using egg whites from real eggs, 16 oz is equivalent to about 10-12 large eggs."], "nutrition": null, "url": "https://ohsnapmacros.com/southwest-frittata/"}
{"title": "High Fiber Breakfast Burrito Bowls with Cauliflower Rice", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.lean ground turkey99/1", "▢Taco Seasoning", "▢1orange bell peppersliced", "▢1small red onionsliced", "▢1garlic cloveminced", "▢10 oz.frozen riced cauliflower", "▢1/4cupfresh cilantrochopped", "▢1/2lime, juiced", "▢15oz.black beansrinsed and drained"], "instructions": ["Heat a pan over medium, spray with cooking spray and add the ground turkey. Using a spatula break the turkey into bite size pieces as it cooks. Cook until it is fully cooked through and no longer pink in the center approximately 5 minutes.", "While the turkey cooks add all the taco seasonings to a small bowl. Top with the water and mix to form a paste. Add the paste to the cooked turkey, mix together well to combine and turn the heat to low. Let the turkey cook in the seasonings for a few minutes while you prep the vegetables.", "Remove the cooked turkey from the pan and set aside. Spray the pan with non stick cooking spray and add the garlic, bell pepper and onion to the pan. Let the veggies saute over medium heat, stirring often so they do not burn, while you prepare the cauliflower rice.", "Cook the cauliflower according to the package instructions. Remove from the bag and add to a bowl. Combine with the chopped cilantro and lime juice and mix together well.", "Assemble your breakfast burrito bowls. Top with eggs if desired or turn into a salad over  a bed of lettuce. Egg is not included in the nutrition facts, see notes.", "Approximate measurements per bowl. Turkey Meat – 114 grams, Black Beans – 53 grams, Peppers & Onions – 55 gram, Cauliflower Rice – 67 grams"], "notes": ["Each bowl gets 1/4 of each ingredient. Above are approximate grams per bowl. Please note that these are estimates and it is always best to weigh your total and divide by the number of servings for the exact measurements per serving.", "Eggs are not included in the nutrition facts. Top your bowls with fried eggs, scrambled eggs or egg whites or enjoy as they are! These are great with added lettuce as burrito bowls for lunch as well.", "These bowls are totally customizable to make your own so feel free to get creative."], "nutrition": null, "url": "https://ohsnapmacros.com/breakfast-burrito-bowls/"}
{"title": "Air Fryer Shrimp Tacos with Mango Corn Salsa and Avocado Crema", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.raw jumbo shrimp, tails off and deveined", "▢1tsp.smoked paprika", "▢1tsp.ground cumin", "▢1tsp.chili powder", "▢1/2tsp.salt", "▢6snack size flour tortillasCarb Counter", "▢shredded cabbage"], "instructions": ["Add the corn, mango, tomatoes, red onion, and cilantro to a bowl and stir to combine. Refrigerate for at least an hour before serving."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Use raw shrimp not pre-cooked. Pre-cooked will get too tough.", "Add your favorite taco additions like jalapenos and hot sauce for added heat."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-shrimp-tacos/"}
{"title": "Steak and Shrimp Stir Fry", "servings": "5", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.Flank Steak", "▢1lbs.frozen Medium waterfront BISTRO Shrimp Raw Peeled & Deveined Tail Off", "▢1package Bens Original Jasmine Ready Rice Side Dish – 8.5 OZ", "▢1tsp.olive oil for cooking", "▢1/3cup(95g) Coconut Aminos", "▢1Tbsp.Dijon Mustard", "▢1package Stir-Fry Broccoli (12 oz.)", "▢3green onions, chopped"], "instructions": ["Slice flank steak into strips against the grain.In a zip lock or resealable bag add all steak marinade ingredients (coconut aminos, sesame oil, lime juice, ginger, garlic) and sliced steak. Lay flat in the fridge for at least 4 hours to marinade. I like to do this first thing in the morning so that it can marinade all day before dinner.", "Remove frozen shrimp from the package and place in a large bowl of warm, not hot, water. Let the shrimp defrost. You may need to drain the water and add fresh warm water 1 to 2 times to get the shrimp to fully defrost.", "While the shrimp defrosts cook the steak. Add 1 tsp. olive oil to a pan over medium high heat. Once the oil is hot add the steak and sear on both sides for approximately 3 minutes on each side. You want to sear the steak but not over cook it.Once the steak is cooked remove from the pan and set aside leaving all the juice from the steak in the pan.", "Add defrosted shrimp directly to the pan of steak juice. Cook until they become pink and no longer translucent. Once cooked add to the plate with the steak.", "Pour out the remaining liquid from the pan once you remove the shrimp.", "Add the bag of vegetable to a microwave safe bowl halfway full of water and cook for 3-5 minutes until the vegetables are fork tender while not being to soft. You want them slightly al dente.", "Once the vegetables are steamed add to the hot pan with 1/3 cup of coconut aminos and 1 Tbsp. dijon mustard and simmer.While the vegetable simmer cook the rice in the microwave according to the package instructions.", "Pour cooked rice into the pan and mix together well to combine. Add shrimp and steak back to the pan. Top with chopped green onions and mix everything together well and cook for a few minutes to ensure the steak and shrimp are warm.", "Top your steak and shrimp stir fry with sesame seeds, additional green onions, red chili pepper flakes and/or dijon mustard."], "notes": ["You will have excess sauce. That has been taken into account.", "Nutritional information is an estimate and will vary with substitutions.", "Always use raw shrimp and not cooked. Cooked shrimp will get tough."], "nutrition": null, "url": "https://ohsnapmacros.com/steak-and-shrimp-stir-fry/"}
{"title": "Single Serving Salmon Foil Packs", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢4oz.fillet of salmonraw", "▢1/2small potatovery thinly sliced, 100g", "▢1cupbroccolichopped, 100g", "▢1Tbsp.coconut aminos (or soy sauce)", "▢1Tbsp.sweet and spicy soy chili sauce"], "instructions": ["Pre heat oven to 400 F. Lay foil out on a baking sheet.", "Thinly slice potatoes, you could also use a mandolin here to ensure they are thin enough. Lay along the center of the foil.", "Top potatoes with salmon filet and surround the salmon with broccoli.", "Pour coconut aminos (or soy sauce) on top of the salmon and drizzle the Sweet & Spicy Soy Chili Sauce directly on top.", "Tent with a second piece of foil and secure edges to close the pack up tightly.", "Bake at 400 for 20 minutes until the salmon is fully cooked. If your salmon filets do not easily flake with a fork when you remove them from the oven place them back in the oven for another 3-5 minutes until the meat easily flakes with a fork.", "Unwrap and enjoy! We eat it directly out of the pack."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Recipe is for one salmon pack but you can make multiple and bake at the same time.", "Always choose fresh salmon when available. It should be bright pink. Never choose salmon that is dull or grey."], "nutrition": null, "url": "https://ohsnapmacros.com/easy-baked-salmon-foil-packs/"}
{"title": "Pumpkin French Toast Casserole with  Streusel Topping", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢10piecesDave’s Killer White Bread Done Right", "▢16oz.liquid egg whites", "▢1cuppumpkin puree260g", "▢1tsp.vanilla extract", "▢2tsp.pumpkin pie spice", "▢2Tbsp.light brown sugar+1 Tbsp. if you like it extra sweet"], "instructions": ["Pre-heat the oven to 350 degrees Fahrenheit. Prep a 9 x 13 inch baking dish with a lot of nonstick spray. The more the merrier so that it doesn't stick.", "Cut the bread into bite-size pieces, leaving the crusts on, and place along the bottom of the baking dish.", "Combine eggs, vanilla, brown sugar, pumpkin pie spice in a bowl. Whisk together to combine. Add pumpkin puree and whisk until fully combined. Pour on top of the bread.", "Add oats, butter and brown sugar to a small bowl. Microwave until the butter has melted, approximately 30-60 seconds, and mix together. It will be chunky. Evenly sprinkle on top of the casserole.", "Bake the pumpkin French toast casserole at 350 degrees Fahrenheit for 35 minutes or until a toothpick comes out clean. Broil the top if needed.", "Cut into 8 equal squares and serve. Top with protein frosting, maple syrup and a side of sausage."], "notes": ["You can double the egg whites for extra protein.", "You can also use brioche, day-old bread or French bread.", "If the top is browning too fast, tent with foil towards the end.", "Use butter in place of coconut oil.", "All nutritional data is an estimate."], "nutrition": null, "url": "https://ohsnapmacros.com/pumpkin-french-toast-casserole/"}
{"title": "Instant Pot Chicken Stroganoff with Greek Yogurt", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5lbs.boneless skinless chicken breastsliced", "▢8oz.egg noodles", "▢2 1/4cupchicken broth", "▢8oz.baby bella mushroomssliced", "▢2tsp.dijon mustard", "▢3oz.1/3 less fat cream cheese", "▢1cupnonfat plain Greek yogurt226 grams", "▢2cupsspinach (optional)chopped", "▢1tsp.salt", "▢1tsp.smoked paprika", "▢1tsp.garlic powder", "▢1/2tsp.black pepper"], "instructions": ["Slice the chicken into strips or chunks and place at the bottom of the instant pot.", "Top the chicken with salt, paprika, garlic powder and pepper.", "Add the sliced mushrooms, mustard, egg noodles and chicken broth to the instant pot over the chicken.", "Seal the instant pot and pressure cook for 6 minutes. Quick release when it is done cooking.", "Once done cooking, mix together well to combine.", "Add the cream cheese and Greek yogurt to the instant pot and mix together until fully combined.", "Lastly, add the chopped spinach and mix together until it has wilted.", "Serve and enjoy."], "notes": ["All nutritional data is an estimate.", "Always cut chicken against the grain to prevent the meat from getting tough.", "For a creamier and richer version, use full-fat cream cheese and/or Greek yogurt.", "For the most accurate serving measurement weigh your final dish and divide by the number of servings."], "nutrition": null, "url": "https://ohsnapmacros.com/instant-pot-chicken-stroganoff/"}
{"title": "Meal Prep Shredded Chicken Breast", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1-2lbs.boneless skinless chicken breast", "▢water"], "instructions": ["Trim any undesired fat from the chicken breast and place it in a large pot. Add water to the pot, enough to completely cover the chicken.", "Boil the chicken on medium-high heat until cooked through and no longer pink, approximately 15-25 minutes depending on the amount of chicken you have to boil. The internal temperature should read 165 degrees Fahrenheit with a meat thermometer when the chicken is cooked through.", "Remove the chicken from the water and place in a large bowl. Using a hand mixer or forks, shred the chicken until completely shredded."], "notes": ["Use a hand mixer to easily shred the chicken. Place chicken in a large bowl to prevent the chicken from flying everywhere."], "nutrition": null, "url": "https://ohsnapmacros.com/shredded-chicken-breast/"}
{"title": "Macro Friendly Chili Mac", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢175gMacro Friendly Instant Pot Chili", "▢190gMacro Mac and Cheese"], "instructions": ["Mix together and ENJOY!"], "notes": ["Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/macro-friendly-chili-mac/"}
{"title": "Easy Beef Stroganoff with Greek Yogurt (30 minute meal)", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.beef sirloin or beef tenderlointhinly sliced against the grain", "▢1Tbsp.olive oil", "▢1smallyellow onionfinely chopped", "▢3clovesgarlicminced", "▢8oz.baby Bella mushroomssliced", "▢1tsp.saltor to taste", "▢1/2tsp.black pepperor to taste", "▢1-2Tbsp.dijon mustard2 for added flavor(my preference!)", "▢2Tbsp.all-purpose flour", "▢2 1/4cupsbeef broth", "▢3/4cups2% plain Greek yogurtfull-fat for creamier version", "▢3tsp.Worcestershire sauce", "▢1tsp.smoked paprika", "▢fresh parsleychopped, for garnish", "▢8oz.egg noodlesmeasured uncooked", "▢salt and pepper, to taste"], "instructions": ["Boil the uncooked egg noodles according to the package instructions while you prepare the stroganoff.", "Make sure your beef is thinly sliced against the grain and all your vegetables are chopped. Season the beef with salt and pepper.", "Heat the olive oil in a large skillet over medium-high heat. Add the beef strips and cook until browned on all sides, approx. 2 minutes each side to give a good sear. Remove the beef from the skillet and set aside.", "In the same skillet, add the onions, garlic, and mushrooms. Sauté until the onions are translucent and the mushrooms are browned. Season with salt and pepper.", "Stir in the Dijon mustard and flour to coat the vegetables, cooking for 1-2 minutes. Gradually whisk in the beef broth, ensuring there are no lumps. Bring the mixture to a simmer and let it thicken.", "Add the Greek yogurt, Worcestershire sauce, and smoked paprika and continue whisking until the yogurt has fully melted into the sauce.", "Return the beef to the skillet, stir to combine and cook for an additional 2-3 minutes, or until the beef is cooked to your liking and the sauce is creamy.", "Add the drained and cooked egg noodles directly to the sauce or in individual servings and stir to combine. Season with salt and fresh cracked pepper to taste and top with freshly chopped parsley."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "If you have issues with your sauce not thickening, you can easily add a cornstarch or arrowroot powder slurry to thicken the sauce.", "The total serving in the nutrition facts is for the noodles mixed into the dish and served fully combined.", "Nutrition without noodles:serving size approximately 220 grams. Nutrition: Calories 239 Total Fat 13 g Saturated Fat 5 g Monounsaturated Fat 2 g Polyunsaturated Fat 0 g Trans Fat 0 g Cholesterol 59 mg Sodium 519 mg Potassium 489 mg Total Carbohydrate 8 g Dietary Fiber 1 g Sugars 4 g Protein 22 g", "Always slice beef against the grain to ensure the meat stays tender."], "nutrition": null, "url": "https://ohsnapmacros.com/greek-yogurt-beef-stroganoff/"}
{"title": "Soft and Chewy Valentine’s Day M&M Cookie Bars", "servings": "16", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cupunsalted buttersoftened", "▢1/2cupgranulated sugar (or sugar substitute)100g", "▢1/2cuplight brown sugar (or sugar substitute)90g", "▢1largeegg", "▢1tsp.vanilla extract", "▢1.5cupsall-purpose flour180g", "▢1/2tsp.baking soda", "▢1/4tsp.salt", "▢1/2tsp.ground cinnamon", "▢1/3cupValentine's m&ms (or any m&m)75g", "▢1Tbsp.sprinkles (using Wilton pink, red and white)10g"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a 8×8 or 9×9-inch baking pan with parchment paper or spray with nonstick spray. If using a good nonstick metal pan, no need. Do not use bigger than a 9×9 pan.", "In a separate medium bowl, whisk together the flour, baking soda, salt, and cinnamon.", "In a large bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy using an electric mixer. Beat in the egg and vanilla extract until well combined.", "Add the dry ingredients to the wet mixture, mixing until just combined.", "Gently fold in the M&M’s and sprinkle.", "Add the cookie dough to the prepared baking pan and using a rubber spatula or your hands work the dough so it covers the entire surface of the pan. Bake for 20-25 minutes until the edges are browned and a toothpick comes out with a few crumbs.", "Remove from the oven and allow the cookie bars to cool in the pan for about 5-10 minutes. When ready to transfer either remove with the parchment paper or place cutting board over the top of the pan and flip out onto the cutting board. To flip the top side back up use a second surface or cutting board, place on the bottom of the bars and flip over.", "Cut into 16 equal squares and enjoy."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Do not use a 9×13 or anything larger than a 9×9-inch pan. This will cause extremely thin bars. The smaller the pan the thicker."], "nutrition": null, "url": "https://ohsnapmacros.com/valentine-cookie-bars/"}
{"title": "Lightened Up Big Mac Sloppy Joes", "servings": "5", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2yellow onionchopped", "▢1lbs.lean ground beef96/4", "▢1tsp.yellow mustard", "▢1tsp.garlic powder", "▢1tsp.onion powder", "▢1/2tsp.salt", "▢fresh cracked black pepperto taste", "▢1/2cupbeef brothsplit", "▢1tsp.corn starchmixed with 1/4 cup broth", "▢1tsp.Worcestershire sauce", "▢5slicesAmerican Cheese", "▢5Brioche hamburger buns"], "instructions": ["Spray a large skillet over medium heat with nonstick spray. Add the onions and meat and cook breaking until pieces until cooked through, approximately 5 minutes.", "Add garlic powder, onion powder, salt and pepper and stir to coat the meat. Add the mustard and stir to combine. Add the Worcestershire and ¼ cup beef broth. Stir together and simmer for 2-3 minutes.", "Add the cornstarch to the remaining ¼ cup broth and add to the meat. Stir and let simmer for 5 minutes to thicken.", "While the sauce thickens make the Big Mac sauce. Combine the mayonnaise, ketchup, pickles and pickle juice in a small bowl.", "To assemble, turn the oven to broil. Place the bottom buns on a baking sheet and top the with 1 tbsp. Sauce (16g), shredded iceberg lettuce, ½ cup meat mixture (103g), a slice of American cheese. Place in the oven and broil until the cheese has melted. Put an additional 1 tbsp. (16g) sauce on the top bun, pickles (optional) and place the top bun on top of the burger and enjoy!", "Optional: broil your buns before assembling for a nice crispy bun."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Ground beef gives the most authentic Big Mac flavor. You can use ground chicken or turkey, if needed, adding burger seasoning to add flavor.", "Serving size includes bun, cheese, 103g of meat and 32g of sauce."], "nutrition": null, "url": "https://ohsnapmacros.com/big-mac-sloppy-joes/"}
{"title": "20+ Macro Friendly 4th of July Recipes", "servings": "17", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cupunsalted buttersoftened", "▢1/2cupgranulated sugar (or sugar substitute)100g", "▢1/2cuplight brown sugar (or sugar substitute)90g", "▢1largeegg", "▢1tsp.pure vanilla extract", "▢2cupsall-purpose flour240g", "▢3/4tsp.baking soda", "▢1/2tsp.baking powder", "▢pinch of salt", "▢1/8tsp.ground cinnamon (1/4-1/2 tsp. if you like heavy cinnamon)"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a cookie sheet with parchment paper or a silicone baking mat.", "In a large mixing bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy using a hand mixer. Beat in the egg and vanilla extract until well combined.", "In a separate medium bowl, whisk together the flour, baking soda, baking powder, salt and cinnamon.", "Add the dry ingredients to the wet ingredients, mixing until just combined. You will need to use a rubber spatula to fully mix as the dough is a bit dryer. (You will begin to think something’s missing and they’re too dry, just keep mixing! It’ll come together!)", "Using a 1.5-tablespoon cookie scoop, drop cookie dough balls onto the prepared baking sheet, leaving space between each cookie. Bake for 11-12 minutes, or until the edges are golden but the center is still soft.", "Remove from the oven and allow the cookies to cool on the baking sheet for about 5 minutes before transferring them to a wire rack to cool completely.", "Store your cookies in an airtight container for 3-4 days."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Add chocolate chips if you want!", "You can substitute coconut oil for butter but note the taste and texture may change.", "Do not over-mix your dough as it will result in tough and dense cookies. Just mix until the flour is just combined."], "nutrition": null, "url": "https://ohsnapmacros.com/macro-friendly-4th-of-july-recipes/"}
{"title": "14 High Protein Family-Friendly Valentine’s Recipes", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/valentines-dinner-ideas/"}
{"title": "Air Fryer Chicken Meatballs (dairy-free)", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.ground chicken (lean 96%)", "▢1/4cupItalian breadcrumbs40g", "▢1Tbsp.garlic powder", "▢1tsp.Italian seasoning", "▢pinch of salt", "▢pinch of black pepper", "▢parsleyfor garnish"], "instructions": ["Preheat your air fryer to 380 degrees F.", "While the air fryer is heating, combine chicken and all seasonings (minus parsley) in a large bowl and mix well to combine.", "Using a 1/4 measuring cup, measure out 2 oz. meatballs and roll. This recipe makes 8, 2 oz. meatballs or 16, 1 oz. meatballs.", "Spray the air fryer basket with non-stick spray. Lay meatballs in a single layer, careful they do not touch.", "Air fry at 380 degrees Fahrenheit for 10-12 minutes until the meatballs are cooked through. 12 minutes for 2 oz. meatballs and less for smaller."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Nutrition facts listed are for 8 – 2 oz. meatballs.", "Use any type of ground meat.", "Do not over-mix the meatball mixture when forming into balls. This will ensure they stay moist and juicy and not tough."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-chicken-meatballs/"}
{"title": "Quick and Healthy Air Fryer Sweet and Sour Chicken", "servings": "5", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.chicken breastboneless, skinless, cubed", "▢1cuppineapple juiceor juice of one 20 oz. can", "▢1cuppineapple chunks", "▢1/2cupSwerve brown sugar", "▢1/3cuprice vinegar", "▢3tbsp.ketchup", "▢2tbsp.coconut aminos"], "instructions": ["Preheat the air fryer. Chop the chicken into bite size pieces. Season with salt and pepper. Add the chicken to the basket of the air fryer and cook at 380 degrees Fahrenheit for 10 minutes until cooked through.", "Mix the tapioca flour and water in a small bowl and set aside to use to thicken the sauce.  Add pineapple juice, rice vinegar, brown sugar substitute, ketchup and coconut aminos to a large pan over medium. Whisk the sauce and bring it to a low boil.", "While the sauce simmers add the tapioca slurry and continue stirring to thicken the sauce. This will happen almost instantly.", "Once the sauce has thickened add the cooked chicken from the air fryer. Be sure not to add the juice from the air fryer or you sauce will thin out. Add pineapples and mix together well so the pineapples and chicken are coated with the sauce.", "Top with chopped green onions and serve with rice or steamed vegetables. Add leftover sauce on top when serving or see sauce tip below."], "notes": ["If you want an extra thick sauce, coat and remove the chicken from the sauce and add an additional pinch of tapioca slurry to the sauce and add to the top.", "Cook chicken in a single layer in the air fryer and flip halfway though. This will ensure an even cook.", "For gluten-free, ensure rice vinegar is free of gluten.", "All nutritional data is an estimate.For the most accurate serving measurement weigh your final dish and divide by the number of servings."], "nutrition": null, "url": "https://ohsnapmacros.com/air-fryer-sweet-and-sour-chicken/"}
{"title": "Sweet and Savory Ham and Pineapple Fried Rice", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢2cupsuncooked jasmine Minute Rice192g", "▢10oz.frozen riced cauliflowercooked", "▢2Tbsp.toasted sesame oilsplit", "▢2clovesgarlicminced", "▢1lb.pre cooked diced hamchopped", "▢1.5cupspineapple chunksfresh preferred or canned, 250g,", "▢1cupred bell pepperdiced", "▢1/2cupfrozen peasthawed", "▢2wholeeggs", "▢1/3cupcoconut aminos105g (or soy sauce)", "▢fresh cracked pepper"], "instructions": ["Microwave 2 cups of rice plus 2 cups of water for 8 minutes, according to the package instructions. Once cooked, transfer the bowl to the fridge to cool rice. Cook the cauliflower rice according to the package, strain any excess liquid and and it to the bowl of the jasmine rice and combine.", "In a large pan or wok, heat 1 Tbsp. sesame oil over medium heat. Add the garlic and saute for a couple minutes until fragrant. Add the ham and red pepper to sear and soften the peppers. You want a nice browning on the ham chunks, this will take approximately 5 minutes.", "Add the thawed peas to the pan and stir to combine. Push everything to the outer edges of the pan and add the remaining 1 Tbsp. oil, crack 2 eggs in the center. Stir to scramble and cook until fully cooked through. Mix into the ham mixture to combine.", "Add the chilled cooked rice and cauliflower blend, breaking apart any large clumps, stirring together to combine everything evenly. Let it fry on the bottom for a minute at a time before stirring everything together. Pour the coconut aminos over the rice, and season with pepper. Mix everything well.", "Stir in the pineapple chunks and cook for another 2 minutes.", "Once everything is well combined and the rice is hot, serve and garnish with chopped green onions if desired."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "The serving size is 1.5 cups which is approximately 285g.", "Use a pre-cooked store-bought boneless ham or leftover holiday ham. You can get a 2 lbs. cooked ham near the meat section at most grocery stores. This is great for sandwiches, mixed with eggs, in this recipe, etc.", "If you don’t have microwavable rice, you can use day-old leftover rice. Day-old rice has less water and will prevent the rice from getting soggy."], "nutrition": null, "url": "https://ohsnapmacros.com/ham-and-pineapple-fried-rice/"}
{"title": "Slow Cooker Chicken and White Bean Chili", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.chicken breast⁣", "▢2canswhite chili beans (rinsed and drained) ⁣", "▢1cancorn⁣ (drained)", "▢2canschopped green chilies⁣", "▢2cupschicken broth ⁣", "▢2tsp.cumin⁣", "▢2Tbsp.chili powder", "▢1Tbsp.onion powder ⁣", "▢1/2Tbsp.garlic powder ⁣", "▢1tsp.salt", "▢1tsp.black pepper ⁣"], "instructions": ["Put everything in the crock pot on low for 5 hours. Once done shred chicken in the crockpot and enjoy!! ⁣", "Top with sour cream, cheese, avocado, red onion, or anything that sounds good! ⁣"], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "If you want this dish less spicy, use 1/2 the chili powder.", "Use rotisserie chicken.", "Add any desired veggies.", "Add a touch of heavy cream for a thicker and richer chili."], "nutrition": null, "url": "https://ohsnapmacros.com/chicken-and-white-bean-chili/"}
{"title": "Tracking Macros: The Basics", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/tracking-macros-the-ultimate-guide-to-tracking-your-macros/"}
{"title": "Macro Friendly Costco Haul", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/macro-friendly-costco-haul/"}
{"title": "Sugar-Free Cajun Seasoning", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢3Tbsp.smoked paprika", "▢1.5Tbsp.salt", "▢2Tbsp.garlic powder", "▢1Tbsp.onion powder", "▢1Tbsp.dried oregano", "▢1Tbsp.cayenne pepper", "▢1tsp.black pepper"], "instructions": ["Whisk all ingedients together in a small bowl.", "Store in a sealed container in a cool place for up to 6 months."], "notes": ["Store in a cool dark place in an airtight container for up to 6 months.", "Use less cayenne pepper for a less spicy version. Add more if you want extra hot.", "Use for stews, soups, pasta sauce, meat marinade, etc."], "nutrition": null, "url": "https://ohsnapmacros.com/sugar-free-cajun-seasoning/"}
{"title": "Carrot Cake Baked Oats with Protein Frosting", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢2cupsold fashioned oats160g", "▢3/4cupvanilla protein powderPEScience 60g (approx. 2 scoops)", "▢1tsp.baking powder", "▢1tsp.ground cinnamon", "▢1/4tsp.ginger", "▢1/8tsp.nutmeg", "▢1/8tsp.cloves", "▢1/2tsp.salt", "▢1/4cuphoney (or syrup of choice)76g", "▢1tsp.vanilla extract", "▢2largeeggs", "▢1 1/2cupunsweetened vanilla almond milk (dairy or plant-based is fine)360ml", "▢1/2cupnonfat plain greek yogurt112g", "▢1/4cupcoconut oil (melted)or butter", "▢1cupfinely grated carrot80g", "▢1/4cupchopped pecans30g", "▢1/4cupraisins40g"], "instructions": ["Preheat your oven to 350°F (175°C) and line an 8×8-inch baking dish with parchment paper or use a good nonstick baking dish.", "In a large bowl, combine the oats, protein powder, baking powder, cinnamon, ginger, nutmeg, cloves and salt. Whisk together to combine.", "In another bowl, whisk together the honey, vanilla extract, eggs, milk, greek yogurt, and melted coconut oil. Whisk until well combined.", "Add the dry ingredients to the wet ingredients and stir until well combined. Fold the shredded carrots, nuts and raisins into the oat mixture.", "Pour the mixture into the prepared baking dish, spreading it out evenly and bake in the preheated oven for 50-55 minutes, or until the center is set and a toothpick inserted comes out clean or with a few moist crumbs.", "To make the frosting, mix together the yogurt, protein powder and honey until smooth. Make sure to use a protein powder that is not chalky when mixed with yogurt. It will make a difference.", "Spread the frosting evenly over the baked oatmeal and sprinkle with additional nuts or serve on individual servings."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Nutritional information includes 1 slice of baked oats (approx. 165 grams) with approx. 1.5 Tbsp. of protein frosting on top.", "Without frosting:286 calories, 13g fat, 26g carbs, 16g protein, 6g sugar, 4g fiber.", "Use a protein powder that doesn’t get chalky or else you’ll have a grainy frosting."], "nutrition": null, "url": "https://ohsnapmacros.com/carrot-cake-baked-oats/"}
{"title": "High Protein Taco Mac and Cheese", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢1lbs.lean ground beef96/4", "▢Taco Seasoning", "▢8oz.Banza Chickpea Pasta Elbowsweighed uncooked", "▢1red bell pepper, chopped113g"], "instructions": ["Bring a large pot of water to a boil and cook the elbow macaroni according to the package directions.", "While the noodles cook start browning your meat in a large skillet over medium heat breaking it down into bite-sized pieces as you cook it.", "While the meat browns combine all taco seasonings in a small bowl with the water to create a paste. Once browned add the taco seasoning to the meat and reduce to a simmer. Add the chopped bell peppers and let simmer for 5 minutes stirring often.", "Using an immersion blender, food processor, or blender, blend the cottage cheese so that it is completely smooth. Once smooth add the salsa, milk, and flour and mix together well to combine.", "Add the cottage cheese sauce, mild cheddar and sharp cheddar cheese to the pan with the meat mixture. Mix together to completely melt the cheese and evenly combine.", "Drain the noodles from the water and add the cooked pasta to the large skillet with the meat and cheese mixture. Mix together well. Top with chopped cilantro and enjoy!"], "notes": ["Nutrition facts are an estimate.", "Use any type of ground meat but beef gives the most authentic taco flavor.", "Chickpea pasta adds protein but any short noodle works well.", "Use full-fat cottage cheese for a creamier dish."], "nutrition": null, "url": "https://ohsnapmacros.com/taco-mac-and-cheese/"}
{"title": "Hawaiian Inspired Macaroni Salad", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢8ozchickpea macaroni noodlesBanza", "▢8ozcan pineapple tidbitsdrained", "▢1red bell pepperchopped", "▢1/2cupcelerydiced", "▢1/4cupred onionchopped", "▢2green onionschopped"], "instructions": ["First, cook the macaroni according to the package instructions. Once cooked, drain and fill the pot with cold water to stop the cooking process and cool the pasta. Set aside.", "In a small mixing bowl, combine the non-fat Greek yogurt, light mayonnaise, apple cider vinegar, and honey. Mix well until smooth. Season with salt and pepper to taste.", "Then, add the cooled macaroni, pineapple tidbits, red bell pepper, celery, red onion and green onions to a large mixing bowl.", "Top with the yogurt dressing and gently fold the ingredients together, ensuring that the macaroni and other ingredients are evenly coated with the yogurt dressing.", "Cover the bowl with plastic wrap and refrigerate for at least 1 hour, or until chilled. This allows the flavors to meld together.", "Before serving, give the salad a quick stir. Taste and season with salt and pepper to taste. Garnish with additional green onions, cilantro or even shredded coconut, if desired."], "notes": ["All nutrition facts are an estimate.", "Refrigerate for at least an hour before serving.", "Feel free to use any type of noodle."], "nutrition": null, "url": "https://ohsnapmacros.com/hawaiian-macaroni-salad/"}
{"title": "Chewy and Soft Chocolate Chipless Cookies", "servings": "17", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cupunsalted buttersoftened", "▢1/2cupgranulated sugar (or sugar substitute)100g", "▢1/2cuplight brown sugar (or sugar substitute)90g", "▢1largeegg", "▢1tsp.pure vanilla extract", "▢2cupsall-purpose flour240g", "▢3/4tsp.baking soda", "▢1/2tsp.baking powder", "▢pinch of salt", "▢1/8tsp.ground cinnamon (1/4-1/2 tsp. if you like heavy cinnamon)"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a cookie sheet with parchment paper or a silicone baking mat.", "In a large mixing bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy using a hand mixer. Beat in the egg and vanilla extract until well combined.", "In a separate medium bowl, whisk together the flour, baking soda, baking powder, salt and cinnamon.", "Add the dry ingredients to the wet ingredients, mixing until just combined. You will need to use a rubber spatula to fully mix as the dough is a bit dryer. (You will begin to think something’s missing and they’re too dry, just keep mixing! It’ll come together!)", "Using a 1.5-tablespoon cookie scoop, drop cookie dough balls onto the prepared baking sheet, leaving space between each cookie. Bake for 11-12 minutes, or until the edges are golden but the center is still soft.", "Remove from the oven and allow the cookies to cool on the baking sheet for about 5 minutes before transferring them to a wire rack to cool completely.", "Store your cookies in an airtight container for 3-4 days."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Add chocolate chips if you want!", "You can substitute coconut oil for butter but note the taste and texture may change.", "Do not over-mix your dough as it will result in tough and dense cookies. Just mix until the flour is just combined."], "nutrition": null, "url": "https://ohsnapmacros.com/chocolate-chipless-cookies/"}
{"title": "Coffee Peanut Butter Protein Shake", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cupbrewed coffee, chilled120ml", "▢2/3cupunsweetened almond milk (or milk of choice)160ml", "▢1ripebanana, frozen preferred100g", "▢1scoopprotein powder (unflavored, chocolate or vanilla) PEScience Gourmet Vanilla31g", "▢1Tbsp.peanut butter (or nut butter of choice)", "▢1Tbsp.cocoa or cacao powder", "▢1/4tsp.ground cinnamon", "▢ground cinnamon, for garnish"], "instructions": ["Place all ingredients in your blender jar, then cover and blend on low speed. Gradually increase blender speed until smooth. (If your blender has shake mode, you can use that).", "Pour your shake into a large glass. Top with additional cinnamon, if desired. Enjoy!"], "notes": ["If your blender is struggling to blend everything smoothly, add a bit more milk.", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/coffee-protein-shake/"}
{"title": "Quick and Creamy Coconut Shrimp with Vegetables and Curry", "servings": "4", "prep_time": null, "cook_time": null, "ingredients": ["▢2lbs.large shrimp, peeled and deveinedfresh or frozen", "▢1Tbsp.coconut aminosfor shrimp", "▢4Tbsp.green curry paste, store bought (Thai Kitchen) *4 oz.", "▢1can (13.5oz.)lite coconut milk", "▢1/4cupfat-free half and half", "▢1Tbsp.coconut aminos", "▢1/2cupcorn, canned or fresh92g", "▢2cupsbroccoli florets", "▢1cupbaby carrotssliced", "▢1red bell pepperthinly sliced"], "instructions": ["Shell and devein your shrimp and place in a bowl with the coconut aminos, salt and pepper. Let sit until ready to cook and drain the excess liquid prior to adding to the pan.", "In a large pan or wok add the green curry paste and sauté over medium heat for a minute until fragrant.", "Pour in the coconut milk and stir well with the curry paste. Let it simmer for about 5 minutes.", "Add the half and half, corn, broccoli florets and bell pepper to the pan. Cook for another 5-7 minutes, or until the vegetables start to soften.", "Stir in the shrimp and cook for 3-4 minutes until they turn pink and opaque.", "Add the coconut aminos and a pinch of salt. Adjust the seasoning according to taste. Stir well to combine.", "Once the shrimp are fully cooked and the vegetables are tender, remove the pan from heat.", "Serve alone or with cooked jasmine rice, cauliflower rice, zoodles, noodles or anything you prefer.", "Garnish with fresh basil or cilantro leaves for a burst of flavor and serve with lime wedges to squeeze on top."], "notes": ["* I am using the brand Thai Kitchen green curry pasta which is more mild that Private Selection Green curry paste. If using a spicier curry paste HALF the amount and adjust to your heat preference.", "Nutritional information is an estimate and will vary with substitutions.", "Nutritional information does not include rice or other serving suggestions.", "If using frozen shrimp be sure to thaw and remove shells prior to using.", "Serve over rice, zoodles, cauli rice or whatever sounds good!"], "nutrition": null, "url": "https://ohsnapmacros.com/creamy-coconut-shrimp/"}
{"title": "Easy Peanut Butter Banana Chocolate Chip Cookies", "servings": "17", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cuplight brown sugarlightly packed 90g (or sugar substitute)", "▢1/2cupsugar100g (or sugar substitute)", "▢1/2cupunsalted buttermelted and cooled (or coconut oil) room temperature butter works too", "▢2Tbsp.creamy peanut butterJiff, 33g", "▢1tsp.vanilla extract", "▢1/4cupmashed bananaapprox 1/2 banana, 55g", "▢1 1/2cupall-purpose flour180g", "▢1/2tsp.cinnamon", "▢1/2tsp.baking soda", "▢1/4tsp.salt", "▢1/2cupSemi sweet chocolate chips80g"], "instructions": ["Preheat the oven to 400 degrees Fahrenheit and line a cookie sheet with piece of parchment paper.", "In a large bowl, mix together the sugar, melted butter, peanut butter, vanilla and mashed banana until smooth.Some banana chunks can remain.", "In a medium bowl, whisk together the flour, cinnamon, baking soda and salt.", "Add the dry ingredients to the wet ingredients, mixing until just combined.", "Fold in the chocolate chips.", "Drop 1.5 Tbsp. spoonfuls of cookie dough balls onto the prepared baking sheet. This recipes makes approximately 17 cookies with a 1.5 Tbsp. cookie scoop.", "Bake for 7-9 minutes or until the edges are lightly golden. Allow the cookies to cool on the baking sheet for a few minutes before transferring them to a cooling rack to cool completely."], "notes": ["Nutrition facts are an estimate and will vary with subsitutions.", "Do not over-mix the dough.", "Note: If you want the cookies to all be the same shape after baking, take to top of a mason jar lid, place it over the tops of the cookies and swirl it around in a circular motion for a few minutes. This will result in the perfect circular cookies."], "nutrition": null, "url": "https://ohsnapmacros.com/peanut-butter-banana-chocolate-chip-cookies/"}
{"title": "Homemade Maple Chicken Sausage Breakfast Patties", "servings": "14", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.lean ground chicken96/4", "▢1tsp.salt", "▢1/2tsp.black pepper", "▢1/2tsp.garlic powder", "▢1/4tsp.cayenne pepper", "▢1/4tsp.paprika", "▢2Tbsp.maple syrup or sugar-free syrup31g", "▢1Tbsp.olive oilfor cooking"], "instructions": ["In a mixing bowl, combine the ground chicken, spices and maple syrup. Using your hands, mash until well combined.", "Heat a cast iron skillet or nonstick skillet over medium-high heat. Add the olive oil to the pan.", "Using a 1.5 Tbsp. cookie scoop, scoop the chicken sausage into your hand and pat into a round patty shape.", "Add to the hot oil and cook for 3-4 minutes on each side until cooked through and brown. The internal temperature should read 165 degrees."], "notes": ["All nutrition facts are an estimate and will change with any substitutions.", "When forming your patties, do so gently and only as needed. Over patting can result in tough sausage patties.", "Make sure olive oil is nice and hot before adding patties, this will ensure a perfect cook."], "nutrition": null, "url": "https://ohsnapmacros.com/maple-chicken-sausage/"}
{"title": "Crispy Baked Chicken Tacos with Avocado Crema", "servings": "8", "prep_time": null, "cook_time": null, "ingredients": ["▢1lb.lean ground chicken96/4", "▢1tsp.salt", "▢1tsp.onion powder", "▢1tsp.garlic powder", "▢2tsp.smoked paprika", "▢1Tbsp.chili powder1/5", "▢1.5Tbsp.ground cumin", "▢1/4cupwater", "▢1Tbsp.lime juice", "▢8corn tortillas", "▢1  ⅓cupshredded Mexican blend cheese112g"], "instructions": ["Preheat the oven to 400 degrees Fahrenheit.", "Spray a medium skillet with nonstick spray over medium heat. Add the ground chicken and cook breaking into bite size pieces for approximately 5 minutes until no longer pink.", "While the meat cooks make the homemade taco seasoning. Add the salt, onion powder, garlic powder, smoked paprika, chili powder, cumin, water and lime juice to a small mixing bowl. Combine.", "Lower the heat to a simmer, add the taco seasoning paste and stir to combine. Let simmer for 3-5 minutes.", "To make the corn tortillas easier to work with, wrap them in a damp paper towel and microwave for 15-20 seconds. Spray a large baking sheet with nonstick spray or oil spray and lay out a tortilla. Top half the tortilla with 7g Mexican cheese, ¼ cup (58g) taco meat and top with an additional 7g cheese. Fold over and repeat with the remaining tacos. (see note)", "Spray the tops of the tortillas with oil spray and bake for 15 minutes. Allow to cool for a few moments to get nice and crispy.", "While the tacos cook make the crema. Add the avocado, cottage cheese, lime juice, cilantro, salt and garlic to a high speed blender. Blend for 5 minutes, and add 1 Tbsp. of milk at a time until you reach your desired consistency.", "Serve tacos topped with a drizzle of crema or on the side for dipping, red onions, salsa, and cilantro."], "notes": ["Baking tip: You may need to move the tortillas around to ensure they stay flat, if for any reason they flop open in the oven just push them back over and the cheese will hold them as it melts. Optional, you can lay a second sheet pan on top for half of the bake time and remove the second half to brown the tops.", "If in a time crunch, omit the avocado crema and serve with light sour cream or a dollop of greek yogurt.", "Serving size: 1 taco + 1 Tbsp. crema", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/baked-chicken-tacos/"}
{"title": "Crockpot Chicken Jalapeno Popper Cottage Cheese Dip", "servings": "14", "prep_time": null, "cook_time": null, "ingredients": ["▢8slicesbaconcooked and chopped (4 inside, 4 on top)", "▢16oz.less fat cream cheesecubed", "▢16oz.low fat cottage cheese", "▢4jalapeños (2 seedless, 2 with seeds)chopped, see heat note", "▢1cupMexican blend shredded cheese", "▢1cupmozzarella cheese low moistureshredded", "▢1tsp.garlic powder", "▢1/2tsp.salt", "▢fresh cracked black pepper", "▢1lb.boneless skinless chicken breast, raw", "▢1cuplow sodium chicken broth"], "instructions": ["In a large skillet cook the bacon, remove from the heat and chop into bite size pieces.", "Add the cream cheese, cottage cheese (no need to blend), jalapeños, half the chopped bacon, shredded cheeses, garlic powder, salt and pepper to the crockpot. Place the lid on and cook on high for 1 hour. Stir a couple times throughout the hour to get everything moving and melting and ensure the edges do not burn.", "While the base cooks in the crockpot, prepare the shredded chicken (this can be done the day before). Add the chicken to a large pot, cover with water and bring to a boil. Cook for 15-20 minutes or until the chicken is fully cooked through, no longer pink and has an internal temperate of 165 degrees Fahrenheit.", "Remove the chicken and shred with two forks or in a large mixing bowl with a hand mixer.", "Once the base has cooked for one hour, add the shredded chicken and 1 cup chicken broth to the crockpot. Stir everything together and let cook on high for an additional hour.", "Once done, stir together, adjust with salt and pepper and serve. Top with the remaining chopped bacon, sliced jalapenos, red onions, green onions or whatever you desire."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Remove all seeds for mild. Leave the seeds in 2 of the jalapeños for medium and all seeds for an extra spicy dip.", "Serving size is 1/2 cup, approx. 140 grams.", "If using precooked chicken, use 12.7 oz.", "STOVETOP: Cook the bacon, chop and add back to the pot with the jalapenos, cheeses, seasonings and broth. Stir until melted and stir in the shredded chicken."], "nutrition": null, "url": "https://ohsnapmacros.com/crockpot-chicken-jalapeno-popper-dip/"}
{"title": "Jalapeno Popper Shredded Chicken Wraps", "servings": "14", "prep_time": null, "cook_time": null, "ingredients": ["▢1batchJalapeno Popper Chicken Dip"], "instructions": ["Make the Jalapeno Popper Dip and use the leftovers.", "To make the wraps, add ½ cup (134g) of the chicken mixture onto a warmed wrap. Top with lettuce, tomato, onion or any preferred vegetables. Fold half over the filling, fold in the sides and continue to fold up into a burrito.", "Enjoy as is or sear on a hot grill pan for a crispy outer crunch."], "notes": ["For a crispy wrap: warm tortillas over a hot pan after filling it.", "Nutrition facts are an estimate and will change with any substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/jalapeno-popper-shredded-chicken-wraps/"}
{"title": "Easy Cottage Cheese Ranch Dip", "servings": "14", "prep_time": null, "cook_time": null, "ingredients": ["▢1.5cuplow-fat cottage cheesestrain water if needed*", "▢1/2cupchicken bone broth", "▢1tsp.garlic powder", "▢1tsp.onion powder", "▢1tsp.dried parsley", "▢1tsp.dried dill", "▢1/2tsp.salt", "▢fresh cracked black pepper"], "instructions": ["Put everything in a blender and blend until smooth. You will want to be sure to blend at LEAST 5 minutes to ensure the cottage cheese breaks down completely and leaves no chalkiness."], "notes": ["* You’ll notice sometimes cottage cheese can be super watery. We do not want to water this down since we’re adding the bone broth to do that. If you’re using a water cottage cheese, either drain excess liquid or use half the broth, or omit it completely. This is how you can avoid a super watered down dip.", "Blend until you can’t blend anymore. That’s how to avoid any chalkiness.", "Best served right away as you may experience some chalkiness returning when it sets in the fridge. You can however, re-blend, if needed. The blade heats and loosen the cottage cheese.", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/easy-cottage-cheese-ranch-dip/"}
{"title": "Air Fryer Big Mac Wraps", "servings": "3", "prep_time": null, "cook_time": null, "ingredients": ["▢3frozen burger pattiesI use Signature Farms 100% Beef 91/9", "▢1.5Tbsp.burger seasoning", "▢3slicesthin-cut cheddar cheese"], "instructions": ["Evenly season the burgers with your preferred burger seasoning on both sides. I like using Kinders Steak Blend and Kinders Carmalized Onion Burger seasoning.", "Add the burgers to the air fryer basket. Cook at 380 for 8 minutes, flipping the burgers halfway through. This will give you a medium to medium well burger. Cook 3 mins on each side for medium rare and 5 mins each side for well done. My air fryer can do 3 burgers at one time. You may need to work in batches if making more than 3 wraps.", "Top the burgers with cheese and cook for an additional 1 minute until melted.", "While the burgers cook, make your Big Mac Sauce. Add the mayonnaise, ketchup, chopped dill pickles and pickle juice to a small mixing bowl and combine.", "To make the wraps nice and soft, microwave your tortillas for 15-20 seconds so they’re soft and slightly warm.", "Top each wrap with shredded iceberg lettuce, 1 cooked burger cut in half going the length of the wrap, Big Mac sauce, finely chopped white onion, pickles and wrap it up and enjoy."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Use any preferred tortillas to wrap with. Low carb, high fiber or just use lettuce!", "To lower fat content, use ground turkey, ground chicken or lean ground beef, seasoned with burger seasoning. Add ground cooked beef to your wrap.", "Use any frozen burgers like chicken, veggie, black bean or turkey in place of beef.", "Add extra veggies like tomatoes."], "nutrition": null, "url": "https://ohsnapmacros.com/big-mac-wraps/"}
{"title": "Creamy High Protein Cottage Cheese Scrambled Eggs", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢2largeeggs", "▢6Tbsp.liquid egg whites92g", "▢1/4cuplow-fat cottage cheese55g", "▢pinch of salt", "▢fresh cracked pepper", "▢garlic powder (optional)", "▢olive oil cooking spray"], "instructions": ["Whisk eggs, egg whites, cottage cheese, salt, and black pepper in a small mixing bowl until well combined. If you prefer a smoother texture, you can blend in a blender or do the microwave method (see notes!) I also love adding a dash of garlic powder to mine.", "In a medium nonstick pan over medium heat, spray with cooking spray or grease with butter.  Carefully pour the egg mixture into the pan. Using a silicone spatula, cook and stir, scrambling the eggs gently until cooked through but still soft and creamy. Transfer to a plate and serve."], "notes": ["To make these eggs super smooth, add all ingredients to a high speed blender and then cook in the hot pan. This will ensure curd-free eggs.", "For an easy, take and go version, make these in the microwave. Add everything to a ramekin and add 1 Tbsp. of water. Whisk until fully combined, then whisk again. This will ensure the eggs are perfectly fluffy. Microwave for 4-5 minutes until the eggs are cooked through. Break up with a fork and stir everything together for delicious curd free cottage cheese eggs.", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/cottage-cheese-and-scrambled-eggs/"}
{"title": "High Protein Cottage Cheese Dessert Bowls (5 ways)", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢1/2cuplow-fat cottage cheese (Good Culture for best flavor)", "▢1single cupOikos Triple Zero Mixed Berry Yogurt5.3 oz. individual cup", "▢1sugar free vanilla pudding cup", "▢sliced fresh strawberries", "▢granola"], "instructions": ["Choose your bowl.", "Add base ingredients of cottage cheese, yogurt and pudding. If desired, use a blender to combine.", "Add remaining topping ingredients and enjoy."], "notes": ["Use any flavor of yogurt and desired toppings.", "Nutrition facts per bowl: the base is listed in the nutrition facts so you can add the toppings based on what works for you. Example: add 1/2 a graham cracker or 1 full if you have the room in your day.", "Chocolate Peanut Butter bowl with 1 Tbsp. PB: 332 calories 33P/25C/14F"], "nutrition": null, "url": "https://ohsnapmacros.com/cottage-cheese-dessert-bowls/"}
{"title": "Sweet and Savory Protein Pancake Tacos", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢1 1/4cupoat flour150g", "▢1cupnon-fat plain Greek yogurt224g", "▢1cupliquid egg whites250g", "▢2Tbsp.honey", "▢2tsp.vanilla extract", "▢2tsp.cinnamon"], "instructions": ["Mix all the pancake ingredients in a large bowl.", "Heat a pan over medium heat and spray with nonstick cooking spray.", "Heat up a large nonstick skillet or griddle over low to medium heat. Once hot, spray with nonstick cooking spray. Using a 1/4 cup as a scoop per pancake, add the batter to the hot pan. Cook for 3-4 minutes until small bubbles start to form on the outside. Flip and cook for another 1-2 minutes until golden brown. Repeat with all 12 pancakes.", "In a large mixing bowl whisk together, egg whites, eggs, water, salt and pepper. Scramble in a hot pan until cooked through.", "Top each pancake with ½ a piece of cooked turkey bacon, 28 grams scrambled eggs, 7 grams cheddar cheese and 1 Tbsp. maple syrup."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Use more liquid for thinner pancakes and less for thicker pancakes, depending on how you prefer your shell."], "nutrition": null, "url": "https://ohsnapmacros.com/pancake-tacos/"}
{"title": "High Protein Pasta Salad", "servings": "6", "prep_time": null, "cook_time": null, "ingredients": ["▢8oz.Chickpea Rotini pastaBanza", "▢1/2red bell pepper, chopped110g", "▢1/2English cucumber, chopped135g", "▢1.5cupsbrocolli florets, finely chopped125g", "▢1cupcherry tomatoes, chopped145g", "▢1/4cupred onion, chopped", "▢1/4cupfresh parsley, chopped", "▢1/4cupfresh basil, chopped", "▢1.5oz.fat free feta cheese, crumbled", "▢2.25oz.can of sliced black olivesdrained", "▢salt and pepperto taste"], "instructions": ["Cook the noodles according to the package instructions. When it comes to chickpea pasta I error on the lesser of the time frame given on the box. Overcooked chickpea pasta crumbles easily and can get mushy.", "Combine the olive, red wine vinegar, dijon, garlic, salt and pepper in a container and whisk together well to combine. Set aside.", "Once the noodles are cooked and drained, rinse with cold water and add to a large mixing bowl. Add the chopped vegetables, herbs, cheese, and dressing. Mix to combine everything thoroughly. Store in the refrigerator for at least 30 minutes before serving to let the flavors develop. Season with salt and pepper to taste."], "notes": ["All nutrition facts are an estimate.", "You can use any type of pasta noodle.", "If your pasta salad has dried out the next day, add a touch of olive oil."], "nutrition": null, "url": "https://ohsnapmacros.com/high-protein-pasta-salad/"}
{"title": "Creamy Chocolate Protein Smoothie with Greek Yogurt", "servings": "1", "prep_time": null, "cook_time": null, "ingredients": ["▢3/4cupnon-fat Greek yogurt", "▢1/2cupunsweetened vanilla almond milk", "▢1scoopchocolate protein powderPEScience", "▢1 1/2tsp.cocoa powder", "▢1tsp.honey"], "instructions": ["Mix everything together in high-speed blender.", "Pour in a glass and top with desired toppings."], "notes": ["Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/chocolate-protein-smoothie/"}
{"title": "Greek Yogurt Banana Bread with Chocolate Chips", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢1 1/2cupsripe mashed bananas310g", "▢1/2cupnonfat plain Greek yogurt112g", "▢1/4cupunsweetened applesauce63g", "▢1/4cuphoney75g", "▢1/4cuplight brown sugar53g", "▢1egg", "▢1tsp.vanilla extract", "▢1 1/2cupswhole wheat flour228g", "▢1tsp.baking soda", "▢1/4tsp.salt", "▢1/2tsp.ground cinnamon", "▢1/2cupsemi-sweet chocolate chips90g"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit and prepare a 9×5-inch loaf pan with non-stick cooking spray or line it with parchment paper.", "In a large mixing bowl, combine the mashed bananas, Greek yogurt, applesauce, honey, light brown sugar, egg, and vanilla extract.", "In a separate bowl, combine the whole wheat flour, baking soda, salt, and cinnamon and whisk together to combine.", "Gradually add the dry ingredients to the wet ingredients, stirring until just combined. Be careful not to overmix as it can result in a dense bread. Gently fold the chocolate chips into the batter.", "Pour the batter into the prepared loaf pan, smoothing the top with a spatula.", "Bake for 50-60 minutes, or until a toothpick inserted into the center comes out clean or with a few moist crumbs. If the top is browning too quickly, you can cover the bread with aluminum foil towards the end of baking.", "Allow the banana bread to cool in the pan for about 10 minutes before transferring it to a wire rack to cool completely."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "For exact grams per serving: weigh your final loaf and divide by 12 or cut into 12 equal slices.", "Swap chocolate chips for white chocolate, peanut butter chips or butterscotch for a fun new banana bread flavor."], "nutrition": null, "url": "https://ohsnapmacros.com/greek-yogurt-banana-bread/"}
{"title": "10+ Low-Calorie Cookies", "servings": null, "prep_time": null, "cook_time": null, "ingredients": [], "instructions": [], "notes": [], "nutrition": null, "url": "https://ohsnapmacros.com/low-calorie-cookie-recipes/"}
{"title": "Easy Cookies and Cream Protein Shake (4 ingredients)", "servings": "2", "prep_time": null, "cook_time": null, "ingredients": ["▢2scoopsVanilla Protein PowderPEScience Gourmet Vanilla (62g)", "▢1cupnonfat plain Greek yogurt112g", "▢1.5cupsunsweetened Vanilla almond milk360ml", "▢4Oreo thin cookies"], "instructions": ["Add the almond milk, protein powder and yogurt to the blender or even just a simpleblender ball cupwith a good blender ball and blend until smooth! Since there are no hard ingredients in this recipe you can really make this on the go in a cup without any issues at all.", "Add the Oreos and pulse to slightly break up or mix in your blender ball cup. If using a cup be sure to crunch the Oreos up nice and small or keep them large if you want it chunky.", "Pour between two glasses or travel cups and top with remaining Oreos, whipped cream, and enjoy!", "This recipe can be halved to make one shake. Just half the ingredients. You can make this directly in a blenderball shaker cup for a easy on the go shake."], "notes": ["Powdered peanut butteror almond butteradded to the cookies and cream shake for a peanut butter chocolate cookie flavorwould be awesome. There’s even achocolate-flavored powdered peanut butterthat would be A++ in this!", "Cocoa powder or chocolate chips!Add in some cocoa powder for an extra chocolatey flavor or chocolate chips.", "Mint extractor mint-stuffed Oreosfor mint chocolate or even skip the Oreos and use a couple of chocolate graham cracker sheets, YUM!!", "Add ice creamfor a true milkshake flavor! Add a scoop or two of carb-smart ice cream to keep the carbs low OR use yourNinja Creamicreations for a cookies and cream protein milkshake.", "Have you tried myWhite Chocolate Cranberry Oatmeal Cookiesyet?They’re my favorite soft-baked delicious cookies and would be the best addition to this cookies and cream shake.", "Granola!!Any of my granolas would be a great addition to this shake but definitely check out theSmore’s granolafor adding on top or mixed in.", "For some added fiber toss in some chia seeds!They’ll just add extra texture to this cookies and cream protein shake.", "Cereal!Add it to the blender with the ingredients or top the shake with your favorite cereal for a crunch! For extra protein useMagic Spoon Chocolate cereal.", "If you want to thicken this shake upwhile keeping the creamy texture and add a bit of a milkshake flavor to this cookies and cream protein shake, addxanthan gumwhich works to thicken."], "nutrition": null, "url": "https://ohsnapmacros.com/cookies-and-cream-protein-shake/"}
{"title": "Mini Strawberry Cheesecakes with Greek Yogurt", "servings": "12", "prep_time": null, "cook_time": null, "ingredients": ["▢2.7oz.graham crackers5 sheets", "▢2Tbsp.coconut oil or buttermelted"], "instructions": ["Preheat the oven to 325 degrees Fahrenheit and line a muffin tin with cupcake liners and spray with nonstick spray. In a food processor, crumble the graham crackers until well crushed and you have a bowl of fine crumbs.", "Pour in the melted coconut oil or butter and pulse to combine. The mixture should resemble wet sand.", "Evenly split the graham cracker crust in the bottom of each liner in the muffin pan and press firmly into the bottom.  Bake for 6-10 minutes or until the edges begin to brown. Allow to cool while making the cheesecake filling.", "To make the cheesecake filling, in a large bowl beat the less-fat cream cheese and sugar until light and fluffy with a hand or electric mixer, about 3-5 minutes. The sugar should not be grainy at this point but well incorporated into the cream cheese.", "Mix in the greek yogurt, vanilla extract, and flour until incorporated.", "Slowly beat in the large egg, just until combined. Do not overmix your cheesecake batter.", "Using a large cookie scoop (1.5 Tbsp.) place one scoop of the cheesecake filling in each prepared and cooled crust using the cookie scoop. Evenly distributed between all 12 muffin tins.", "Top each filling with 1 tsp. strawberry jam and swirl into the cheesecake filling with a small spoon or toothpick being carful not to move the crust.", "Bake cheesecakes for 14-16 minutes or until the edges are set and the middle slightly wobbles.", "Allow the mini cupcakes to cool to room temperature, cover with plastic wrap, and refrigerate for 2 hours or overnight for best results.", "When ready to serve, top each with an additional 1 tsp. of jam, freshly sliced strawberries and serve."], "notes": ["Nutritional information is an estimate and will vary with substitutions.", "Refrigerate at least 2 hours but overnight is best, to really let the cheesecake settle."], "nutrition": null, "url": "https://ohsnapmacros.com/mini-strawberry-cheesecakes/"}
{"title": "Banana Cream Cottage Cheese Waffles", "servings": "7", "prep_time": null, "cook_time": null, "ingredients": ["▢1ripebanana117g", "▢1/2cupcottage cheese (2% or 5%)110g", "▢1Tbsp.honey", "▢1scoopprotein powder", "▢2eggs", "▢1/2cupall-purpose flour", "▢1/4cupmilk (dairy or non-dairy)", "▢pinch of salt"], "instructions": ["Add all ingredients to a high speed blender and blend until smooth.", "Heat a small single waffle waffle maker and spray with nonstick spray. Add ¼ cup of the waffle batter to the waffle maker and cook until cooked through and browned. Repeat with the remaining waffle mix."], "notes": ["I find the waffles crisp up better if I do not spray the waffle maker each time. It also helps to toast them after if you want extra crispy waffles. 5% cottage cheese for fuller richer flavor.", "Using PEScience gourmet vanilla protein powder.", "Nutritional information is an estimate and will vary with substitutions."], "nutrition": null, "url": "https://ohsnapmacros.com/cottage-cheese-waffles/"}
