{"url": "https://ohsnapmacros.com/", "title": "Macro Friendly Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/newsletter/", "title": "Newsletter - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/fall-favorites/", "title": "Fall Favorites Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/about/", "title": "About - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/all-recipes/", "title": "Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/breakfast/", "title": "High-Protein Healthy Breakfast Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/lunch/", "title": "High-Protein Lunch Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/dinner/", "title": "Easy High Protein Dinner Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/sides-appetizers/", "title": "Healthy Sides and Appetizers - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/meal-prep/", "title": "High-Protein Meal Prep - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/desserts/", "title": "Macro Friendly Desserts - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/cookies/", "title": "Cookies Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/cottage-cheese-recipes/", "title": "Cottage Cheese Recipes Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/sauces-and-seasonings/", "title": "Sauces & Seasonings - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/chicken-recipes/", "title": "High Protein Chicken Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/beef-recipes/", "title": "High Protein Beef Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/turkey-recipes/", "title": "High Protein Turkey Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/pork-recipes/", "title": "Pork Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/seafood/", "title": "High Protein Seafood Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/gluten-free-recipes/", "title": "Gluten-Free Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/dairy-free-recipes/", "title": "Dairy-Free Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/christmas-recipes/", "title": "Christmas Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/valentines-day-recipes/", "title": "Valentine's Day Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/easter-recipes/", "title": "Easter Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/cinco-de-mayo-recipes/", "title": "Cinco de Mayo Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/mothers-day-recipes/", "title": "Mother's Day Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/fathers-day-recipes/", "title": "Father's Day - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/4th-of-july-recipes/", "title": "4th of July Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/labor-day-recipes/", "title": "Labor Day Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/memorial-day-recipes/", "title": "Memorial Day Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/thanksgiving-recipes/", "title": "Thanksgiving Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/summer-favorites/", "title": "Summer Favorites - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/spring-favorites/", "title": "Spring Favorites - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/winter-favorites/", "title": "Winter Favorites - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/pumpkin-recipes/", "title": "Pumpkin Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/meal-plans/", "title": "Meal Plans - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/cookbook/", "title": "Cookbook - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/discount-codes/", "title": "Discount Codes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/shop/", "title": "Products Archive - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/cart/", "title": "Cart - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/lasagna-pasta-skillet/", "title": "Lazy Lasagna Skillet with Ground Beef (No Raviolis) - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "15 minutes", "cook_time": "15 minutes", "ingredients": ["lean ground beef", "white onion, chopped", "minced garlic", "salt", "black pepper", "Italian seasoning", "dried basil", "tomato basil pasta sauce", "beef broth", "rigatoni noodles", "low moisture part skim mozzarella cheese", "part skim ricotta cheese", "fresh chopped basil", "parmesan cheese", "additional ricotta cheese"], "instructions": ["Bring a pot of water to a boil for cooking the pasta according to the directions on the box.", "While waiting on the water to boil, heat a large pan over medium heat and brown the ground beef while breaking into bite size pieces.", "When the meat is almost completely cooked through, stir in the chopped onion, garlic, salt, pepper, Italian seasoning and dried basil. Cook until fragrant and the onions are beginning to soften, approximately 3-5 minutes.", "Stir in the marinara sauce and beef broth and set to simmer while you cook the pasta noodles. Add the uncooked pasta to boiling water and boil according to the box instructions (about 13 minutes).", "Once pasta is cooked, drain and add to the pan with the meat sauce. Let simmer for 2-3 minutes while mixing the noodles in well to fully combine.", "Add the mozzarella and stir together until fully melted. While the lasagna is still hot add the ricotta cheese on top and slightly mix throughout the dish.", "Top with freshly chopped basil, parmesan cheese and enjoy."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/starbucks-spinach-and-feta-wraps/", "title": "High-Protein Spinach and Feta Wraps (Starbucks Copycat) - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "6 minutes", "cook_time": "10 minutes", "ingredients": ["Joseph's Bakery Lavash (or favorite tortilla)", "oil from sun-dried tomato", "spinach", "sun-dried tomato in oil, chopped", "liquid egg whites *", "garlic powder", "dried oregano", "salt", "pinch of black pepper", "Laughing Cow Swiss cheese triangle", "feta cheese, crumbled"], "instructions": ["Spray a large frying pan with cooking spray and set to medium heat. Add the oil from the sun-dried tomatoes. Once warm, add the baby spinach and sauté until wilted. Stir in the sun-dried tomatoes, garlic powder, oregano, salt and black pepper.", "Pour the egg whites over the spinach mixture. Stir to combine and then let it sit to cook through as if making an omelet lifting the sides to allow any liquid to be cooked (great time to add in some cooked crumbled sausage for added protein!). Top with the feta cheese, cover and let cook while prepping your wrap.", "If your lavash is too hard, microwave the lavash for 5-10 seconds to make it more pliable, if it is soft do not microwave. DO NOT overcook the wrap or your hot eggs will make the lavash crack and break. Spread the laughing cow cheese along the lavash.", "Remove the lid from your eggs and place the cooked eggs on top of the lavash and begin folding like a burrito with the sides sealed. Spray the burrito with cooking spray on both sides then place back in the hot skillet and sear to brown all sides.", "Once browned, cut in half and enjoy your copycat wrap right from the comfort of your own home!"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/big-mac-casserole/", "title": "Big Mac Casserole - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "15 minutes", "ingredients": ["lean ground beef", "russet potatoes", "white onion", "water", "olive oil", "yellow mustard", "garlic powder", "onion powder", "shredded cheddar cheese", "mayonnaise", "ketchup", "dill pickles", "dill pickle juice", "vine tomato", "handful white onions", "handful shredded iceberg lettuce", "dill pickle chips"], "instructions": ["Preheat the oven to 375 degrees Fahrenheit. Wash and chop your potatoes, leaving the skin on, into small bite size pieces. The smaller the better.", "Heat a pan over medium heat on the stove and add the olive oil to the pan. Add potatoes to the hot oil and 1/4 cup of water. Season the potatoes generously with salt and pepper and cook until they begin to soften, stirring often so you do not burn the bottoms. This could take anywhere from 5 to 10 minutes depending on the size of your potato chunks. Once the potatoes have softened, place them in the baking dish.", "In the same pan you cooked the potatoes, add the ground beef and onions. Cook until the ground beef is mostly cooked through and the onions have softened. Season with salt, pepper, garlic powder, onion powder and mustard. Stir to combine well. Add the cooked beef mixture to the potatoes in the baking dish and mix together.", "Top the potato and beef mixture with shredded cheddar cheese and cover with foil. Place in the oven for 15 minutes until the cheese has melted.", "While the casserole bakes make you big mac sauce. Combine mayonnaise, ketchup, chopped pickles and pickle juice and stir to combine. Place in the fridge until ready to add to your casserole.", "When the casserole is done baking, remove from the oven and remove the foil. Top with the big mac sauce drizzled across the top (use it all!), shredded lettuce, chopped white onion, chopped tomatoes and full pickle chips. Serve and enjoy!"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/taco-mac-and-cheese/", "title": "High Protein Taco Mac and Cheese - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["lean ground beef", "Taco Seasoning", "Banza Chickpea Pasta Elbows", "red bell pepper, chopped", "low fat cottage cheese", "medium spice salsa", "whole milk", "mild cheddar cheese", "reduced fat sharp cheddar cheese", "all-purpose flour", "salt", "onion powder", "garlic powder", "smoked paprika", "chili powder", "ground cumin", "water"], "instructions": ["Bring a large pot of water to a boil and cook the elbow macaroni according to the package directions.", "While the noodles cook start browning your meat in a large skillet over medium heat breaking it down into bite-sized pieces as you cook it.", "While the meat browns combine all taco seasonings in a small bowl with the water to create a paste. Once browned add the taco seasoning to the meat and reduce to a simmer. Add the chopped bell peppers and let simmer for 5 minutes stirring often.", "Using an immersion blender, food processor, or blender, blend the cottage cheese so that it is completely smooth. Once smooth add the salsa, milk, and flour and mix together well to combine.", "Add the cottage cheese sauce, mild cheddar and sharp cheddar cheese to the pan with the meat mixture. Mix together to completely melt the cheese and evenly combine.", "Drain the noodles from the water and add the cooked pasta to the large skillet with the meat and cheese mixture. Mix together well. Top with chopped cilantro and enjoy!"], "ratings": "4.99"}
{"url": "https://ohsnapmacros.com/pork-chili/", "title": "Stovetop Pork and Beef Chili with Pumpkin Puree - Oh Snap Macros", "author": "Danielle Lima", "servings": "7", "prep_time": "10 minutes", "cook_time": "1 hour", "ingredients": ["olive oil", "ground pork", "ground beef (96/3)", "fresh garlic", "red bell pepper", "green bell pepper", "yellow onion", "chili powder", "ground cumin", "paprika", "salt", "low sodium beef broth", "fire roasted tomatoes (14.5 oz. each)", "tomato paste", "pumpkin puree", "Bush's Pinto Chili Beans, with sauce"], "instructions": ["Heat a large dutch oven or soup pot over medium heat. Add the olive oil, pork and beef and cook, breaking into bite-size pieces. When halfway cooked, add the garlic, red and green bell pepper and onion and continue cooking and stirring until the meat is browned through.", "Add the chili powder, cumin, paprika, salt and stir to combine. Pour in the broth, tomatoes and tomato paste. Bring to boil and then lower to simmer, cover and simmer for 1 to 1 ½ hours to allow the flavors to meld. Stir every so often.", "Remove the lid and add the pumpkin puree and beans with the sauce to the chili and stir to combine. Simmer for an additional 15-20 minutes to heat through.", "When ready to serve, serve with chopped red onions, cilantro or green onions, cheese or on it’s own."]}
{"url": "https://ohsnapmacros.com/pumpkin-pasta/", "title": "30 Minute One Pot Pumpkin Pasta with Cottage Cheese - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "15 minutes", "ingredients": ["olive oil", "yellow onion, chopped", "garlic cloves, minced", "lean ground beef", "salt", "chipotle chili powder", "ground cumin", "dried rosemary", "fresh cracked pepper", "medium shell pasta", "low sodium beef broth", "water", "low-fat cottage cheese", "pumpkin puree", "cinnamon", "tomato paste", "fresh rosemary", "fresh basil", "fresh sage leaves", "Parmesan cheese"], "instructions": ["Add the olive oil to a large skillet over medium heat. Add the onions and garlic and saute until the onion is translucent.", "Add the ground beef and cook, breaking into bite size pieces, until cooked through. Approximately 5 minutes. Add the salt, chipotle powder, cumin, rosemary and pepper. Stir to combine.", "Add the uncooked pasta, beef broth and water to the pan, stirring to submerge the pasta shells as best as possible. Bring to a boil and reduce to medium heat. Cook, stirring often for 12-14 minutes or until the pasta is cooked.", "Optional, add the cottage cheese, pumpkin puree, tomato paste and cinnamon to a blender and blend so the cottage cheese is smooth. Or, just add in chunky, I promise it doesn’t effect the taste or texture of the pasta.", "Add the cottage cheese, pumpkin puree, tomato paste and cinnamon directly to the pan with the pasta. Stir and cook for a few additional minutes to warm through and evenly coat the pasta shells.", "Adjust with salt and pepper to taste, serve and enjoy!"], "ratings": "4.67"}
{"url": "https://ohsnapmacros.com/cajun-meatball-stew/", "title": "Cajun Meatball Stew Recipe with Homemade Meatballs - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "15 minutes", "cook_time": "25 minutes", "ingredients": ["smoked paprika", "salt", "garlic powder", "onion powder", "dried oregano", "cayenne pepper", "fresh ground black pepper", "lean ground chicken", "Italian breadcrumbs", "egg", "garlic", "Cajun seasoning", "olive oil", "olive oil", "yellow onion", "celery", "garlic", "carrots", "low sodium beef broth", "diced tomatoes", "russet potatoes", "bay leaves", "Cajun seasoning", "salt and pepper", "fresh parsley"], "instructions": ["In a large mixing bowl, combine ground chicken, bread crumbs, egg, garlic and 2 tsp. Cajun seasoning. Mix meatball ingredients until just combined. Roll the mixture into 12 equal 2-inch meatballs, approximately 45 grams each. Set aside.", "In a large pot or Dutch oven, heat 1 tablespoon of olive oil over medium heat. Add the meatballs in batches, making sure not to overcrowd the pot. Brown meatballs on all sides, then remove them and set aside. They don't need to be fully cooked at this point.", "In the same pot, add the remaining tablespoon of olive oil. Add the diced onion, celery, and carrots. Sauté until the onions are translucent. Add the minced garlic and sauté for another minute.", "Pour in the beef broth and diced tomatoes (with their juices). Scrape the bottom of the pot with a wooden spoon to release any brown bits of meatball drippings. Bring the mixture to a simmer. Add the diced potatoes, bay leaves, and 2 tsp. Cajun seasoning (more for extra spicy). Stir well.  Gently add the meatballs back into the pot.", "Reduce the heat to low, cover, and let the stew simmer for about 20-25 minutes, or until the potatoes are tender and the meatballs are cooked through.", "Once cooked through, serve and top with fresh chopped parsley."], "ratings": "4.86"}
{"url": "https://ohsnapmacros.com/marry-me-chicken-pasta/", "title": "High-Protein Marry Me Chicken Pasta (58g of protein) - Oh Snap Macros", "author": "Danielle Lima", "servings": "5", "prep_time": "10 minutes", "cook_time": "15 minutes", "total_time": "25 minutes", "ingredients": ["Banza chickpea pasta shells", "boneless skinless chicken breasts, cubed", "Italian seasoning", "salt", "fresh cracked pepper", "oil from sun-dried tomatoes", "low-fat cottage cheese", "low-sodium chicken broth", "garlic powder", "oil from sun-dried tomatoes", "parmesan cheese, shredded 56g", "sun-dried tomatoes", "Italian seasoning", "salt", "fresh cracked pepper", "spinach, packed", "basil"], "instructions": ["Bring a pot of water to a boil and add the pasta shells, cook according to the package instructions. If using chickpea pasta, I like to undercook it by a minute so it doesn’t get mushy.", "Add the chicken, Italian seasoning, salt and pepper to a large mixing bowl. Mix to evenly coat the chicken.", "In a large pan over medium heat, add the oil from the sundried tomatoes. Once hot, add the chicken and cook on each side untouched for 3-4 minutes or until cooked through and no longer pink.", "While the chicken cooks, add the cottage cheese, broth, garlic powder and oil from the sundried tomatoes in a high speed blender and blend until smooth and the cottage cheese is no longer chunky or chalky, approximately 4-5 minutes.", "Add the cooked and drained pasta to the pan with the chicken. Lower the heat to low and add the blended cottage cheese sauce, parmesan cheese, sun-dried tomatoes, Italian seasoning, salt, and pepper. Stir to melt the cheese and heat the sauce over low heat to avoid clumping. You can also remove from the heat  prior to adding the sauce to be sure you do not cause any clumping!", "Add the spinach and stir to wilt. Serve topped with freshly chopped basil, parmesan cheese and adjust with salt and pepper, as needed."], "ratings": "4.50"}
{"url": "https://ohsnapmacros.com/category/soups-and-chilis/", "title": "Soups & Chilis Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/30-minute-meals/", "title": "30 Minute Healthy Recipes - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/pumpkin-banana-muffins/", "title": "Easy Banana Pumpkin Muffins (with no added sugar) - Oh Snap Macros", "author": "Danielle Lima", "servings": "12", "prep_time": "10 minutes", "cook_time": "19 minutes", "ingredients": ["all-purpose flour", "whole wheat flour", "baking powder", "baking soda", "salt", "ground cinnamon", "nutmeg", "pumpkin puree", "medium bananas, mashed", "eggs, room temperature", "honey", "vanilla extract", "melted coconut oil"], "instructions": ["Preheat your oven to 375 degrees. Line a muffin pan with a 12 muffin capacity with cupcake liners.", "Add the flours, baking powder, baking soda, salt, cinnamon, and nutmeg to a bowl. Whisk to combine.", "In a separate larger bowl, whisk together the pumpkin, mashed bananas, eggs, honey, vanilla, and melted coconut oil until smooth.", "Add the dry ingredients to the wet, mixing until just combined. You want to make sure there are no pockets of flour remaining in the batter.", "Divide the batter between the 12 lined muffin cups. You can do this with a large scoop or using a spoon just evenly distibute between the cups. Tap the pan on the counter a few times to help settle the batter, then place the pan in the preheated oven. Bake the muffins for 16-20 minutes or until the tops have risen and a toothpick or tester inserted into the center comes out clean.", "Cool the muffins in the pan for 5 minutes before moving them to a cooling rack."]}
{"url": "https://ohsnapmacros.com/pumpkin-brownies/", "title": "Chocolate Pumpkin Swirl Fudge Brownies - Oh Snap Macros", "author": "Danielle Lima", "servings": "16", "prep_time": "15 minutes", "cook_time": "35 minutes", "ingredients": ["granulated sugar", "eggs, room temperature", "vanilla extract", "unsalted butter, melted and cooled", "unsweetened cocoa powder", "salt", "baking soda", "sugar", "egg, room temperature", "pumpkin puree", "creamy peanut butter (or almond butter)", "all-purpose flour", "salt", "baking soda", "pumpkin pie spice"], "instructions": ["Preheat the oven at 350 degrees. Lightly grease an 8×8-inch pan and line it with parchment paper, leaving an overhand. This will make it easier to remove and slice the brownies later on.", "Start by making the chocolate brownie batter. Add the sugar, eggs, and vanilla extract to a medium sized bowl and whisk to combine.", "Slowly add in the melted butter, whisking as you go so that any residual warmth from the butter doesn’t scramble the egg.", "Once you’ve incorporated the butter, add the cocoa powder, salt, and baking soda to the bowl. Whisk until you have a smooth batter and there are no longer any pockets of dry ingredients remaining. Set the bowl aside and give your whisk a quick rinse.", "Make the pumpkin batter next. Add the sugar, egg, pumpkin puree, and peanut butter to a bowl and whisk until smooth. Add the flour, salt, baking soda, and pumpkin pie spice and whisk until just combined.", "Spread about two-thirds of the chocolate brownie batter on the bottom of the prepared pan in an even layer.", "Then, gently spread half of the pumpkin layer on top.", "Lastly, alternate placing dollops of the remaining pumpkin and brownie batters across the top of the surface. Gently swirl the dollops together with a butter knife or spoon, then tap the pan on the counter firmly a few times to help settle the batter.", "Bake the brownies in the preheated oven for 30-35 minutes or until a tester comes out with a few moist crumbs. Cool the brownies in the pan completely before slicing into 16 squares."], "ratings": "4.34"}
{"url": "https://ohsnapmacros.com/pumpkin-banana-cookies/", "title": "Pumpkin Banana Cookies (with chocolate chips) - Oh Snap Macros", "author": "Danielle Lima", "servings": "17", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["light brown sugar", "white sugar", "unsalted butter", "pumpkin puree", "vanilla extract", "mashed banana", "all-purpose flour", "cinnamon", "pumpkin spice", "baking soda", "salt", "Semi sweet chocolate chips"], "instructions": ["Preheat the oven to 400 degrees Fahrenheight and line a baking sheet with parchment paper.", "In a large mixing bowl, mix together the sugar, melted butter, pureed pumpkin, vanilla and mashed banana until smooth.Some banana chunks can remain.", "In a separate bowl, whisk together the flour, cinnamon, pumpkin pie spice, baking soda, and salt.", "Add the dry ingredients to the wet ingredients, mixing until just combined.", "Fold in the chocolate chips.", "Drop 1.5 Tbsp. spoonfuls of dough onto the prepared baking sheet. This recipes makes approximately 17 cookies with a 1.5 Tbsp. cookie scoop.", "Bake for 9-10 minutes or until the edges are lightly golden. Allow the cookies to cool on the baking sheet for a few minutes before transferring them to a wire rack to cool completely."], "ratings": "4.84"}
{"url": "https://ohsnapmacros.com/pumpkin-chocolate-chip-bread/", "title": "Easy Pumpkin Chocolate Chip Bread (High Protein) - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "10 minutes", "cook_time": "1 hour", "ingredients": ["pumpkin puree", "plain non-fat Greek yogurt", "unsweetened applesauce", "honey", "eggs", "pure vanilla extract", "whole wheat flour", "vanilla whey protein powder", "baking powder", "baking soda", "salt", "pumpkin pie spice", "dark chocolate chip morsels"], "instructions": ["Preheat your oven to 350 degrees fahrenheit and prepare a loaf pan with non-stick cooking spray or line it with parchment paper.", "In a large bowl, combine the pumpkin puree, Greek yogurt, applesauce, honey, eggs, and vanilla extract.", "In a separate mixing bowl, combine the whole wheat flour, protein powder, baking powder, baking soda, salt, and pumpkin pie spice.", "Gradually add the dry ingredients to the wet ingredients, stirring until just combined. Be careful not to overmix as it can result in a dense bread. Fold in the dark chocolate chips.", "Pour batter into the prepared loaf pan, smoothing the top with a spatula. Optional, top with additional chocolate chips", "Bake for 45-60 minutes, or until a toothpick inserted into the center comes out clean or with a few moist crumbs. After 30 minutes of baking I highly suggest tenting the top of the bread with foil and returning to the oven for the remainder of the time so the top of the bread doesn’t burn.", "Allow the pumpkin bread to cool in the pan for about 10 minutes before transferring it to a wire rack to cool completely or cutting right into it for warm melty chocolate pumpkin bread."], "ratings": "4.72"}
{"url": "https://ohsnapmacros.com/mediterranean-chopped-salad/", "title": "Mediterranean Chopped Chicken Salad with Greek Vinaigrette - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "20 minutes", "cook_time": "10 minutes", "ingredients": ["chicken tenderloins", "olive oil", "red wine vinegar", "lemon, juiced", "honey", "garlic powder", "dried oregano", "salt", "paprika", "fresh cracked pepper", "olive oil", "red wine vinegar", "garlic, minced", "dried oregano", "lemon juice", "paprika", "Dijon mustard", "salt", "fresh cracked pepper", "romaine lettuce, chopped, packed", "cherry tomatoes, chopped", "kalamata olives, chopped", "roasted red bell peppers, chopped", "cucumber, chopped", "fresh parsley, chopped", "crumbed feta cheese"], "instructions": ["Remove the tendons from the chicken tenderloins. The easiest way to do this it to grab the tendon with a paper towel and place it between the prongs of a fork and slide down while pulling with the paper towel. You can see a step by step visual in my baked chicken tenderloins recipe .", "Add the chicken tenderloins, oil, red wine vinegar, lemon juice, honey, garlic, oregano, salt, paprika and black pepper to a sealable container. Stir to submerge the chicken and cover in the marinade. Place in the fridge and let it marinate for at least 2 hours.", "In a mason jar or salad dressing container, comine the oil, red wine vinegar, garlic, oregano, lemon juice, paprika, dijon musard, salt and pepper and shake to combine. Place in the fridge until ready to use to let the flavors combine.", "When ready to cook the chicken, heat a pan over medium heat and spray with cooking spray. Remove the chicken from the marinade and add to the hot pan. Cook for 4-5 minutes on each side until cooked through and no longer pink.", "While the chicken cooks, prep the lettuce, tomato, olives, cucumber and parsley and chop into small pieces. We want everything in similar size pieces for the perfect chopped salad. Add to a large mixing bowl OR split into 4 meal prep containers (see notes for details).", "Chop the chicken and add to the bowl of veggies. Add the feta cheese and the vinaigrette and mix until fully combined. Serve immediately."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/dill-pickle-chicken-salad/", "title": "Dill Pickle Cottage Cheese Chicken Salad - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "10 minutes", "cook_time": "0 minutes", "total_time": "39 minutes", "ingredients": ["cooked, shredded rotisserie chicken (no skin)", "non-fat plain Greek yogurt", "light mayonnaise", "low fat cottage cheese", "olive oil", "pickle juice, from the jar", "yellow mustard", "garlic powder", "onion powder", "salt", "fresh cracked pepper", "dill pickles, finely chopped", "red onion, finely diced", "celery, finely chopped"], "instructions": ["In a high speed blender, add the Greek yogurt, light mayonnaise, cottage cheese, olive oil, pickle juice, mustard, garlic powder, onion powder, salt and pepper and blend until smooth. You may need to use a spatula to scrape down the sides. We just want to be sure the cottage cheese fully blends.", "Add the shredded chicken, dill pickles, red onion, and celery to the bowl. Top with the dressing. Stir until everything is evenly coated.", "Cover and refrigerate for at least 30 minutes to let the flavors meld. Adjust with salt, pepper or additional pickle juice as needed.", "Serve in lettuce wraps, folded in pitas, in whole-grain wraps, with crackers, or as a sandwich filling."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/blueberry-overnight-oats/", "title": "Blueberry Protein Overnight Oats with Chia Seeds - Oh Snap Macros", "author": "Danielle Lima", "servings": "2", "prep_time": "10 minutes", "cook_time": "0 minutes", "total_time": "6 hours", "ingredients": ["fresh or frozen wild blueberries", "honey (or sweetener of choice)", "lemon juice", "chia seeds", "unsweetened vanilla almond milk (any kind of milk)", "old-fashioned oats", "plain nonfat greek yogurt", "vanilla protein powder, PEScience", "honey (or maple syrup)", "chia seeds", "fresh or thawed blueberries", "sprinkle of granola or nuts"], "instructions": ["In a small saucepan over medium heat, add the blueberries, honey, and lemon juice. Cook, stirring occasionally, until the blueberries start to break down and release their juices (about 3-5 minutes). Use a fork or potato masher to gently mash the blueberries to your desired consistency. Remove from heat and stir in the chia seeds. Let the mixture cool and thicken while you prep your oats.", "Add ¾ cup almond milk, ¼ cups oats, ¼ cup greek yogurt, 1 scoop vanilla protein powder, 1 Tbsp. honey, and 1 Tbsp. of chia seeds to each of the 2 mason jars or containers. Stir or shake until fully combined.", "Split the blueberry mixture between the two jars and stir in. Cover the jars and refrigerate for at least 6 hours or overnight to allow the oats to soften, the mixture to thicken and flavors to meld.", "Before serving, top the oats with extra blueberries, granola or nuts for texture."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/brownie-bites/", "title": "100 Calorie Fudgy Brownie Bites - Oh Snap Macros", "author": "Danielle Lima", "servings": "24", "prep_time": "10 minutes", "cook_time": "15 minutes", "ingredients": ["granulated sugar", "light brown sugar", "eggs", "vanilla extract", "unsalted butter", "semi-sweet chocolate chips", "unsweetened cocoa powder, Hershey's", "all-purpose flour", "salt", "mini chocolate chips, optional topping"], "instructions": ["Grease a mini muffin tin well with butter or nonstick spray. Preheat oven to 325 degrees F.", "Add the granulated sugar, brown sugar, eggs and vanilla in a large mixing bowl. Using a hand mixer or stand mixer, beat the eggs and sugar on medium high speed until thickened – about 3 to 4 minutes.", "In a seperate bowl, melt the butter in the microwave until just melted. Add the chocolate chips and cocoa powder and stir together until mixed, it is ok if some chip remain.", "Pour the chocolate mixture into the thickened eggs and sugar. Stir together with a spoon or spatula until well incorporated.", "Fold the flour and salt into the wet ingredients until no dry flour remains.", "Using a cookie scoop, scoop the batter evenly into the prepared 24 capacity mini muffin tin. Sprinkle approximately ½ teaspoon mini chocolate chips on top of each brownie (optional).", "Bake the brownie bites for 13-15 minutes, until the edges are set.**", "Allow the brownies to cool completely before removing them from the pan. When completely cooled, twist the brownie bites gently and they should lift out easily."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/high-protein-overnight-oats/", "title": "High Protein Overnight Oats (Vanilla and Chocolate) - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "3 minutes", "cook_time": "1 minute", "total_time": "8 hours", "ingredients": ["unsweetened vanilla almond milk", "old fashioned oats", "plain nonfat Greek yogurt", "vanilla protein powder (PEScience)", "honey", "chia seeds", "unsweetened vanilla almond milk", "old fashioned oats", "plain nonfat Greek yogurt", "chocolate protein powder (Pescience)", "honey", "chia seeds", "unsweetened cocoa powder"], "instructions": ["Add everything to a mason jar or sealable container, shake, and let sit in the refrigerator overnight.", "When ready to enjoy remove from the fridge, stir and enjoy cold.", "Optional, you can add additional almond milk if you like a thin consistency and your favorite toppings like fresh sliced fruit, chopped nuts and an extra dollop of Greek yogurt.", "It is important to note that using a different protein powder will result in different texture results! If you're not using a whey casein blend then you may need to recude the almond milk to 1/2 cup as it will not get as thick as a whey casein blend does."], "ratings": "4.17"}
{"url": "https://ohsnapmacros.com/breakfast-burrito-bowls/", "title": "High Fiber Breakfast Burrito Bowls with Cauliflower Rice - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "5 minutes", "cook_time": "15 minutes", "ingredients": ["lean ground turkey", "Taco Seasoning", "orange bell pepper", "small red onion", "garlic clove", "frozen riced cauliflower", "fresh cilantro", "lime, juiced", "black beans", "salt", "onion powder", "garic powder", "smoked paprika", "chili powder", "cumin", "water"], "instructions": ["Heat a pan over medium, spray with cooking spray and add the ground turkey. Using a spatula break the turkey into bite size pieces as it cooks. Cook until it is fully cooked through and no longer pink in the center approximately 5 minutes.", "While the turkey cooks add all the taco seasonings to a small bowl. Top with the water and mix to form a paste. Add the paste to the cooked turkey, mix together well to combine and turn the heat to low. Let the turkey cook in the seasonings for a few minutes while you prep the vegetables.", "Remove the cooked turkey from the pan and set aside. Spray the pan with non stick cooking spray and add the garlic, bell pepper and onion to the pan. Let the veggies saute over medium heat, stirring often so they do not burn, while you prepare the cauliflower rice.", "Cook the cauliflower according to the package instructions. Remove from the bag and add to a bowl. Combine with the chopped cilantro and lime juice and mix together well.", "Assemble your breakfast burrito bowls. Top with eggs if desired or turn into a salad over  a bed of lettuce. Egg is not included in the nutrition facts, see notes.", "Approximate measurements per bowl. Turkey Meat – 114 grams, Black Beans – 53 grams, Peppers & Onions – 55 gram, Cauliflower Rice – 67 grams"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/chicken-lettuce-wraps-with-peanut-sauce/", "title": "Peanut Chicken Lettuce Wraps with Low-Fat Sauce - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["lean ground chicken", "PB2 powdered peanut butter", "water", "ground cinnamon", "lite pancake syrup", "coconut aminos", "red curry paste", "garlic", "red pepper flakes", "living butter lettuce", "bell peppers", "carrots", "cucumber", "chopped peanuts", "green onions", "limes"], "instructions": ["In a medium bowl combine the peanut sauce ingredients, mix until well combined and set aside.", "Spray a large skillet over medium heat with nonstick cooking spray. Add the ground chicken and cook, breaking into bite sized pieces until cooked through, approximately 5 minutes.", "Once cooked through lower the heat to low and add ¼ cup of the peanut sauce (64g) mixing to evenly coat the chicken. Let the chicken simmer while you prepare you lettuce wraps.", "Evenly split the cooked chicken between each piece of lettuce, with desired add-ins like bell pepper, cucumber and carrots. Top with 2 tbsp. peanut sauce (approx 30g) and chopped green onions and peanuts."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/big-mac-bowls/", "title": "Big Mac Burger Salad Bowl (meal prep favorite) - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "5 minutes", "cook_time": "10 minutes", "ingredients": ["lean ground beef", "onion", "yellow mustard", "garlic powder", "onion powder", "salt and black pepper", "light mayonnaise", "ketchup", "dill pickles", "pickle juice", "shredded iceberg lettuce", "shredded cheddar cheese", "chopped white onion", "pickles", "chopped red onion", "chopped tomato", "side of fries"], "instructions": ["Spray a large skillet over medium heat with nonstick spray. Add the ground beef and onion and cook until the beef is cooked through and no longer pink, breaking into bite sized pieces.", "Add the garlic powder, onion powder, salt, pepper and mustard to the beef and stir to combine. Let simmer while you make your sauce.", "In a small mixing bowl, combine the mayonnaise, ketchup, pickles and pickle juice and mix to combine.", "Assemble your bowls and enjoy!", "Fill each bowl with 2 cups shredded iceberg lettuce, 100 grams of meat mixture, 14 grams (appromiately 2 tbsp.) cheddar cheese, ¼ cup (58g) Big Mac sauce, chopped onions and additional pickles.", "Layer meat first and top with parchment paper. Top with the lettuce, onions and cheese. Either add the pickles or place on a separate small parchment paper so they don’t make the lettuce soggy. Put the sauce in the small tupperware bowl to bring on the side. Remove the salad portion and heat the meat directly in the dish and then mix your bowls. Or enjoy cold too!"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/sheet-pan-harissa-chicken-with-tahini-yogurt-sauce/", "title": "Sheet Pan Harissa Chicken with Tahini Yogurt Sauce - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "15 minutes", "cook_time": "35 minutes", "ingredients": ["boneless skinless chicken breast", "harissa sauce (paste), mild", "lemon", "salt", "garlic powder", "ground cumin", "granulated onion or onion powder", "fresh cracked pepper", "cauliflower", "green olives", "red onion", "garbanzo beans, drained and rinsed", "olive oil", "garlic powder", "paprika", "salt", "chili powder", "ground cumin", "lime juice", "tahini", "nonfat plain Greek yogurt", "lime juice", "garlic powder", "salt", "water", "fresh parsley", "lemon wedges"], "instructions": ["Heat oven to 425 degrees Fahrenheit. Spray a large baking sheet with nonstick spray.", "Add the sliced chicken to a large mixing bowl. Add the harissa paste, lemon juice, salt, garlic, granulated onion, cumin, and pepper. Stir to combine and fully coat the chicken. Place in the fridge to marinate while you prepare the vegetables.", "In another large bowl, combine the chopped cauliflower, olives, red onion, garbanzo beans, oil, garlic powder, salt, paprika, chili powder, cumin and lime juice. Mix to combine.", "Add the seasoned veggies to the sheet pan. Remove the chicken from the refrigerator and add to the sheet pan nestling into the veggies throughout the pan, pour any excess sauce and seasonings on top. Place in the preheated oven for 30 minutes until the chicken is cooked through. Optional, you can broil for an extra 3-5 minutes for a little crisp on top.", "While the chicken and veggies cook, make the sauce. Combine the tahini, greek yogurt, lime juice, garlic powder, salt and water and mix to combine. Add additional water if you desire a thinner consistency but note this will thin out when mixed with the hot dish.", "Remove the sheet pan from the oven, stir to mix in the juices and serve topped with the sauce and fresh parsley or lemon wedges."]}
{"url": "https://ohsnapmacros.com/sausage-kale-and-white-bean-soup-stovetop/", "title": "Sausage Kale and White Bean Soup (stovetop) - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "40 minutes", "ingredients": ["mild Italian Sausage Links, casings removed", "garlic", "yellow onion", "chicken bone broth", "Northern White Beans, rinsed and drained", "Italian seasoning", "salt", "chipotle powder", "low fat cottage cheese", "chopped kale", "shredded zucchini"], "instructions": ["Heat a large dutch oven or large soup pot over medium high heat and spray with cooking spray. Add the sausages by removing from the casings. I like to squeeze it out of the ends directly into the pot. Break the sausage into bite size pieces and let it brown before stirring. Stir until cooked through, approximately 5 minutes.", "Once browned, remove the sausage from the pot and set aside using a slotted spoon. Add the garlic, onion and a splash of the bone broth and cook, stirring often, until the onions are translucent.", "Add the sausage back to the pot along with the remaining broth, beans, Italian seasoning, salt and chipotle powder. Bring the soup to a boil and then lower the heat to simmer. Simmer uncovered for 30 minutes to allow the flavors to meld together.", "Add the cottage cheese directly to the hot soup and stir or whisk to combine. Don't worry about the chunks, they'll eventually melt away. This helps the soup thicken some.", "Finally, stir in the kale and zucchini and simmer until heated through and the kale has wilted, approximately 3-5 minutes.", "Serve topped with grated parmesan or red pepper flakes for some added heat and enjoy!"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/biscoff-protein-overnight-oats/", "title": "Biscoff Protein Overnight Oats - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "5 minutes", "ingredients": ["unsweetened vanilla almond milk", "protein powder, 31g", "chia seeds, 15g", "old-fashioned oats, 20g", "Biscoff cookie, crumbled", "Biscoff cookie butter spread, 15g"], "instructions": ["Add the almond milk and protein powder to a mason jar or oats container and combine until mixed well. Mix in the chia seeds until combined. Add the oats and cookie crumbles and mix to combine.", "Heat the Biscoff spread in a small bowl in the microwave to melt and soften so it’s pourable. Add the melted cookie butter over the top of the oats inside the jar and swirl into the top. Seal and place in the fridge to set overnight.", "When ready to enjoy, remove and stir together or top with additional cookie crumbles or Greek yogurt."]}
{"url": "https://ohsnapmacros.com/easy-high-protein-cottage-cheese-recipes/", "title": "Easy High Protein Cottage Cheese Recipes - Oh Snap Macros", "author": "Danielle Lima", "servings": "12", "prep_time": "30 minutes", "cook_time": "1 hour", "ingredients": ["olive oil", "garlic", "yellow onion", "lean ground beef", "oregano", "Italian seasoning", "paprika", "chili powder", "salt", "black pepper or fresh cracked", "jar of marinara sauce", "low fat small curd cottage cheese", "eggs", "parmesan cheese", "oregano", "Italian seasoning", "salt", "fresh cracked pepper or pinch of black pepper", "frozen spinach", "oven ready lasagna noodles", "low moisture mozzarella cheese"], "instructions": ["Pre-heat the oven to 375 degrees Fahrenheit. Heat oil in a large skillet over medium heat. Add the garlic and onions to the pan and cook until nice and browned, approximately 3-5 minutes.", "Add the ground beef to the pan and break into bite size pieces. Cook until fully cooked through, mixing often, approximately 5 minutes.", "Add the oregano, italian seasoning, paprika, chili powder, salt and pepper to the beef mixture and combine to evenly coat.", "Add sauce, combine and simmer while you prepare the cottage cheese filling.", "For the filling: combine the cottage cheese, eggs, parmesan cheese, oregano, Italian seasoning, salt and pepper and mix well to combine.", "Add the defrosted and strained spinach to the cottage cheese mixture and mix to combine.", "Spray a 9×13 inch baking dish with non stick cooking spray. Add a dollop of the meat mixture to the bottom of the dish to lightly coat the bottom. Top with 4 noodles, the noodles are the width of the baking dish (short side) not the length.", "Top the noodles evenly with ½ cup mozzarella cheese (56g), followed by half the meat mixture. Use a spoon or spatula to evenly spread the mixture over the noodles. Top the meat mixture with half the cottage cheese filling and spread to coat the top. Repeat with 4 noodles, ½ cup cheese, remaining meat mixture, remaining cottage cheese filling and 1 cup cheese on top.", "Place the baking dish on a baking sheet to catch any overflow. Cover the dish with foil, try to avoid touching the cheese on top so that it doesn’t stick to the foil. Bake for 50 minutes.", "Remove the foil and bake an additional 10-15 minutes until the cheese is melted and browned and the sauce is nice and bubbly at the edges.", "Top with freshly chopped parsley and cut into 12 equal servings and enjoy this easy lasagna recipe."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/whipped-feta-dip/", "title": "Sweet Heat Whipped Feta Dip with Cottage Cheese - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "10 minutes", "cook_time": "0 minutes", "total_time": "2 hours", "ingredients": ["feta cheese, block or crumbled", "low fat cottage cheese (drain excess water, if needed)", "lemon juice", "olive oil", "sea salt", "black pepper", "milk", "hot honey", "chopped chives", "crushed red pepper flakes", "black pepper", "black sesame seeds"], "instructions": ["Add the feta, cottage cheese, lemon juice, olive oil, sea salt and black pepper to a food processor. Blend for 5 minutes until fully combined and smooth. Add the milk and blend again for another 3-5 minutes. This will help get that final smooth whip we want.", "Place the dip in the refridgerator to set for 2 hours prior to serving. The longer the better so it can thicken.", "Once thickened, pour the feta mixture into a serving dish.", "Drizzle the hot honey over the whipped feta and sprinkle the chives, red pepper flakes, sesame seeds and black pepper on top."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/dill-pickle-cottage-cheese-egg-salad/", "title": "Dill Pickle Cottage Cheese Egg Salad - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "5 minutes", "ingredients": ["hard boiled eggs, chopped", "low-fat cottage cheese", "honey mustard", "dill pickles, chopped", "green onions, chopped", "paprika, optional", "salt and black pepper to taste", "fresh chives, chopped", "fresh dill, chopped"], "instructions": ["Add everything to a mixing bowl and combine."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/cottage-cheese-spinach-dip/", "title": "Low Fat Cottage Cheese Spinach Dip - Oh Snap Macros", "author": "Danielle Lima", "servings": "11", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "2 hours", "ingredients": ["low-fat cottage cheese", "non-fat plain Greek yogurt", "frozen chopped spinach", "Knorr Vegetable Recipe Mix", "water chestnuts", "green onions", "garlic powder", "salt and black pepper"], "instructions": ["In a high-speed blender add the cottage cheese and Greek yogurt. Blend until smooth and no chalkiness from the cottage cheese remains approx 5 minutes.", "Remove the blade and add the remaining ingredients directly to the blender, this helps to ensure you get all the cottage cheese mixture out easier. Combine with a rubber spatula and transfer to a large bowl.", "Cover and refrigerate for 2 hours before serving. Adjust with salt and pepper or additional garlic powder to taste.", "Optional! You can add 1-2 tsp of honey to cut the taste of the Greek yogurt some if it’s too tart for you."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/cowboy-soup/", "title": "Cowboy Soup with Ground Beef, Beans and Potatoes - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "10 minutes", "cook_time": "20 minutes", "ingredients": ["olive oil", "lean ground beef", "medium onion", "garlic", "chili powder", "ground cumin", "salt", "pepper", "russet potatoes", "Rotel tomatoes", "frozen mixed vegetables", "Ranch Style Beans", "jalapeno", "Beef Broth"], "instructions": ["Over medium heat add 1 Tbsp. olive oil to the large dutch oven or soup pot. Once hot add the ground beef and break into pieces to cook. Cook over medium until almost completely cooked and no longer pink. Add onions and garlic to the pot and simmer until the onions begin to turn translucent. Stir often so the bottom does not burn.", "Add chili powder, cumin, salt and pepper to the meat and mix together well the combine. Add potatoes, rotel tomatoes, frozen veggies, beans with the juices, jalapeno and beef broth. Stir to combine and bring to a boil.", "Once boiling lower the heat to simmer and cook covered for 20 minutes until the potatoes are fork tender."], "ratings": "4.95"}
{"url": "https://ohsnapmacros.com/category/macros/", "title": "How To Track Your Macros - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/protein-coffee-overnight-oats/", "title": "Protein Coffee Overnight Oats with Instant Coffee - Oh Snap Macros", "author": "Danielle Lima", "servings": "2", "prep_time": "15 minutes", "ingredients": ["unsweetened vanilla almond milk", "old fashioned oats", "plain nonfat Greek yogurt", "vanilla protein powder (Pescience)", "honey (or maple syrup)", "chia seeds", "instant coffee", "cinnamon", "fresh or thawed blueberries", "a sprinkle of granola or chopped nuts (optional, for crunch)"], "instructions": ["Add ¾ cup almond milk, ¼ cups oats, ¼ cup greek yogurt, 1 scoop vanilla protein powder, 1 Tbsp. honey, and 1 Tbsp. of chia seeds, 2 tsp. instant coffee and ¼ tsp. cinnamon to each of the 2 mason jars or containers. Stir or shake until fully combined.", "Cover the jars and refrigerate for at least 6 hours or overnight to allow the oats to soften, the mixture to thicken and flavors to meld.", "Before serving, top the oats with granola or nuts for texture or cocoa nibs."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/berry-smoothie-bowl/", "title": "High Protein Mixed Berry Smoothie Bowl - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "5 minutes", "ingredients": ["frozen mixed berries", "vanilla protein powder, PEScience", "peanut butter", "unsweetened vanilla almond milk", "plain nonfat greek yogurt"], "instructions": ["Add all ingredients to a high-speed blender and blend until smooth. You may need to stop and stir the mixture a couple times to make sure everything gets blended in.", "Pour the smoothie mixture into a serving bowl. Top with your favorite toppings such as fresh berries, granola, chia seeds, pumpkin seeds and shredded coconut."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/mexican-chicken-salad/", "title": "Fire-Roasted Corn Mexican Chicken Salad - Oh Snap Macros", "author": "Danielle Lima", "servings": "5", "prep_time": "10 minutes", "cook_time": "1 minute", "ingredients": ["shredded rotisserie chicken (no skin)", "non-fat plain greek yogurt", "light mayonnaise", "low-fat cottage cheese", "olive oil", "lime juice", "taco seasoning (store-bought or homemade)", "smoked paprika", "salt", "fresh cracked pepper", "fire-roasted corn", "red bell pepper, finely diced", "red onion, finely diced", "cilantro, chopped", "pickled jalapeños, finely chopped (for spice)", "shredded reduced-fat cheddar cheese"], "instructions": ["In a high speed blender, add the Greek yogurt, light mayonnaise, cottage cheese, olive oil, lime juice, taco seasoning, smoked paprika, salt and black pepper and blend until smooth. You may need to use a spatula to scrape down the sides. We just want to be sure the cottage cheese fully blends.", "Add the shredded chicken, red bell pepper, red onion, corn, and cilantro to a large bowl. Top with the dressing. Stir until everything is evenly coated.", "Cover and refrigerate for at least 30 minutes to let the flavors meld. Garnish with chopped cilantro before serving, if desired."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/homemade-chicken-nuggets/", "title": "Homemade Air Fryer Ground Chicken Nuggets - Oh Snap Macros", "author": "Danielle Lima", "servings": "16", "prep_time": "10 minutes", "cook_time": "8 minutes", "ingredients": ["ground chicken, 97/3%", "Italian seasoned breadcrumbs", "egg, beaten", "liquid smoke, hickory flavor", "garlic powder", "onion powder", "paprika", "salt", "fresh cracked pepper", "spicy brown mustard", "milk (any kind)", "Italian seasoned breadcrumbs (outside coating)"], "instructions": ["In a large mixing bowl add the ground chicken, breadcrumbs, beaten egg, liquid smoke, garlic powder, onion powder, paprika, salt, pepper, mustard and milk. Combine with your hands to evenly mix everything together.", "Split into 4 balls, approximately 150g each. Split those balls into 4 nuggets, approximately 37g each. Roll the ground chicken mixture into balls and lightly press into nugget form.", "Add the remaining ½ cup Italian seasoned breadcrumbs to a shallow bowl and coat each nugget in the crumbs on all sides.", "Place coated nuggets in the air fryer basket and spray the tops with olive oil spray or avocado spray and cook at 390 degrees Fahrenheit for 5 minutes. Flip, spray the tops and cook for an additional 4 minutes. Remove and enjoy."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/chicken-fajita-wraps/", "title": "Sheet Pan Chicken and Bean Fajita Wraps (gluten and dairy-free) - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "15 minutes", "cook_time": "25 minutes", "ingredients": ["boneless skinless chicken breasts, cut into strips", "bell pepper, cut into strips", "green bell pepper, cut into strips", "sweet yellow onion, sliced", "garlic, minced", "lime juice", "olive oil", "taco seasoning", "can charro beans, or refried beans", "Siete cassava flour tortillas (1 pack)", "shredded lettuce", "sliced avocado", "salsa", "cilantro", "hot sauce"], "instructions": ["Preheat the oven to 425 degrees Fahrenheit.", "Add the sliced chicken, bell peppers, onion, garlic, lime juice and olive oil to a large mixing bowl and combine. Top with the taco seasoning and mix to fully coat.", "Spray a large baking sheet with nonstick spray or oil and spread the chicken fajita filling out. Place in the oven and cook for 15-20 minutes until the chicken is cooked through and no longer pink.", "While the chicken cooks, heat the beans either stovetop or in the microwave.", "When the chicken is cooked through, remove from the oven and prep your tortillas. You can either microwave to soften or lay them on top of the oven stove flame and char to brown. If using Siete Cassava Flour tortillas, remove when they start to bubble and flip continuously. This keeps them soft and pliable.", "Lay the warmed tortilla out on a flat surface and to the bottom half of the tortilla add 70g beans, 200g chicken mixture, and your favorite toppings like sliced avocado, salsa, hot sauce and cilantro.", "Begin to fold your wrap, fold the ends over the mixture and the bottom up over, and continue rolling until you have a sealed wrap. Optional, sear in a hot pan or panini press until golden brown."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/chipotle-ranch-tuna-wraps/", "title": "Chipotle Ranch Tuna Wraps (dairy-free) - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "15 minutes", "cook_time": "2 minutes", "total_time": "17 minutes", "ingredients": ["dairy-free avocado oil mayonnaise, Primal Kitchen", "almond milk", "olive oil", "lemon juice", "fresh dill, chopped", "fresh chives, chopped", "chipotle peppers in adobo sauce, finely chopped", "Worcestershire sauce", "garlic powder", "fresh cracked pepper", "can tuna, Wild Planet Tuna", "bread and butter pickles, chopped", "red onion, chopped", "celery, chopped", "Tumaro White Wrap or preferred tortilla"], "instructions": ["Add the ranch ingredients to a jar or large bowl and stir to combine. Place in the refrigerator to set for 5-10 minutes before using. Optional, for plain ranch omit the chipotle peppers.", "While the ranch sets, add drained tuna, pickles, red onion, celery and 2 Tbsp. (36g) of chipotle ranch. Mix to combine.", "To a burrito size wrap or tortilla add the tuna, lettuce leaves and tomato slices at the bottom half of the tortilla. Fold the ends over and the bottom up to seal and continue to roll like a burrito until sealed.", "Optional, sear on a hot pan or panini press to grill the outside of the wrap. Serve with extra chipotle ranch if desired."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/crispy-chicken-tacos/", "title": "4-Ingredient Sheet Pan Crispy Buffalo Chicken Tacos - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["cooked and shredded chicken", "buffalo sauce, Frank’s Red Hot", "corn tortillas", "shredded Monterey Jack cheese", "fresh limes or lime juice", "fresh cilantro", "crumbled cotija or blue cheese", "pickled red onion"], "instructions": ["Preheat the oven to 450°F. Mix the chicken and buffalo sauce together in a bowl.", "Warm the tortillas in the microwave wrapped in a damp paper towel for about 30 seconds, or until soft and pliable. Keep covered until ready to use.", "Spray a baking sheet with non-stick spray. Working one at a time, each taco will get 28g 1/4 cup cheese. Top half of each tortilla with half of the cheese (14g), 1/8 of the buffalo-chicken mixture, and the remaining (14g) cheese. Fold the tortilla to close and repeat with the remaining ingredients.", "Spray the tops with cooking spray and bake the tacos in the preheated oven for 10-12 minutes, or until they are crispy and bubbly. They will crisp up as they sit and cool. If needed you can top the tacos with another pan to keep them sealed for the first half of baking and remove halfway through to crisp up or use toothpicks to hold them in place."]}
{"url": "https://ohsnapmacros.com/crispy-rice-bowls/", "title": "Crispy Rice Bowls with Chipotle Shrimp and Mango Salsa - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "30 minutes", "cook_time": "34 minutes", "ingredients": ["uncooked jasmine rice", "water", "adobo sauce", "olive or avocado oil", "salt", "shrimp, deveined and tails removed", "chipotle pepper", "chili powder", "garlic powder", "salt", "black pepper", "olive oil", "green onions, chopped", "cilantro", "garlic, diced", "juiced", "nonfat or 2% Greek yogurt", "water", "red onion, finely chopped", "mango, cubed small", "avocados, cubed small", "cilantro, chopped", "juiced", "jalapeno, finely chopped", "English cucumber, sliced", "avocado, cut into chunks (optional)", "hot sauce (optional)"], "instructions": ["Preheat the oven to 400 degrees Fahrenheit. Make the rice. Cook your rice (using your preferred method), fluff and then let it cool completely. Once cooled, drizzle with adobo sauce, olive oil, and sprinkle with salt. Mix to ensure the rice is well coated. Spread it evenly on a baking sheet.", "Bake for 20-25 minutes, stirring halfway through for an even crispiness. Cook for less time if you’d like your rice less crispy or skip altogether if you don’t want crispy rice.", "Combine olive oil, chipotle pepper, chili powder, garlic powder, salt and pepper in a medium-sized bowl. Toss the shrimp in the marinade and let it sit until the rice is about 10 minutes from being done. Add the onion, mango, avocado, cilantro, lime juice and jalapeno to a container, stir and combine to make the salsa. Put in the fridge to set while you finish the rest.", "In a food processor or blender, combine olive oil, green onion, cilantro, garlic, lime juice, salt, Greek yogurt and water. Blend until combined. Place the sauce in a mason jar (or other container) with a lid and set in the fridge to chill while continuing.", "In a large sauté pan, place your shrimp in a single layer. Cook the shrimp over medium heat. This should take 2-3 minutes per side. It’s done when the shrimp is pink and no longer opaque.", "Place the crispy rice on the bottom of the bowl. Top with shrimp, cucumbers, mango salsa, sauce and avocado chunks. See notes for exact measurements."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/hibachi-style-chicken-bowls/", "title": "Homemade Hibachi Style Chicken Bowls with Vegetables - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "20 minutes", "ingredients": ["boneless skinless chicken breasts", "coconut aminos", "toasted sesame oil", "garlic", "hoisin sauce", "ginger paste", "salt and black pepper", "olive oil", "olive oil", "coconut aminos", "zucchini", "sliced crimini mushrooms", "carrot chips", "salt and black pepper", "Jasmine Minute Rice", "water", "frozen riced cauliflower", "coconut aminos", "dijon mustard", "eggs", "salt", "black pepper", "green onions", "spicy mustard", "toasted sesame seeds", "red pepper flakes", "chopped green onions", "extra coconut aminos"], "instructions": ["Add the coconut aminos, sesame oil, garlic, hoisin sauce, ginger, salt and pepper to a sealable bowl or bag for marinating. Mix together to evenly combine. Add the chopped chicken breast to the bowl and mix to coat.", "Cover and let marinate in the refrigerator for at least 1 hour but best overnight. Every so often give the bowl a shake to evenly marinate the chicken.", "Heat ½ Tbsp. of olive oil in a large wok or large skillet. Add the zucchini, mushrooms and carrots to the wok and top with coconut aminos, salt and pepper. Saute over medium heat for 5-10 minutes until the vegetables are fork tender.", "Remove the sautéed vegetables from the pan and set aside.", "Add ½ Tbsp. olive oil to the same pan you cooked the vegetables in and add the marinated chicken and any remaining sauce.", "Saute for 7-10 minutes until the chicken is browned and coked through and no longer pink. The internal temperature should read 165 degrees Fahrenheight with a meat thermometer.", "While the veggies and chicken cook add the uncooked rice to a large microwave safe bowl. Add 2 cups of water and microwave for 8 minutes (or according to the package instructions).", "Remove the rice from the microwave and cook the riced cauliflower according to the package instructions.", "Once the chicken is done cooking, remove, set aside and add the rice to the same pan along with the cooked cauliflower rice. Mix to evenly combine and push to the outer edges to create a hole in the center to cook your eggs.", "Spray the center with nonstick spray and add 2 lightly scrambled eggs to the center of the pan to cook. Scramble in the center and once cooked through mix into the rice. Add the coconut aminos, dijon mustard, green onions, salt and pepper and mix to evenly combine.", "Each bowl gets approximately 135 grams of rice (1 cup loosely packed), 100 grams of vegetables (1/2 cup) and 130 grams of chicken (3/4 cup).", "Top with toasted sesame seeds, red pepper flakes, sriracha sauce or chopped green onions for serving."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/cajun-chicken-and-broccoli-alfredo/", "title": "Lightened Up 30-Minute Cajun Chicken And Broccoli Alfredo - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "20 minutes", "ingredients": ["boneless skinless chicken breasts", "cajun seasoning", "olive oil", "red bell pepper", "orange bell pepper", "yellow bell pepper", "broccoli florets", "yellow onion", "garlic", "Barilla Protein Plus Pasta Spaghetti", "fat free half and half", "low sodium chicken broth", "Cajun seasoning", "salt", "fresh cracked pepper", "zucchini", "Parmesan Romano Cheese blend, shredded", "smoked paprika", "salt", "garlic powder", "onion powder", "dried oregano", "cayenne pepper", "fresh ground black pepper", "fresh parsley", "shredded parmesan cheese"], "instructions": ["Add the sliced and chopped chicken to a large mixing bowl and top with 3 Tbsp. cajun seasoning. Mix to ensure all sides are coated with the seasoning.", "In a deep skillet or dutch oven with high sides, heat the olive oil over medium-high heat. Add the chicken slices and cook until golden brown and cooked through, approximately 5 minutes. Once cooked, transfer the chicken to a plate and set aside.", "Add the peppers, broccoli, onion and garlic to the same skillet and sauté until softened.", "Pour the half and half and chicken broth in with the vegetables. If you want mild (still spicy as this is a cajun dish) add 1 tsp. of cajun seasoning to the mixture along with salt and pepper. If you want spicy, add 2 tsp. of cajun seasoning and stir to combine.", "Break the spaghetti noodles in half and add to the pot in a criss cross pattern. This helps them cook through and not stick together in the pot. Press the noodles down so they’re submerged in the liquid to cook.", "Bring the mixture to a boil, then reduce the heat to low. Cover the pot and let simmer for about 10-15 minutes or until the pasta is cooked to your liking, stirring often.", "Once the noodles have softened, add the spiralized zucchini and mix to combine.", "Once the pasta is cooked and zucchini is soft, add the cheese to the pot and mix to melt and combine. Let simmer for 3-5 minutes.", "Add the cooked chicken back into the pot and stir into the pasta. Simmer for 3-5 minutes to allow the chicken to heat through and the flavors to melt together while the sauce thickens. Taste and adjust seasonings, if needed."], "ratings": "4.96"}
{"url": "https://ohsnapmacros.com/crockpot-chicken-jalapeno-popper-dip/", "title": "Crockpot Chicken Jalapeno Popper Cottage Cheese Dip - Oh Snap Macros", "author": "Danielle Lima", "servings": "14", "prep_time": "15 minutes", "cook_time": "1 hour", "ingredients": ["bacon", "less fat cream cheese", "low fat cottage cheese", "jalapeños (2 seedless, 2 with seeds)", "Mexican blend shredded cheese", "mozzarella cheese low moisture", "garlic powder", "salt", "fresh cracked black pepper", "boneless skinless chicken breast, raw", "low sodium chicken broth", "sliced jalapeños", "red onions", "green onions", "hot sauce"], "instructions": ["In a large skillet cook the bacon, remove from the heat and chop into bite size pieces.", "Add the cream cheese, cottage cheese (no need to blend), jalapeños, half the chopped bacon, shredded cheeses, garlic powder, salt and pepper to the crockpot. Place the lid on and cook on high for 1 hour. Stir a couple times throughout the hour to get everything moving and melting and ensure the edges do not burn.", "While the base cooks in the crockpot, prepare the shredded chicken (this can be done the day before). Add the chicken to a large pot, cover with water and bring to a boil. Cook for 15-20 minutes or until the chicken is fully cooked through, no longer pink and has an internal temperate of 165 degrees Fahrenheit.", "Remove the chicken and shred with two forks or in a large mixing bowl with a hand mixer.", "Once the base has cooked for one hour, add the shredded chicken and 1 cup chicken broth to the crockpot. Stir everything together and let cook on high for an additional hour.", "Once done, stir together, adjust with salt and pepper and serve. Top with the remaining chopped bacon, sliced jalapenos, red onions, green onions or whatever you desire."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/product/macro-counts/", "title": "Custom Macro Count - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/contact/", "title": "Contact - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/our-guarantee/", "title": "Our Guarantee - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/terms-and-conditions/", "title": "Terms and Conditions - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/privacy-policy/", "title": "Privacy Policy - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/disclosure/", "title": "Disclosure - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/web-stories/instant-pot-chicken-gnocchi-soup/", "title": "Creamy Chicken Gnocchi Soup (Instant Pot) - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/cottage-cheese-lasagna/", "title": "Delicious Cottage Cheese Lasagna with Beef and Spinach - Oh Snap Macros", "author": "Danielle Lima", "servings": "12", "prep_time": "30 minutes", "cook_time": "1 hour", "ingredients": ["olive oil", "garlic", "yellow onion", "lean ground beef", "oregano", "Italian seasoning", "paprika", "chili powder", "salt", "black pepper or fresh cracked", "jar of marinara sauce", "low fat small curd cottage cheese", "eggs", "parmesan cheese", "oregano", "Italian seasoning", "salt", "fresh cracked pepper or pinch of black pepper", "frozen spinach", "oven ready lasagna noodles", "low moisture mozzarella cheese"], "instructions": ["Pre-heat the oven to 375 degrees Fahrenheit. Heat oil in a large skillet over medium heat. Add the garlic and onions to the pan and cook until nice and browned, approximately 3-5 minutes.", "Add the ground beef to the pan and break into bite size pieces. Cook until fully cooked through, mixing often, approximately 5 minutes.", "Add the oregano, italian seasoning, paprika, chili powder, salt and pepper to the beef mixture and combine to evenly coat.", "Add sauce, combine and simmer while you prepare the cottage cheese filling.", "For the filling: combine the cottage cheese, eggs, parmesan cheese, oregano, Italian seasoning, salt and pepper and mix well to combine. If your cottage cheese has excess liquid, strain some of it out! This helps keep your lasagna from being too liquidy.", "Add the defrosted and strained spinach to the cottage cheese mixture and mix to combine.", "Spray a 9×13 inch baking dish with non stick cooking spray. Add a dollop of the meat mixture to the bottom of the dish to lightly coat the bottom. Top with 4 noodles, the noodles are the width of the baking dish (short side) not the length.", "Top the noodles evenly with ½ cup mozzarella cheese (56g), followed by half the meat mixture. Use a spoon or spatula to evenly spread the mixture over the noodles. Top the meat mixture with half the cottage cheese filling and spread to coat the top. Repeat with 4 noodles, ½ cup cheese, remaining meat mixture, remaining cottage cheese filling and 1 cup cheese on top.", "Place the baking dish on a baking sheet to catch any overflow. Cover the dish with foil, try to avoid touching the cheese on top so that it doesn’t stick to the foil. Bake for 50 minutes.", "Remove the foil and bake an additional 10-15 minutes until the cheese is melted and browned and the sauce is nice and bubbly at the edges.", "Top with freshly chopped parsley and cut into 12 equal servings and enjoy this easy lasagna recipe."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/macro-friendly-chili/", "title": "Instant Pot Beef and Turkey Chili with Beans - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "10 minutes", "cook_time": "30 minutes", "ingredients": ["lean ground beef", "lean ground turkey", "medium yellow onion, chopped", "garlic clove, minced", "bell peppers, chopped (1 green, 1 red)", "cans diced Fire Roasted Tomatoes", "can tomato paste", "can diced green chilies", "low sodium beef broth", "can BUSH'S BEST Mixed Beans in a Mild Chili Sauce", "chili powder", "ground cumin", "salt", "pepper"], "instructions": ["Turn instant pot to sauté, drizzle the bottom with olive oil just to avoid the meat sticking. Add garlic and cook until fragrant. Add the ground turkey and ground beef to the pot and cook until browned but not fully cooked through.", "While still in the sauté function add onions, bell peppers and all remaining ingredients. Stir together well.", "Put on the lid and set to pressure cook for 30 minutes. Once done, you can let this self release all the way or quick release. Remove the lid and stir together to combine.", "Serve topped with sour cream, Greek yogurt, shredded cheese, chopped red onion and/or avocado. A favorite topping fore this chili is the Sweet Heat Jalapenos from Mt. Olive, they add the perfect amount of sweet spice to the dish!"], "ratings": "4.75"}
{"url": "https://ohsnapmacros.com/chili-cheese-enchiladas/", "title": "Chili Cheese Enchiladas - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "15 minutes", "cook_time": "30 minutes", "ingredients": ["lean ground beef (93/7)", "lean ground turkey (99/1)", "medium yellow onion, chopped", "garlic clove, minced", "bell peppers, chopped (1 green, 1 red)", "cans diced Fire Roasted Tomatoes (14oz cans)", "can tomato paste (6oz)", "can diced green chilies", "beef broth", "BUSH'S BEST Mixed Beans in a Mild Chili Sauce – 15.5 Oz", "chili powder", "ground cumin", "salt", "pepper", "Mission Carb Balance Flour Tortillas", "(112g) shredded Cheddar Cheese", "La Victoria Sauce Enchilada Green Mild Can – 10 Oz", "(84g) shredded Monterey Jack Cheese"], "instructions": ["Turn instant pot to sauté, drizzle the bottom with olive oil just to avoid the meat sticking. Add garlic and cook until fragrant. Add the ground turkey and ground beef to the pot and cook until browned but not fully cooked through.", "While still in the sauté function add onions, bell peppers and all remaining ingredients. Stir together well.", "Put on the lid and set to pressure cook for 30 minutes. You can let this self release all the way or quick release. This will make 10 servings total. You will only use 3 servings of chili for the enchiladas. Reheat the chili throughout the week for other meals, or freeze for later.", "Preheat the oven to 350 degrees Fahrenheit.", "Add 3 servings of chili (approx. 1170 grams) to a strainer. Remove most of the liquid and set aside. In a 9 x 13 inch baking sheet pour a few spoonful's of the chili liquid on the bottom.", "Lay one tortilla out and add 1/8 of the chili, 2 Tbsp. (14g) cheddar cheese, roll up into a enchilada and place in the baking dish. Repeat with all 8 tortillas. Note: for best accuracy weight your total drained chili and divide by 8. This will be the total meat mixture you add to each tortilla.", "Once you have rolled all 8 tortillas pour the chili liquid you strained on top of enchiladas. Add the green enchilada sauce to the top.", "Cover with foil and bake for 25-30 minutes. Remove the foil and top with Monterey Jack cheese evenly over all 8 chili cheese enchiladas. Return to the oven without the foil and bake for an additional 10-15 minutes until the cheese is melted and the sauce is bubbling.", "Remove from the oven and serve with toppings like red onion, Greek yogurt or sour cream, salsa, cilantro, avocado or jalapenos."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/lazy-enchiladas/", "title": "Lazy Enchiladas - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "25 minutes", "ingredients": ["lean ground beef (96/4)", "can Red Enchilada Sauce", "can diced green chilies", "Mexican Cheese, Shredded", "Super Soft Mission Flour Tortillas", "ground cumin", "smoked paprika", "garlic powder", "chili powder", "water"], "instructions": ["Pre heat the oven to 375F.", "In a pan over medium brown ground beef and break into small pieces. Mix all seasonings in a small bowl and add water. Mix together to create a paste. Once the beef is almost cooked through, add the seasoning paste to the beef and mix well to combine. Add green chilies and simmer everything together for a few minutes while you prep to layer your enchiladas.", "Spray a 9 x 13 baking dish with non stick spray. Add a thin layer of enchilada sauce to the bottom to help the tortillas avoid sticking to the pan.", "Layer enchiladas. 2 tortillas across the enchilada sauce, half the ground beef spread evenly over the tortillas, half the remaining enchilada sauce, half the cheese. Repeat.", "Once you have used all the ingredients in two layers. Add the dish to the oven and bake for 25 minutes until bubbly with slightly crispy edges. Cut through the tortillas and serve.", "Each serving is roughly 230 grams."], "ratings": "4.98"}
{"url": "https://ohsnapmacros.com/pumpkin-pie-bliss-balls/", "title": "No-Bake Pumpkin Pie Bliss Balls Recipe - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "10 minutes", "cook_time": "20 minutes", "ingredients": ["old fashioned oats", "vanilla protein powder (PEScience)", "pumpkin puree", "creamy peanut butter", "honey", "pumpkin pie spice", "Lily's dark chocolate chips", "coconut oil", "flakey sea salt", "chopped nuts", "dried cranberries", "mini chocolate chips"], "instructions": ["In the bowl of a food processor or high speed blender, pulse the oats until they become a coarse flour-like texture. Combine with the protein powder in a large bowl.", "Add the pumpkin puree, peanut butter, honey, pumpkin pie spice, and a pinch of salt to the bowl and mix until well combined. Add to the oat and protein mixture and combine until the dry powder is fully incorporated with the wet and it creates a sticky dough.", "If you're adding any optional mix-ins like chopped nuts, dried cranberries, or mini chocolate chips, fold them into the dough.", "Using a cookie dough scoop or spoon, scoop equal portions of the mixture and roll them into 10 bite-sized balls, approximately 32 grams each. If the mixture is too sticky, you can wet your hands slightly to make rolling easier. You want to roll them into tight balls to stick everything together.", "Place the bliss balls on a plate or baking sheet lined with parchment paper.", "Refrigerate the bliss balls for at least 30 minutes to allow them to firm up prior to adding the chocolate coating. You can also freeze them for 10-15 minutes to speed up the process.", "Add the chocolate chips and coconut oil to a microwave safe dish and microwave in 30 second intervals until the chocolate has completely melted. Add each ball separately to the chocolate sauce, coat it evenly with the sauce and place it back on the baking sheet. Repeat with all 10 bliss balls. Sprinkle the tops with flakey sea salt and return the bliss balls to the fridge or freezer to harder and set.", "Once chilled, the bliss balls are ready to enjoy! Store any leftovers in an airtight container in the refrigerator."], "ratings": "4.85"}
{"url": "https://ohsnapmacros.com/butternut-squash-and-red-pepper-soup/", "title": "Roasted Garlic Butternut Squash and Red Pepper Soup (13g protein) - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "10 minutes", "cook_time": "1 hour", "ingredients": ["red bell peppers", "frozen cubed butternut squash", "garlic cloves", "olive oil", "salt", "fresh cracked black pepper", "chicken bone broth", "low-fat cottage cheese", "salt", "onion powder", "garlic powder", "ground ginger", "coconut aminos", "fresh cracked pepper"], "instructions": ["Preheat the oven to 400 degrees fahrenheit. Add the bell peppers, butternut squash and garlic to a large sheet pan. Drizzle the olive oil, salt and pepper over the top and mix to combine and coat. Roast in the oven for 40-45 minutes or until the bell peppers are nice and chared and soft.", "Remove the peppers and squash from the oven and scoop into a large high speed blender. Add 1 cup bone broth and the cottage cheese and blend for approximately 5 minutes or until everything is smooth and well blended.", "Over medium heat, add the blended peppers and squash to a large dutch oven or soup pot. Pour 2 cups of the broth into the blender and swish around, this is how you’ll get all the blended mixture out, and pour into the dutch oven.", "Add the remaining broth, salt, onion powder, garlic powder, ginger, coconut aminos and lots of fresh cracked pepper. Bring to a simmer and simmer until it’s warmed through while whisking to ensure the mixture incorporates into the broth.", "Serve topped with blended cottage cheese for extra creaminess, or cream, croutons, fresh basil or chopped green onions and a dash of red pepper flakes for some heat is desired."], "ratings": "4.67"}
{"url": "https://ohsnapmacros.com/sweet-potato-pie/", "title": "Simple Sweet Potato Pie (store-bought crust) - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "25 minutes", "cook_time": "1 hour", "ingredients": ["sweet potatoes", "unsalted butter", "light brown sugar", "granulated sugar", "room temperature", "whole milk", "vanilla extract", "salt", "cinnamon", "nutmeg", "refrigerated pie crust"], "instructions": ["Preheat oven to 400 degrees Fahrenheit.  Poke several holes in the potatoes with a fork.  Place potatoes on a baking sheet, bake until fork tender, about one hour.  Remove from oven and allow to cool for 5-10 minutes.", "While the potatoes cool blind bake the pie crust. Roll the pie crust into a 9-inch pie plate and line with parchment paper or foil, fill it with pie weights or even raw beans.  Bake for 15-20 minutes, remove from the oven, carefully remove the pie weights, and set aside to cool.", "Reduce oven temperature to 350 degrees Fahreneight.", "Remove the skin from the cooked sweet potatoes, with a knife remove any scorched flesh or dark areas.", "Add potatoes to the bowl of a food processor, and blend until the potatoes are pureed.  Or mash with a potato masher or ricer, until no large lumps remain. You should have 2 ¼ to 2 ½ cups of potato puree.", "In a large bowl add the puree and softened butter.  Stir until the butter is melted and thoroughly incorporated.", "Add brown sugar, white sugar, salt, cinnamon, and nutmeg and stir to combine.", "Add the eggs, milk, and vanilla extract, stirring with a whisk until fully incorporated.", "Pour the mixture into the par baked pie crust.  Bake for 1 hour, or until pie is puffed up and the center wiggles slightly.  Tent crust with foil the final 15 minutes of baking if it is getting too browned.", "Remove the pie from the oven and cool for an hour, refrigerate until ready to serve."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/cranberry-lime-mocktail/", "title": "Cranberry Lime Mocktail with Easy Rosemary Simple Syrup - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "30 minutes", "cook_time": "2 minutes", "ingredients": ["water", "white sugar", "fresh rosemary", "rosemary syrup", "freshly squeeze lime juice", "pure unsweetened cranberry juice", "lime or lemon flavored sparkling water or seltzer", "ice, as needed", "rosemary", "lime slices", "fresh cranberries"], "instructions": ["Make a rosemary simple syrup by adding the water, granulated sugar, and rosemary to a small pot or saucepan. Set it over medium heat. Stir frequently to encourage the sugar to dissolve. Once the syrup just begins to simmer, remove it from the heat. Set it aside for 30 minutes to cool and allow the rosemary to further infuse its flavor. After 30 minutes, strain out the rosemary and bottle the syrup. Keep leftovers in the refrigerator for up to 2 weeks.", "Add 1 ½ teaspoons of the rosemary simple syrup to a rocks glass or short tumbler along with the lime juice and the cranberry juice. Stir to combine.", "Fill the glass ½ to ¾ full of ice.", "Top the drink with ¼ to ½ cup lime flavored sparkling water.", "If you prefer, you can garnish the mocktail with a rosemary sprig, a lime slice, and fresh cranberries before enjoying."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/easy-high-protein-soup-and-chili-recipes/", "title": "Easy High Protein Soup and Chili Recipes - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "5 minutes", "cook_time": "20 minutes", "ingredients": ["boneless skinless chicken breast, raw", "red bell pepper, chopped", "small yellow onion, chopped", "can Whole Kernel Corn (no salt added)", "can low sodium Black Beans Low Sodium", "can petite diced Tomatoes (no salt added)", "can mild Red Enchilada Sauce", "can diced green chilies", "low sodium Chicken Broth", "salt", "pepper", "onion powder", "garlic powder", "paprika", "chili powder", "ground cumin", "1/3 less fat Cream Cheese", "nonfat plain Greek yogurt"], "instructions": ["Add the chicken the the base of the crockpot. Top with bell pepper, onions, corn, beans, tomatoes, chilies, enchilada sauce, seasonings and chicken broth.", "Stir to combine and set the crockpot to cook on low for 6-8 hours or high for 3 hours, or until the chicken is tender.", "Remove the chicken from the crockpot and shred with forks. Return to the pot.", "Add the cream cheese and greek yogurt and stir until melted and combined. Serve and enjoy with desired toppings.", "Add all ingredients except the cream cheese and greek yogurt to the instant pot.", "Set the instant pot on manual (pressure cook mode) for 20 minutes. Quick release the pressure when the timer in done.", "Remove the chicken and shred with forks. Add the chicken back to the instant pot.", "Add cream cheese and greek yogurt to the soup and stir until completely melted into the soup. Serve and enjoy with desired toppings.", "In a large pot, sauté the chopped bell pepper and onion over medium heat until they begin to soften.", "Place the raw chicken breasts on top of the sautéed vegetables. Add the corn, black beans, diced tomatoes, green chilies, enchilada sauce, and all the seasonings. Pour the chicken broth over everything, ensuring the chicken is mostly submerged.", "Bring the pot to a boil, then reduce the heat to a simmer. Cover the pot and let it cook for about 20-30 minutes, or until the chicken is cooked through and tender.", "Carefully remove the chicken breasts from the pot. Shred the chicken using forks and then return the shredded chicken to the pot.", "Stir in the cream cheese and Greek yogurt until they are fully melted and combined with the rest of the ingredients.", "Let the pot simmer for an additional 5-10 minutes to allow the flavors to meld together."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/creamy-chicken-enchilada-soup-2/", "title": "Creamy High Protein Chicken Enchilada Soup - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "5 minutes", "cook_time": "20 minutes", "ingredients": ["boneless skinless chicken breast, raw", "red bell pepper, chopped", "small yellow onion, chopped", "can Whole Kernel Corn (no salt added)", "can low sodium Black Beans Low Sodium", "can petite diced Tomatoes (no salt added)", "can mild Red Enchilada Sauce", "can diced green chilies", "low sodium Chicken Broth", "salt", "pepper", "onion powder", "garlic powder", "paprika", "chili powder", "ground cumin", "1/3 less fat Cream Cheese", "nonfat plain Greek yogurt"], "instructions": ["Add the chicken the the base of the crockpot. Top with bell pepper, onions, corn, beans, tomatoes, chilies, enchilada sauce, seasonings and chicken broth.", "Stir to combine and set the crockpot to cook on low for 6-8 hours or high for 3 hours, or until the chicken is tender.", "Remove the chicken from the crockpot and shred with forks. Return to the pot.", "Add the cream cheese and greek yogurt and stir until melted and combined. Serve and enjoy with desired toppings.", "Add all ingredients except the cream cheese and greek yogurt to the instant pot.", "Set the instant pot on manual (pressure cook mode) for 20 minutes. Quick release the pressure when the timer in done.", "Remove the chicken and shred with forks. Add the chicken back to the instant pot.", "Add cream cheese and greek yogurt to the soup and stir until completely melted into the soup. Serve and enjoy with desired toppings.", "In a large pot, sauté the chopped bell pepper and onion over medium heat until they begin to soften.", "Place the raw chicken breasts on top of the sautéed vegetables. Add the corn, black beans, diced tomatoes, green chilies, enchilada sauce, and all the seasonings. Pour the chicken broth over everything, ensuring the chicken is mostly submerged.", "Bring the pot to a boil, then reduce the heat to a simmer. Cover the pot and let it cook for about 20-30 minutes, or until the chicken is cooked through and tender.", "Carefully remove the chicken breasts from the pot. Shred the chicken using forks and then return the shredded chicken to the pot.", "Stir in the cream cheese and Greek yogurt until they are fully melted and combined with the rest of the ingredients.", "Let the pot simmer for an additional 5-10 minutes to allow the flavors to meld together."], "ratings": "4.96"}
{"url": "https://ohsnapmacros.com/pumpkin-pie-with-graham-cracker-crust/", "title": "Creamy Pumpkin Pie with Graham Cracker Crust - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "15 minutes", "cook_time": "1 hour", "ingredients": ["finely crushed graham crackers", "granulated sugar", "coconut oil", "salt", "pumpkin puree", "granulated sugar", "ground cinnamon", "ground ginger", "ground cloves", "ground nutmeg", "salt", "eggs", "heavy cream"], "instructions": ["Preheat your oven to 375 degrees Fahrenheight.", "In a food processor, pulse the graham crackers into fine crumbs.", "In a medium bowl, combine the crushed graham crackers, sugar, melted coconut oil, and salt. Stir until the mixture is well combined and has a consistency similar to wet sand. Press the mixture firmly into the bottom and up the sides of a 9-inch pie pan.", "Bake in the preheated oven for 7-8 minutes until slightly golden. Remove from the oven and set aside.", "In a large bowl, whisk together the pumpkin puree, sugar, cinnamon, ginger, cloves, nutmeg, and salt until well combined. Beat in the eggs one at a time, followed by the heavy cream, mixing until the filling is smooth.", "Pour the pumpkin mixture over the crust and smooth the top with a rubber spatula, if needed. Bake in the preheated oven for about 55-65 minutes, or until the center is slightly jiggly and set. You can also check the internal temperature is 185 degrees Fahrenheight to confirm it is done prior to removing from the oven.", "At the 30 minute mark, cover the edges of the pie with aluminum foil or a pie crust shield so the edges do not burn. You can cover just the edges of the pie with foil or use a pie shield to avoid burning the tips of the pie crust. To make a pie guard, cut a ring out of parchment paper and lay it over the edge to cover the crust and leave the center of the pie open.", "Remove the pie from the oven and allow it to cool on a wire rack for at least 3-4 hours to set.", "Cover with foil and transfer to the refrigerator to set overnight for best results.", "Slice and serve with a dollop of whipped cream on top of the pie, if desired."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/gluten-free-sweet-potato-casserole/", "title": "Gluten-Free Sweet Potato Casserole with Honey Walnut Topping - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "15 minutes", "cook_time": "1 hour", "ingredients": ["sweet potatoes (4-5 potatoes)", "butter or coconut oil", "almond milk", "eggs", "honey", "pure vanilla extract", "salt", "ground cinnamon", "ground nutmeg", "chopped walnuts", "honey", "ground cinnamon", "salt"], "instructions": ["Preheat your oven to 375 degrees Fahrenheit and grease a 9×13-inch casserole dish.", "In a large pot, cover the sweet potato chunks with water. Bring to a boil, then reduce the heat and simmer until the sweet potatoes are tender when poked with a fork (about 20-25 minutes). Drain and let them cool for a few minutes.", "In a large bowl, mash the sweet potatoes with a potato masher or hand-held mixer ensuring a smooth texture. For best results on a super creamy texture, use a hand mixer.", "Add butter, milk, eggs, honey, vanilla extract, salt, cinnamon, and nutmeg to the mashed sweet potatoes. Mix until well combined. Transfer the sweet potato mixture into a greased 9×13-inch baking dish.", "In a separate bowl, combine the walnuts and honey and mix to evenly combine. Evenly sprinkle the walnuts over the sweet potato mixture followed by cinnamon and salt. I like to pour the cinnamon in my palm and evenly spread it over the top. You will need to work the nuts around the top as they will be sticky.", "Bake in the preheated oven for 25-30 minutes, or until the topping is golden and the casserole is hot. Remove from the oven, serve and enjoy."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/category/fall-favorites/page/2/", "title": "Fall Favorites Archives - Page 2 of 3 - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/category/fall-favorites/page/3/", "title": "Fall Favorites Archives - Page 3 of 3 - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/chocolate-chip-cookies/", "title": "Cinnamon Chocolate Chip Cookies - Oh Snap Macros", "author": "Danielle Lima", "servings": "17", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["unsalted butter", "granulated sugar (or sugar substitute)", "brown sugar (or sugar substitute)", "egg", "vanilla extract", "all-purpose flour", "baking soda", "salt", "ground cinnamon", "semi-sweet chocolate chips"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a baking sheet with parchment paper or a silicone baking mat.", "In a large mixing bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy using a hand mixer. Beat in the egg and vanilla extract until well combined.", "In a separate medium bowl, whisk together the flour, baking soda, salt, and cinnamon.", "Add the dry ingredients to the wet mixture, mixing until just combined.", "Gently fold in the chocolate chips.", "Using a 1.5 tablespoons cookie scoop, drop scoops of dough onto the prepared baking sheet, leaving space between each cookie. Bake for 10-12 minutes, or until the edges are golden but the center is still soft.", "Remove from the oven and allow the cookies to cool on the baking sheet for about 5 minutes before transferring them to a wire rack to cool completely.", "Store your cookies in an airtight container for 3-4 days."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/chocolate-chipless-cookies/", "title": "Chewy and Soft Chocolate Chipless Cookies - Oh Snap Macros", "author": "Danielle Lima", "servings": "17", "prep_time": "10 minutes", "cook_time": "12 minutes", "ingredients": ["unsalted butter", "granulated sugar (or sugar substitute)", "light brown sugar (or sugar substitute)", "egg", "pure vanilla extract", "all-purpose flour", "baking soda", "baking powder", "pinch of salt", "ground cinnamon (1/4-1/2 tsp. if you like heavy cinnamon)"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit. Line a cookie sheet with parchment paper or a silicone baking mat.", "In a large mixing bowl, cream together the softened butter, granulated sugar, and brown sugar until light and fluffy using a hand mixer. Beat in the egg and vanilla extract until well combined.", "In a separate medium bowl, whisk together the flour, baking soda, baking powder, salt and cinnamon.", "Add the dry ingredients to the wet ingredients, mixing until just combined. You will need to use a rubber spatula to fully mix as the dough is a bit dryer. (You will begin to think something’s missing and they’re too dry, just keep mixing! It’ll come together!)", "Using a 1.5-tablespoon cookie scoop, drop cookie dough balls onto the prepared baking sheet, leaving space between each cookie. Bake for 11-12 minutes, or until the edges are golden but the center is still soft.", "Remove from the oven and allow the cookies to cool on the baking sheet for about 5 minutes before transferring them to a wire rack to cool completely.", "Store your cookies in an airtight container for 3-4 days."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/chilled-cottage-cheese-taco-queso-dip/", "title": "Chilled Cottage Cheese Taco Queso Dip - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "1 hour", "ingredients": ["low-fat cottage cheese", "taco seasoning", "freshly shredded pepper jack cheese", "freshly shredded cheddar cheese", "sliced black olives", "cilantro", "red bell pepper", "pickled jalapeños", "hot sauce", "extra taco seasoning", "lime juice", "green chiles"], "instructions": ["Add the cottage cheese and taco seasoning to a large mixing bowl and mix to combine, no need to blend the cottage cheese. Add the pepper jack, cheddar, black olives, cilantro, red bell pepper and pickled jalapenos and mix to combine.", "Let set in the fridge for an hour to chill before serving.", "Serve and enjoy with chips or sliced raw veggies."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/protein-french-toast/", "title": "Easy High Protein French Toast with Brioche Bread - Oh Snap Macros", "author": "Danielle Lima", "servings": "3", "prep_time": "5 minutes", "cook_time": "10 minutes", "ingredients": ["Brioche bread", "liquid egg whites", "unsweetened vanilla almond milk", "vanilla protein powder (31g)", "ground cinnamon", "ground nutmeg", "powdered sugar or sugar replacement", "maple syrup", "peanut butter", "chocolate sauce", "fresh fruit"], "instructions": ["In a shallow mixing bowl combine the egg whites, almond milk, protein powder, cinnamon, nutmeg and whisk until well combine and minimal, if any, chunks of protein powder remain.", "Heat a large pan or griddle over medium heat and spray with cooking spray.", "Place one slice of brioche bread into the egg mixture and let it soak on both sides. Remove and let any excess drip off prior to adding to the hot pan. Cook on both sides for 3-4 minutes until the liquid eggs have cooked through and the french toast is nice and brown. Remove from the pan and repeat with the remaining bread.", "Serve with maple syrup, peanut butter, chocolate sauce, powdered sugar or fresh fruit."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/low-calorie-cookie-recipes/", "title": "10+ Low-Calorie Cookies - Oh Snap Macros", "author": "Danielle Lima"}
{"url": "https://ohsnapmacros.com/category/popular/", "title": "Popular Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/german-apple-cake/", "title": "Easy German Apple Cake - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "10 minutes", "cook_time": "55 minutes", "ingredients": ["apples, washed (I used pink lady apples)", "all-purpose flour", "baking powder", "salt", "butter", "sugar", "almond milk (any milk)", "vanilla extract", "lemon, juiced", "apple, grated, excess juice squeezed out", "powdered sugar, for dusting"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit, grease a 9” springform pan and place onto a parchment-lined baking sheet.", "Without peeling the apples, cut them in half, from stem to bottom, and remove the core. Place each half of the apple cut-side down and make slices from stem to core, but not all the way through so they stay together. Then, cut the apples once more in half, all the way through so you have quarters of each apple. Remember to leave one half apple intact for the middle of the cake. Rub the cut-side of the apples with a lemon.", "In a medium bowl, combine flour, baking powder, and salt. Set aside.", "In a large bowl, cream the butter and sugar together until fluffy. Stir in the soy milk, vanilla extract, and lemon juice. It’s ok if it’s a little lumpy.", "Pour the dry ingredients into the wet ingredients and mix until just combined. It will feel like a thick paste. Lastly, mix in the grated apples.", "Scoop the batter into the greased spring form pan and smooth it out with a spatula or pastry spatula. Place the apples cut side down starting with the quarter piece apples along the edge, about ¼ inch apart, then place one half apple in the center.", "Bake for 45-55 minutes or until a toothpick inserted into the center comes out clean. Remove from the oven and let cool for at least 30 minutes to an hour before removing from the pan and serving."]}
{"url": "https://ohsnapmacros.com/philly-cheesesteak-meal-prep-bowls/", "title": "Low Carb Philly Cheesesteak Meal Prep Bowls - Oh Snap Macros", "author": "Danielle Lima", "servings": "5", "prep_time": "15 minutes", "cook_time": "25 minutes", "ingredients": ["lean sirloin steak, thinly sliced", "Worcestershire sauce", "garlic powder", "onion powder", "smoked paprika", "salt (or to taste)", "fresh cracked black pepper", "olive oil, divided", "green bell pepper, sliced", "red bell pepper, sliced", "yellow onion, sliced", "baby Bella mushrooms, sliced", "salt", "garlic powder", "unsweetened almond milk", "shredded cheddar cheese", "reduced-fat cream cheese", "garlic powder", "salt"], "instructions": ["In a large bowl, combine the sliced steak, Worcestershire sauce, garlic powder, onion powder, smoked paprika, salt, and black pepper. Toss to coat evenly. Let the steak marinate for 10–15 minutes while you prepare the vegetables or let marinate overnight.", "Heat 1/2 Tbsp. olive oil in a large non-stick skillet over medium heat. Add the bell peppers, onions, mushrooms, ½ tsp. salt and garlic powder. Cook, stirring occasionally for 5 minutes. Up the heat to medium-high and continue cooking for another 5-10 minutes until the vegetables have softened and browned.", "Remove the vegetables from the skillet and set aside.", "In the same skillet, add the remaining 1/2 Tbsp. olive oil. TIP: you can also use a second skillet and cook at the same time as the meat to save on time. Add the marinated steak in a single layer and cook for 2–3 minutes per side, or until browned and cooked through. Avoid overcrowding; cook in batches if needed.", "In a small saucepan over low heat, whisk together almond milk, shredded cheddar cheese, cream cheese, garlic powder, and salt. Stir constantly until the mixture is smooth and creamy.", "Remove from heat and let cool slightly.", "Divide the steak and vegetable mixture evenly among 5 meal prep containers. Approximately, 170 grams of veggies, 116 grams of meat and 41 grams of sauce.", "Optional: Add a serving of cauliflower rice or zucchini noodles to each container for extra volume."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/ricotta-bruschetta/", "title": "Nectarine Pistachio Ricotta Bruschetta - Oh Snap Macros", "author": "Danielle Lima", "servings": "15", "prep_time": "10 minutes", "cook_time": "7 minutes", "ingredients": ["baguette, sliced on the bias into 1/2-inch thick rounds", "olive oil", "salt", "black pepper", "garlic powder", "ricotta cheese, drained", "salt", "black pepper", "fresh basil leaves, roughy chopped", "nectarine, pitted and diced", "cherry tomatoes, halved or quartered", "balsamic glaze", "fresh basil leaves, roughly chopped", "chopped pistachios", "red pepper flakes"], "instructions": ["Preheat oven to 400 degrees Fahrenheit. Line a baking sheet with parchment paper. Arrange the baguette slices on the baking sheet.", "Whisk together olive oil, salt, pepper, and garlic powder for the seasoned olive oil in a small bowl. Brush or drizzle the olive oil mixture evenly over the baguette slices. Bake for 5-7 minutes, or until golden brown and crispy. Remove from oven and let cool slightly.", "Season the ricotta with salt, pepper and fresh basil in a small bowl. Give it a good stir, then spoon it on to each baguette slice divided evenly between all slices.", "Arrange a few pieces of nectarine and cherry tomatoes on top of the ricotta. Drizzle balsamic glaze over the assembled crostini. Sprinkle with fresh basil, crushed pistachios, and red pepper flakes."]}
{"url": "https://ohsnapmacros.com/air-fryer-zucchini-fries/", "title": "Crispy Breaded Air Fryer Zucchini Fries - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "12 minutes", "ingredients": ["zucchini", "panko breadcrumbs", "grated parmesan cheese", "garlic powder", "Italian seasoning", "paprika", "salt", "pepper", "eggs", "all-purpose flour"], "instructions": ["Cut the zucchinis first in half, then into 1/8ths, so you end up with 16 pieces per zucchini. Dry them with a paper towel to absorb any extra moisture and season with salt. Let them sit for 5 minutes before patting dry again.", "Grab 3 shallow dishes and add flour to one. 2 beaten eggs to the second. In the third, whisk together the Panko, Parmesan cheese, garlic powder, Italian seasoning, paprika, salt and pepper.", "Dip each zucchini slice in flour, tapping excess off.", "Next, add to the egg mixture and evenly coat.", "Finally coat in the breadcrumb mixture, pressing the breadcrumbs into the zucchini so that it sticks.", "Arrange the coated zucchini sticks in a single layer in the air fryer basket. Spray the top with cooking spray. Air fry at 400 degrees Fahrenheit for 8-10 minutes (time may vary depending on your air fryer). Flip halfway through and spray again with cooking spray. The coating should be a golden color and nice and crispy on the outside. Serve with your favorite dipping sauce like marinara or ranch dressing."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/garlic-parmesan-potato-wedges/", "title": "Crispy Garlic Parmesan Potato Wedges (Air Fryer)  - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "15 minutes", "cook_time": "15 minutes", "ingredients": ["russet potoates, washed (peeled or unpeeled)", "ice water", "salt (for soaking)", "olive oil", "Parmesan cheese, freshly shredded", "salt (for seasoning mixture)", "garlic powder", "dried thyme", "garlic, minced", "chop fresh parsley, optional garnish"], "instructions": ["Cut each potato into 8 even wedges. Put the wedges into a large mixing bowl. Under cold running water, rinse as much potato starch off of the wedges as you can.", "Drain and refill with ice water. Add 2 tablespoons of salt and let the wedges soak for at least 10 minutes.  Preheat your air fryer if your model calls for preheating.", "When finished soaking, drain the water and lay the wedges on a large towel. Pat completely dry before adding them to a large mixing bowl.", "In a small bowl, mix the olive oil, Parmesan cheese, 1 tsp. salt, garlic powder, thyme, and minced garlic together. Pour the oil mixture over the potatoes and toss the wedges in the mixture until completely coated.", "Lay wedges in a single layer in the fryer basket. Sprinkle any remaining oil mixture over the wedges. You may need to work in batches depending on the size of your air fryer.", "Cook at 400 degrees Fahrenheit. for approximately 9-13 minutes, or until golden brown and a fork can be easily inserted. There’s no need to flip halfway through.", "Garnish with chopped parsley and additional Parmesan cheese, optional."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/teriyaki-beef-bowls/", "title": "Teriyaki Beef Bowls - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "10 minutes", "cook_time": "10 minutes", "ingredients": ["lean ground beef", "red bell pepper", "broccoli florettes", "shredded carrots", "garlic clove", "coconut aminos", "toasted sesame oil", "lite pancake syrup", "garlic powder", "ground ginger", "frozen cauliflower rice", "Uncle Ben's Ready Rice Jasmine", "coconut aminos", "green onions", "red pepper flakes"], "instructions": ["Heat a pan over medium, spray with cooking spray and add the ground beef. Using a spatula break the beef into bite size pieces as it cooks. Cook until it is fully cooked through and no longer pink in the center approximately 5-7 minutes.", "While the beef cooks add the chopped broccoli to a microwave safe bowl with a splash of water at the bottom. Microwave for 1 minutes to soften some. Once the beef is cooked through add the broccoli, bell peppers, carrots and garlic to the pan. Cook, stirring often until the vegetables have softened.", "Add the sauce ingredients to a bowl and whisk together. Add to the cooked beef and simmer for 5-10 minutes stirring to get everything evenly coated and the sauce soaked into the beef.", "Cook the cauliflower rice and jasmine according to their package instructions. Mix them two together in a bowl. Add chopped green onions, sprinkle of red pepper flakes and additional coconut aminos. Mix together to combine.", "Assemble the teriyaki beef bowls with the rice blend and cooked teriyaki beef.", "For meal prep: each teriyaki beef bowl gets 180 grams of teriyaki beef and 128 grams of rice blend. The recipe makes 4 bowls or servings. Optional, top with additional coconut aminos, red pepper flakes, and chopped green onions as desired."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/category/mocktail-recipes/", "title": "Mocktails Archives - Oh Snap Macros"}
{"url": "https://ohsnapmacros.com/cottage-cheese-pasta-sauce/", "title": "Tomato Garlic Cottage Cheese Pasta Sauce - Oh Snap Macros", "author": "Danielle Lima", "servings": "9", "prep_time": "5 minutes", "cook_time": "1 hour", "ingredients": ["olive oil", "garlic, minced", "yellow onion, finely chopped", "basil", "oregano", "salt", "fresh cracked black pepper", "tomato sauce", "tomato paste", "beef broth", "coconut aminos", "honey", "low fat cottage cheese", "beef broth"], "instructions": ["Add the olive oil to a large soup pot or Dutch oven over medium-high heat. Add garlic and onion and cook, stirring until fragrant and translucent.", "Add the basil, oregano, salt and pepper to the garlic and onions and stir to coat. Pour in the tomato sauce, tomato paste, beef broth, coconut aminos and honey and stir to combine. Bring to a boil and right when it starts popping, lower to a LOW simmer. Simmer for 1 hour, stirring occasionally.", "When the sauce is done, add the cottage cheese and remaining broth to a high speed blender or single cup and blend until smooth.", "Add the blended cottage cheese to the pasta sauce. Stir to combine and let simmer another 5 minutes to heat through.", "Add desired garnish and serve over your favorite pasta noodle."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/protein-pudding/", "title": "High Protein Velvety Chocolate Pudding - Oh Snap Macros", "author": "Danielle Lima", "servings": "2", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "1 hour", "ingredients": ["low-fat cottage cheese", "0% plain greek yogurt", "chocolate protein powder", "honey", "unsweetened cocoa powder"], "instructions": ["Add everything to a blender and blend for at least 5 minutes until fully combined and the cottage cheese is no longer chalky. You may need to stop and push the sides down the a rubbed spatula while blending to get everything to combine.", "Split evenly between two small pudding cups and let set in the fridge for at least one hour before enjoying.", "Top with fresh fruit, whipped cream and your favorite toppings or enjoy as is right out of the fridge."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/turkey-taco-bowls/", "title": "Turkey Burrito Bowls with Creamy Cilantro Dressing - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "15 minutes", "cook_time": "10 minutes", "ingredients": ["ground turkey", "Taco Seasoning", "olive oil", "red bell peppers, sliced", "red onion, sliced", "salt", "ground cumin", "chili powder", "garlic powder", "water", "frozen cauliflower rice (2, 12.oz bags)", "lime juice", "cilantro, chopped", "pinto chili beans in mild sauce, top sauce drained out", "romaine lettuce, chopped", "fresh cilantro", "low-fat cottage cheese", "non-fat plain Greek yogurt", "extra virgin olive oil", "garlic", "water", "salt", "apple cider vinegar", "fresh cracked pepper", "Cholula (or favorite hot sauce)"], "instructions": ["In a large skillet over medium heat, spray with nonstick spray and add the ground turkey. Cook breaking into bite size pieces until cooked through and no longer pink. Season with one packet of taco seasoning and combine. Remove from the pan and set aside.", "Heat the olive oil over medium heat in a large pan. Once hot add the peppers and onions and saute for 5 minutes. Add the salt, cumin, chili powder and garlic powder and stir to coat the peppers and omnions. Lower the heat to medium-low and add the water. Simmer for 5 minutes to soften the veggies. At the end you can up the heat one last time to get some added color on the veggies. Remove and set aside.", "While the peppers and onions cook, cook the cauliflower rice according to the package instructions. Combine in a bowl with lime juice and chopped cilantro and mix.", "Each burrito bowl gets 1 cup (183g) cauliflower rice, ⅓ cup (88g) pinto beans, 110g of peppers and onions, 3 oz. cooked turkey meat, ¼ the chopped lettuce and 62g of cilantro dressing.", "If meal prepping 4 bowls: add everything except the dressing, prep that in a small container to add on top when ready to enjoy. I enjoy this bowl at room temperature, so I zap it in the microwave (with the lettuce!) for 30 seconds or so. Add your favorite toppings like salsa, cheese, guac and olives."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/oven-baked-chicken-tenderloins/", "title": "The Juiciest Oven Baked Chicken Tenderloins - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "5 minutes", "cook_time": "20 minutes", "ingredients": ["chicken tenderloins", "soy sauce", "olive oil", "spicy brown mustard", "garlic powder", "ground ginger"], "instructions": ["Remove the tendon from the tenderloin by grabbing it with a paper towel and placing it between the tines of a fork and pulling down (see step by step images).", "Place the tenderloins in a sealable container and add the soy sauce, olive oil, spicy brown mustard, garlic powder and ground ginger. Put the lid on and shake so everything is evenly covered. Let set overnight OR just be sure to let it marinate while you preheat the oven.", "Preheat the oven to 350 degrees Fahrenheit. Spray a baking sheet with olive oil spray or nonstick spray. Remove the tenderloins from the marinade dish and add them to the prepared baking sheet in a even layer.", "Place in the preheated oven and bake for 15-17 minutes or until cooked through and no longer pink. Internal temperature should reach 165 degrees Fahrenheit with a meat thermometer for safety.", "Remove and enjoy."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/shrimp-and-chicken-fried-rice/", "title": "One Pan Shrimp and Chicken Fried Rice (high protein) - Oh Snap Macros", "author": "Danielle Lima", "servings": "5", "prep_time": "10 minutes", "cook_time": "18 minutes", "ingredients": ["boneless skinless chicken breast, cubed", "coconut aminos", "pinch of ground ginger", "shrimp, peeled and deveined, patted dry", "coconut aminos", "pinch of garlic powder", "olive oil", "uncooked boxed white Minute Rice", "water", "frozen cauliflower rice, cooked and drained", "garlic, minced", "red bell pepper, chopped", "carrots, chopped", "frozen green peas", "coconut aminos", "eggs", "coconut aminos", "green onions, chopped", "salt and black pepper, to taste"], "instructions": ["Chop the chicken into bite-size pieces and place in a bowl. Top with coconut aminos and ginger and mix to combine. In a separate bowl, add the shrimp and top with coconut aminos and garlic powder. Let both marinate while you cook the rice in the microwave.", "In a microwaveable bowl, add the dry rice and water and cook for 12 minutes (or according to the package instructions). Remove and place in the refrigerator right away until ready to add. Cook the cauliflower rice according to the package instructions and drain any excess liquid.", "Heat a large skillet over medium heat and add the olive oil. Once hot, add the chicken and spread into an even layer in the pan. Let the chicken cook, untouched, for 4-5 minutes to cook and brown on one side. Flip and cook an additional 3-4 minutes until the chicken is cooked through. Remove from the pan and set aside.", "Add the raw shrimp to the same pan and cook for 2-3 minutes on each side until the shrimp is cooked through, pink, and no longer translucent. Set aside with the cooked chicken.", "To the same pan, add the garlic, bell peppers, carrots and frozen peas. Saute for 5 minutes to brown and then add the coconut aminos to the pan. Without lowering the heat, let this boil and simmer for 3-4 minutes.", "Using a spatula push the vegetable mixture to the outer edges of the pan. Directly to the liquid in the center of the pan, crack the two eggs in and begin to stir and scramble. Mix to cook the eggs in the hot liquid, similar to dropping an egg in soup. You're scrambling the egg directly in the liquid. As it begins to cook, start to combine it into the vegetable mixture until fully combined and cooked through.", "Add the rice, cauliflower rice and the remaining 2 Tbsp. of coconut aminos to the pan and mix to combine. I like to let the rice burn on the bottom a little before mixing for crispy rice pieces. Mix and cook for an additional 5 minutes to heat the rice and burn the bottom some.", "Return the cooked chicken and shrimp to the pan and stir to mix into the rice. Let the rice cook until the chicken and shrimp are warm and ready to enjoy.", "Top with green onions and desired toppings."], "ratings": "4"}
{"url": "https://ohsnapmacros.com/dill-pickle-dip/", "title": "High Protein Fried Dill Pickle Dip - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "5 minutes", "cook_time": "3 minutes", "ingredients": ["panko breadcrumbs", "butter", "low fat cottage cheese", "nonfat plain 0% Greek yogurt", "1/3 less fat cream cheese", "pickle juice", "dill pickle rounds", "fresh dill", "garlic powder", "salt", "pepper", "vegetables", "crackers", "pita chips", "pita bread"], "instructions": ["Add the butter to a saucepan and melt over medium high heat. Add the panko breadcrumbs to the pan and coat with the melted butter. Continue to cook for a couple of minutes, just until the breadcrumbs are slightly browned.", "Add cottage cheese, greek yogurt, cream cheese, pickle juice, pickles, dill, garlic powder, salt and pepper to the mixing bowl. Add half of the breadcrumb mixture and mix everything together until thoroughly combined. Place it in the fridge covered to set for at least one hour before serving to let it thicken up and the flavors meld together.", "When ready to serve, top with the remaining browned breadcrumbs, fresh dill and serve with vegetables, crackers or pitas."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/high-protein-chicken-recipes/", "title": "20+ High Protein Macro-Friendly Chicken Recipes - Oh Snap Macros", "author": "Danielle Lima"}
{"url": "https://ohsnapmacros.com/10-high-protein-macro-friendly-recipes/", "title": "10 High Protein Macro Friendly Recipes - Oh Snap Macros", "author": "Danielle Lima"}
{"url": "https://ohsnapmacros.com/macro-friendly-costco-haul/", "title": "Macro Friendly Costco Haul - Oh Snap Macros", "author": "Danielle Lima"}
{"url": "https://ohsnapmacros.com/tracking-macros-the-ultimate-guide-to-tracking-your-macros/", "title": "Tracking Macros: The Basics - Oh Snap Macros", "author": "Danielle Lima"}
{"url": "https://ohsnapmacros.com/cinnamon-roll-french-toast-egg-bake/", "title": "Cinnamon Roll French Toast Egg Bake - Oh Snap Macros", "author": "Danielle Lima", "servings": "6", "prep_time": "10 minutes", "cook_time": "45 minutes", "ingredients": ["Kings Hawaiian Sweet Rolls", "brown sugar", "ground cinnamon", "container of egg whites – entire container", "eggs", "whole milk", "light pancake syrup", "pinch of salt", "powdered sugar", "vanilla protein powder", "whole milk"], "instructions": ["Preheat oven to 400. Spray 9×13 baking dish with nonstick spray. Note: if you use a different size pan your baking time will vary.", "Tear Hawaiian rolls into bite sizes pieces and layer the bottom of the pan. Mix sugar and cinnamon in a bowl and spread evenly over the rolls.", "In a separate bowl beat 3 eggs, milk and salt. Add egg whites and mix together. Top rolls with egg mixture.", "Finally, top with syrup and bake for 30 – 45 minutes (times may vary oven to oven – mine is done around 30/35). Once cooked and a toothpick comes out clean, cut into 6 equal squares and enjoy! At the time of serving you could add your favorite cinnamon roll frosting, french toast toppings, additional syrup, serve with sausage (my favorite way), or simply eat it as it is.", "Mix powdered sugar, protein powder and milk in a bowl. Drizzle over entire bake or save and serve with each square. You will have ~ 100g of icing / 10 servings. Icing macros: 10g = 23 cals : 1.4 P / 0.2 F / 4.2 C Total icing: 230 cals 14 P / 2 F / 42 C Nutrition facts listed without icing. Nutrition with icing in notes."], "ratings": "4.96"}
{"url": "https://ohsnapmacros.com/egg-white-quiche/", "title": "Egg White Quiche - Oh Snap Macros", "author": "Danielle Lima", "servings": "8", "prep_time": "20 minutes", "cook_time": "50 minutes", "ingredients": ["uncooked refrigerated pie crust", "bacon", "liquid egg whites", "chopped yellow onion", "garlic clove, minced", "whole milk", "Low-Moisture Part-Skim Mozzarella, shredded", "Arugula", "salt and pepper"], "instructions": ["Preheat oven according to pie crust package. Place one pie crust in a pie dish, poke a few holes in the bottom and bake 1/2 the recommended time. Example: if the package asks to bake at 425F for 12 minutes, cook at 425F for 6 minutes. When the crust is done cooking, remove from the oven and lower the temperature to 350F.", "While the pie crust bakes, cook and chop your bacon and prep your veggies. Heat a medium pan over medium and spray with cooking spray. Add garlic and onion and sauté until the onion begins to soften. Add arugula salt and mix until the arugula has wilted. Remove from heat and add cooked chopped bacon.", "In a bowl whisk together egg whites, milk, cheese, salt and pepper.", "Place the sauteed vegetables and bacon in the pie dish on top of the pie crust and evenly coat the bottom. Pour egg mixture over sauteed mixture. Be sure the cheese does not pool to the middle of the quiche, use a spoon to move around is needed.", "Bake at 350F for 45-50 minutes or longer until the egg its fully cooked and toothpick comes out clean. Always note – bake times will vary oven to oven.", "Slice into 8 equal slices and enjoy!"], "ratings": "5"}
{"url": "https://ohsnapmacros.com/blueberry-chia-seed-pudding/", "title": "Wild Blueberry Chia Seed Pudding - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "6 hours", "ingredients": ["wild blueberries", "chia seeds", "honey", "unsweetened vanilla almond milk", "vanilla protein powder (PESceience Gourmet Vanilla)"], "instructions": ["Add the blueberries to a small bowl and microwave for one minute. Using a fork or back of a spoon, mash the blueberries up and add to a mixing bowl.", "Top with chia seeds and honey.", "In a separate bowl or cup add the almond milk and protein powder. Mix to fully combine so no lumps remain and add to the chia seeds mixture. Mix to combine and place in the fridge to set for at least 4 hours or overnight.", "Delicious topped with additional defrosted (or even frozen!) wild blueberries or chopped nuts."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/smoothie-bowl/", "title": "Green Protein Smoothie Bowl (freezer prep favorite) - Oh Snap Macros", "author": "Danielle Lima", "servings": "4", "prep_time": "10 minutes", "cook_time": "2 minutes", "ingredients": ["golden kiwis (or green kiwis), skin on", "avocado", "cucumber", "spinach", "parsley", "lime juice", "pure pineapple juice", "vanilla protein powder", "golden kiwi (or green kiwi), skin on", "avocado", "cucumber", "spinach", "parsley", "pineapple juice", "lime juice (more if desired)", "vanilla protein powder", "water (more if needed)"], "instructions": ["Place 1 kiwi, ¼ avocado, ¼ cucumber, 1 handful of spinach and 2 Tbsp parsley in each freezer safe ziplock or reusable bag. Freeze at least overnight for the best results. This helps give you a deliciously cold smoothie base vs. room temp.", "When ready to enjoy your smoothie, add the contents of the frozen ingredients to the blender and add the lime juice, pineapple juice, water and protein powder of choice.", "Blend until smooth and no chunks remain. If your smoothie bowl is too thick just add more water until it’s your desired thickness.", "Top with your favorite toppings like chopped kiwis, blueberries, your favorite granola, coconut flakes, chia seeds and peanut butter."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/whole-wheat-protein-banana-bread-original-recipe/", "title": "Whole Wheat Protein Banana Bread (original recipe) - Oh Snap Macros", "author": "Danielle Lima", "servings": "10", "prep_time": "15 minutes", "cook_time": "50 minutes", "ingredients": ["bananas, mashed", "plain non-fat Greek yogurt", "unsweetened apple sauce", "honey or sugar substitute", "eggs", "vanilla extract", "whole wheat flour", "vanilla protein powder", "baking powder", "baking soda", "salt", "ground cinnamon", "chopped walnuts", "dark chocolate chips"], "instructions": ["Preheat your oven to 350 degrees Fahrenheit and prepare a loaf pan with non-stick cooking spray or line it with parchment paper.", "In a large bowl, combine the mashed bananas, Greek yogurt, applesauce, honey (or sugar substitute), eggs, and vanilla extract.", "In a separate bowl, combine the whole wheat flour, protein powder, baking powder, baking soda, salt, and cinnamon.", "Gradually add the dry ingredients to the wet ingredients, stirring until just combined. Be careful not to overmix as it can result in a dense bread.", "If using, fold in the chopped walnuts or dark chocolate chips.", "Pour the batter into the prepared loaf pan, smoothing the top with a spatula.", "Bake for 50 minutes (more if needed), or until a toothpick inserted into the center comes out clean or with a few moist crumbs. If the top is browning too quickly, you can cover the bread with a piece of aluminum foil.", "Allow the banana bread to cool in the pan for about 10 minutes before transferring it to a wire rack to cool completely."]}
{"url": "https://ohsnapmacros.com/protein-oatmeal/", "title": "Stovetop Chocolate Protein Oatmeal (31g protein) - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "2 minutes", "cook_time": "10 minutes", "total_time": "12 minutes", "ingredients": ["sprouted rolled oats*", "unsweetened vanilla almond milk", "chocolate protein powder, PEscience", "cocoa powder", "honey"], "instructions": ["Add oats and 1 cup almond milk (save 1/2 cup for later!) to a pot over medium high heat. Bring to a boil and reduce to medium. Stir and cook until the oats have soaked up most of the almond milk, approximately 5 minutes.", "While the oats cook, add the protein powder, cocoa powder, honey and additional ½ cup almond milk into a shaker cup or a mason jar and shake until well combined.", "Add the protein milk to the oats and stir to combine. Return to a boil and cook until it reaches your desired thickness. It will continue to thicken as it sits.", "Top with your favorite toppings like sliced bananas, peanut butter swirl, cocoa nibs or fresh berries."], "ratings": "5"}
{"url": "https://ohsnapmacros.com/coffee-protein-shake/", "title": "Coffee Peanut Butter Protein Shake - Oh Snap Macros", "author": "Danielle Lima", "servings": "1", "prep_time": "5 minutes", "cook_time": "0 minutes", "total_time": "5 minutes", "ingredients": ["brewed coffee, chilled", "unsweetened almond milk (or milk of choice)", "banana, frozen preferred", "protein powder (unflavored, chocolate or vanilla) PEScience Gourmet Vanilla", "peanut butter (or nut butter of choice)", "cocoa or cacao powder", "ground cinnamon", "ground cinnamon, for garnish"], "instructions": ["Place all ingredients in your blender jar, then cover and blend on low speed. Gradually increase blender speed until smooth. (If your blender has shake mode, you can use that).", "Pour your shake into a large glass. Top with additional cinnamon, if desired. Enjoy!"], "ratings": "5"}
